{
  "key": "china",
  "name": "China Family Adventure",
  "subtitle": "Interactive Trip Map",
  "flag": "🇨🇳",
  "defaultCenter": [
    30.0,
    114.0
  ],
  "defaultZoom": 5,
  "hotels": [
    {
      "name": "Rosewood Beijing",
      "coord": [
        39.9038,
        116.3997
      ],
      "desc": "Ultra-luxe modern palace; imperial courtyard design; Michelin dining",
      "longDesc": "Architectural marvel blending contemporary design with imperial courtyard elegance; world-class service, impeccable staff, and exquisite Michelin-starred cuisine define the ultimate Beijing luxury.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rosewood%20Beijing&center=39.9038,116.3997"
    },
    {
      "name": "Aman Summer Palace",
      "coord": [
        39.9984,
        116.2822
      ],
      "desc": "Exclusive lakeside; Ming-dynasty villas; peaceful gardens; oasis setting",
      "longDesc": "Intimate summer retreat featuring heritage Ming-dynasty-inspired architecture and serene waterside location; offers peaceful luxury perfect for families exploring near Forbidden City.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Aman%20Summer%20Palace&center=39.9984,116.2822"
    },
    {
      "name": "The Peninsula Beijing",
      "coord": [
        39.9094,
        116.4084
      ],
      "desc": "Grand classical design; rooftop spa/pool; Wangfujing prime location",
      "longDesc": "Iconic Beijing address with panoramic rooftop facilities overlooking the city and prime shopping district location; delivers timeless elegance and impeccable service for discerning travelers.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Peninsula%20Beijing&center=39.9094,116.4084"
    },
    {
      "name": "Waldorf Astoria Beijing",
      "coord": [
        39.9013,
        116.4089
      ],
      "desc": "Opulent palace-inspired interiors; afternoon tea; central location",
      "longDesc": "Extravagant luxury with classical Chinese aesthetic, legendary service, and prime proximity to cultural landmarks; an unforgettable Beijing experience. Premium accommodations and service.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Waldorf%20Astoria%20Beijing&center=39.9013,116.4089"
    },
    {
      "name": "Shangri-La Beijing",
      "coord": [
        39.9724,
        116.4551
      ],
      "desc": "Garden oasis; serene spa; kid-friendly pools; Summer Palace proximity",
      "longDesc": "Tranquil haven featuring lush gardens, excellent family facilities, and serene spa; ideally close to Summer Palace and natural attractions for family exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shangri-La%20Beijing&center=39.9724,116.4551"
    },
    {
      "name": "Hilton Beijing Wangfujing",
      "coord": [
        39.9097,
        116.4091
      ],
      "desc": "Downtown luxury on shopping street; rooftop bar; cosmopolitan ease",
      "longDesc": "Downtown luxury on premier shopping street with rooftop cocktails and contemporary comfort; convenient central location for shopping and culture. Premium accommodations and service.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hilton%20Beijing%20Wangfujing&center=39.9097,116.4091"
    },
    {
      "name": "Mandarin Oriental Beijing Qianmen",
      "coord": [
        39.8983,
        116.3975
      ],
      "desc": "Courtyard setting; near Forbidden City; imperial architecture; serene",
      "longDesc": "Serene courtyard hotel near Forbidden City; imperial architecture and lush gardens create a peaceful retreat in historic Beijing. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mandarin%20Oriental%20Beijing%20Qianmen&center=39.8983,116.3975"
    },
    {
      "name": "The Opposite House Beijing",
      "coord": [
        39.9774,
        116.4533
      ],
      "desc": "Contemporary design; art deco touches; Chaoyang nightlife location",
      "longDesc": "Sleek contemporary design in vibrant Chaoyang district; modern art and urban energy combined perfectly for contemporary travelers. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Opposite%20House%20Beijing&center=39.9774,116.4533"
    },
    {
      "name": "Pudong Shangri-La",
      "coord": [
        31.2361,
        121.515
      ],
      "desc": "Soaring riverside luxury; panoramic river views; destination dining",
      "longDesc": "Iconic Shanghai address with stunning Huangpu River vistas, contemporary luxury, and world-class dining options for discerning travelers. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pudong%20Shangri-La&center=31.2361,121.515"
    },
    {
      "name": "The Bund Luxury Hotel",
      "coord": [
        31.2415,
        121.4873
      ],
      "desc": "Historic 1920s landmark; walkable Bund; heritage architecture preserved",
      "longDesc": "Beautifully restored colonial-era property on famous Bund; steps from shopping, museums, and dining. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Bund%20Luxury%20Hotel&center=31.2415,121.4873"
    },
    {
      "name": "JW Marriott Tomorrow Square",
      "coord": [
        31.2295,
        121.4749
      ],
      "desc": "Modern tower with rooftop spa/bar; central location; tech-forward amenities",
      "longDesc": "Contemporary luxury with panoramic city views; convenient access to Jing'an and People's Square. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=JW%20Marriott%20Tomorrow%20Square&center=31.2295,121.4749"
    },
    {
      "name": "Park Hyatt Shanghai",
      "coord": [
        31.2467,
        121.5069
      ],
      "desc": "Top 91 floors; futuristic tower; sky-high spa & pool excellence",
      "longDesc": "Soaring ultra-luxury from world's tallest hotels; dining overlooks entire metropolis. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Park%20Hyatt%20Shanghai&center=31.2467,121.5069"
    },
    {
      "name": "Fairmont Peace Hotel",
      "coord": [
        31.2406,
        121.4821
      ],
      "desc": "Legendary 1929 Art Deco landmark; historic character; iconic rooftop",
      "longDesc": "Storied 1920s-era palace with rooftop bar overlooking Bund; preserved heritage meets comfort. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Fairmont%20Peace%20Hotel&center=31.2406,121.4821"
    },
    {
      "name": "The Westin Bund Center Shanghai",
      "coord": [
        31.238,
        121.5
      ],
      "desc": "Riverside modern luxury; artistic design; innovative dining options",
      "longDesc": "Riverside luxury featuring contemporary art collections and innovative restaurants; premium Bund-adjacent location without the typical crowds. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Westin%20Bund%20Center%20Shanghai&center=31.238,121.5"
    },
    {
      "name": "Peninsula Shanghai",
      "coord": [
        31.2405,
        121.4826
      ],
      "desc": "Ultra-contemporary on Bund; minimalist design; rooftop infinity pool",
      "longDesc": "Ultra-modern Peninsula property with minimalist elegance, sophisticated design, and rooftop infinity pool overlooking the famous Bund. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Peninsula%20Shanghai&center=31.2405,121.4826"
    },
    {
      "name": "Ritz-Carlton Shanghai Pudong",
      "coord": [
        31.2461,
        121.5065
      ],
      "desc": "Soaring tower luxury; panoramic views; spa in clouds; world-class",
      "longDesc": "Sky-high Ritz-Carlton with panoramic views from upper-floor spa and pool; ultimate urban sanctuary overlooking entire city. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ritz-Carlton%20Shanghai%20Pudong&center=31.2461,121.5065"
    },
    {
      "name": "Regent Hong Kong",
      "coord": [
        22.2967,
        114.1745
      ],
      "desc": "Reimagined Kowloon flagship; Victoria Harbour views; Michelin dining",
      "longDesc": "Stunning waterfront luxury with elegantly reimagined suites overlooking iconic Victoria Harbour. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Regent%20Hong%20Kong&center=22.2967,114.1745"
    },
    {
      "name": "The Upper House",
      "coord": [
        22.2775,
        114.1664
      ],
      "desc": "André Fu design; spacious rooms; walkable Central & SoHo neighborhoods",
      "longDesc": "Architect-designed luxury with generous suites; prime location for vibrant neighborhoods. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Upper%20House&center=22.2775,114.1664"
    },
    {
      "name": "Four Seasons Hong Kong",
      "coord": [
        22.2866,
        114.1567
      ],
      "desc": "Harbourside retreat; world-class spa; Michelin restaurants Caprice & Lung",
      "longDesc": "Premier waterside sanctuary with indulgent spa and Michelin-starred dining excellence. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Four%20Seasons%20Hong%20Kong&center=22.2866,114.1567"
    },
    {
      "name": "The Peninsula Hong Kong",
      "coord": [
        22.2951,
        114.1718
      ],
      "desc": "Legendary service; iconic afternoon tea; rooftop pool with skyline",
      "longDesc": "Legendary hotel renowned for impeccable service; rooftop pool and afternoon tea traditions. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Peninsula%20Hong%20Kong&center=22.2951,114.1718"
    },
    {
      "name": "Island Shangri-La Hong Kong",
      "coord": [
        22.2772,
        114.1645
      ],
      "desc": "Family Suites playful themes; central location; big pool and spa",
      "longDesc": "Family-friendly sanctuary with themed suites, generous pools, and direct Central access. Exceptional destination for cultural and culinary exploration. Spacious accommodations, excellent facilities, and kid-friendly services make this ideal for traveling families and children.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Island%20Shangri-La%20Hong%20Kong&center=22.2772,114.1645"
    },
    {
      "name": "Rosewood Hong Kong",
      "coord": [
        22.2947,
        114.1758
      ],
      "desc": "Sky-high rooms; K11 MUSEA connection; acclaimed bars & dining",
      "longDesc": "Sky-high sanctuary connected to art and design venues; perfect for architecture-loving families. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rosewood%20Hong%20Kong&center=22.2947,114.1758"
    },
    {
      "name": "The Ritz-Carlton Hong Kong",
      "coord": [
        22.3033,
        114.1602
      ],
      "desc": "World's highest hotel; panoramic harbour views; top-floor spa/pool",
      "longDesc": "World's highest hotel with panoramic harbour vistas and incredible three-side views. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Ritz-Carlton%20Hong%20Kong&center=22.3033,114.1602"
    },
    {
      "name": "Mandarin Oriental Hong Kong",
      "coord": [
        22.2819,
        114.1594
      ],
      "desc": "Historic luxury address; world-renowned spa; classic bars; walkable shops",
      "longDesc": "Historic luxury with world-renowned spa and walkable access to premier shopping and dining. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mandarin%20Oriental%20Hong%20Kong&center=22.2819,114.1594"
    },
    {
      "name": "The Landmark Mandarin Oriental",
      "coord": [
        22.2808,
        114.1577
      ],
      "desc": "Urban spa excellence; sleek modern rooms; Landmark luxury shopping steps",
      "longDesc": "Sleek urban sanctuary steps from luxury shopping and vibrant dining scene. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Landmark%20Mandarin%20Oriental&center=22.2808,114.1577"
    },
    {
      "name": "The Murray Hong Kong",
      "coord": [
        22.2781,
        114.1601
      ],
      "desc": "Heritage-adaptive reuse; rooftop views; easy Peak Tram and parks",
      "longDesc": "Beautifully restored heritage hotel; strategically located for Peak Tram and serene parks. Exceptional destination for cultural and culinary exploration. Beautiful landscapes, recreational facilities, and serene spaces provide ideal family relaxation and outdoor exploration opportunities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Murray%20Hong%20Kong&center=22.2781,114.1601"
    },
    {
      "name": "Shangri-La Chengdu",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Luxury urban retreat; garden spa; Sichuan dining showcase excellence",
      "longDesc": "Urban luxury oasis with lush gardens and authentic Sichuan dining; ideal for pandas and temples. Premium accommodations and service. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shangri-La%20Chengdu&center=30.5728,104.0662"
    },
    {
      "name": "Kewei Hotel Chengdu",
      "coord": [
        30.5682,
        104.0583
      ],
      "desc": "Intimate boutique design; cultural immersion; local character expressed",
      "longDesc": "Thoughtfully designed boutique celebrating local Sichuan culture and cuisine. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Kewei%20Hotel%20Chengdu&center=30.5682,104.0583"
    },
    {
      "name": "Wide And Far Boutique Hotel",
      "coord": [
        30.5668,
        104.0598
      ],
      "desc": "Design-forward boutique; contemporary Asian aesthetic; vibrant tea",
      "longDesc": "Modern boutique with sophisticated design and authentic tea experiences. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Wide%20And%20Far%20Boutique%20Hotel&center=30.5668,104.0598"
    },
    {
      "name": "Lazart Culture Hotel",
      "coord": [
        30.5642,
        104.0501
      ],
      "desc": "Artistic boutique design; gallery spaces; curated art collections",
      "longDesc": "Creatively designed hotel celebrating local artists; intimate galleries throughout. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lazart%20Culture%20Hotel&center=30.5642,104.0501"
    },
    {
      "name": "Shangri-La Xi'an",
      "coord": [
        34.3416,
        109.0357
      ],
      "desc": "Grand palace-inspired luxury; traditional gardens; Tang Dynasty theme",
      "longDesc": "Opulent hotel recreating ancient Silk Road elegance; perfect gateway for Warriors exploration. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shangri-La%20Xi%27an&center=34.3416,109.0357"
    },
    {
      "name": "Sofitel Legend People's Grand Hotel",
      "coord": [
        34.3466,
        109.0365
      ],
      "desc": "Historic 1950s grand hotel; city views; Bell Tower central location",
      "longDesc": "Iconic 1950s-era property with restored elegance near ancient Bell Tower and walls. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sofitel%20Legend%20People%27s%20Grand%20Hotel&center=34.3466,109.0365"
    },
    {
      "name": "Pullman Xi'an",
      "coord": [
        34.3355,
        109.0442
      ],
      "desc": "Modern comfort; excellent business amenities; museum-adjacent location",
      "longDesc": "Contemporary comfort with convenient location near museums and cultural sites. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pullman%20Xi%27an&center=34.3355,109.0442"
    },
    {
      "name": "Jin Yang Hotel",
      "coord": [
        34.3401,
        109.0456
      ],
      "desc": "Upscale local favorite; traditional touches; Tang Dynasty dining",
      "longDesc": "Premium hotel with thoughtful regional design; authentic Tang Dynasty cuisine. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jin%20Yang%20Hotel&center=34.3401,109.0456"
    },
    {
      "name": "Ritz-Carlton Guangzhou",
      "coord": [
        23.1291,
        113.2644
      ],
      "desc": "Pearl River luxury; rooftop bars; contemporary elegance; modern",
      "longDesc": "Ultra-contemporary Ritz-Carlton with rooftop bars overlooking Pearl River. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ritz-Carlton%20Guangzhou&center=23.1291,113.2644"
    },
    {
      "name": "Shangri-La Guangzhou",
      "coord": [
        23.1265,
        113.2626
      ],
      "desc": "Riverside retreat; Cantonese dining; garden oasis; premium setting",
      "longDesc": "Riverside luxury with excellent Cantonese dining and lush gardens. Premium accommodations and service. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shangri-La%20Guangzhou&center=23.1265,113.2626"
    },
    {
      "name": "White Swan Hotel Guangzhou",
      "coord": [
        23.1113,
        113.2515
      ],
      "desc": "Iconic riverside hotel; white architecture; serene pool courtyards",
      "longDesc": "Iconic white hotel on river; serene courtyards and thoughtful design. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=White%20Swan%20Hotel%20Guangzhou&center=23.1113,113.2515"
    },
    {
      "name": "Banyan Tree Lijiang",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Ultra-luxury mountain retreat; private villas; cultural immersion",
      "longDesc": "Exclusive mountain sanctuary with private villas; unforgettable seclusion. Scenic hiking and adventure opportunities. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Banyan%20Tree%20Lijiang&center=26.8738,100.2318"
    },
    {
      "name": "The Leela Guilin",
      "coord": [
        25.2908,
        110.2911
      ],
      "desc": "Riverside palace; karst landscape views; romantic elegance",
      "longDesc": "Romantic waterside palace with stunning karst views; perfect for couples. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Leela%20Guilin&center=25.2908,110.2911"
    },
    {
      "name": "Hangzhou Amanfayun",
      "coord": [
        30.2268,
        120.09
      ],
      "desc": "Heritage villa compound; ancient village immersion; private tea",
      "longDesc": "Exclusive village-inspired retreat with private tea houses; meditative escape. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20Amanfayun&center=30.2268,120.09"
    }
  ],
  "restaurants": [
    {
      "name": "Jing",
      "coord": [
        39.907,
        116.409
      ],
      "desc": "3* Michelin; refined Chinese/international fusion; intimate menus",
      "longDesc": "Beijing's most prestigious dining room; chef's 12-course journey blending French and Chinese. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jing&center=39.907,116.409"
    },
    {
      "name": "Ai Ti Liao",
      "coord": [
        39.8989,
        116.4007
      ],
      "desc": "Peking Duck specialist; 4 generations; family craft; crispy perfection",
      "longDesc": "Legendary Peking Duck mastery perfected over generations; each slice is crispy revelation. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ai%20Ti%20Liao&center=39.8989,116.4007"
    },
    {
      "name": "Zhu Wei Xuan",
      "coord": [
        39.9067,
        116.3976
      ],
      "desc": "Imperial Qing Dynasty cuisine; palace recipes; formal service ritual",
      "longDesc": "Rare palace cuisine served with ceremonial reverence; eat as emperors once did. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Zhu%20Wei%20Xuan&center=39.9067,116.3976"
    },
    {
      "name": "Duyichu",
      "coord": [
        39.9132,
        116.4015
      ],
      "desc": "Historic dim sum palace; 300+ varieties daily; Beijing institution",
      "longDesc": "Iconic dim sum house serving 300+ varieties daily; local favorite since 1738. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Duyichu&center=39.9132,116.4015"
    },
    {
      "name": "Gui Man Tang",
      "coord": [
        39.8956,
        116.4056
      ],
      "desc": "Sichuan spice temple; chongqing chicken; heat-seeker paradise",
      "longDesc": "Fiery Sichuan heaven; their chongqing chicken makes your mouth sing with sweat. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gui%20Man%20Tang&center=39.8956,116.4056"
    },
    {
      "name": "Quanjude",
      "coord": [
        39.9014,
        116.3945
      ],
      "desc": "Historic Peking Duck institution; 150+ year legacy; wood-fired",
      "longDesc": "150-year-old Peking Duck legend; carving ceremony at your table is pure theater. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Quanjude&center=39.9014,116.3945"
    },
    {
      "name": "Huang Cheng Lao Ma",
      "coord": [
        39.9043,
        116.3992
      ],
      "desc": "Hot pot temple; Sichuan broth mastery; fun group dining",
      "longDesc": "Bustling hot pot epicenter with addictive chili broths and lively atmosphere. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Huang%20Cheng%20Lao%20Ma&center=39.9043,116.3992"
    },
    {
      "name": "Baoyue Lou",
      "coord": [
        39.9095,
        116.4102
      ],
      "desc": "Roast and braise specialist; whole fish Suzhou-style; sophisticated",
      "longDesc": "Sophisticated Suzhou cuisine focusing on perfect braises and roasts. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Baoyue%20Lou&center=39.9095,116.4102"
    },
    {
      "name": "Capital M",
      "coord": [
        39.9065,
        116.4089
      ],
      "desc": "Modern Italian; canal-side location; wine cellar; romantic elegance",
      "longDesc": "Spectacular canal-view Italian gem with exceptional wines; romantic favorite. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Capital%20M&center=39.9065,116.4089"
    },
    {
      "name": "Peking Duck at Xianyuantan",
      "coord": [
        39.8937,
        116.4001
      ],
      "desc": "Roasted duck perfection; traditional tableside carving; historic",
      "longDesc": "Devoted to perfect roasted duck carved tableside with ceremonial precision. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Peking%20Duck%20at%20Xianyuantan&center=39.8937,116.4001"
    },
    {
      "name": "Siji Minfu",
      "coord": [
        39.9128,
        116.4022
      ],
      "desc": "Cantonese dim sum; 60+ varieties; high-touch service; morning ritual",
      "longDesc": "Cantonese dim sum temple with 60+ varieties; breakfast here is daily ritual. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Siji%20Minfu&center=39.9128,116.4022"
    },
    {
      "name": "Lao She Teahouse",
      "coord": [
        39.9032,
        116.4065
      ],
      "desc": "Traditional tea culture; Peking Opera performances; classic snacks",
      "longDesc": "Historic teahouse with Peking Opera performances and traditional snacks. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lao%20She%20Teahouse&center=39.9032,116.4065"
    },
    {
      "name": "Yu Yue Heen",
      "coord": [
        31.2363,
        121.5157
      ],
      "desc": "3* Michelin Cantonese; contemporary dim sum; haute cuisine",
      "longDesc": "Shanghai's three-star dining room; contemporary dim sum elevation and classical techniques. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yu%20Yue%20Heen&center=31.2363,121.5157"
    },
    {
      "name": "Jade Mansion",
      "coord": [
        31.24,
        121.4845
      ],
      "desc": "Michelin-starred dim sum; handmade traditional; old Shanghai charm",
      "longDesc": "Historic dim sum master; every dumpling handmade with traditional techniques. Exceptional destination for cultural and culinary exploration. Handmade dumplings and traditional preparations showcase delicate craftsmanship and culinary precision daily.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jade%20Mansion&center=31.24,121.4845"
    },
    {
      "name": "Noble House Noodles",
      "coord": [
        31.2287,
        121.4892
      ],
      "desc": "Hand-pulled noodles; Shanghainese soul food; honest flavors",
      "longDesc": "Artisanal hand-pulled noodles that sing with sesame and Shanghainese soul. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Noble%20House%20Noodles&center=31.2287,121.4892"
    },
    {
      "name": "L'Atelier de Joël Robuchon",
      "coord": [
        31.238,
        121.5079
      ],
      "desc": "Michelin-starred French counter; theatrical open kitchen; visual",
      "longDesc": "Theatrical counter dining where Michelin-starred French technique unfolds before you. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=L%27Atelier%20de%20Jo%C3%ABl%20Robuchon&center=31.238,121.5079"
    },
    {
      "name": "Ultraviolet",
      "coord": [
        31.2341,
        121.4778
      ],
      "desc": "Ultra-exclusive 10-seat molecular; immersive art installations",
      "longDesc": "Secretive 10-seat molecular theater; every dish is sensory art combined. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ultraviolet&center=31.2341,121.4778"
    },
    {
      "name": "Xiao Fei Yang Hot Pot",
      "coord": [
        31.2305,
        121.4871
      ],
      "desc": "Hot pot dynasty; premium broths; Mongolian lamb; group dining",
      "longDesc": "Shanghai's hottest hot pot chain; premium broths and lamb cooked in seconds. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xiao%20Fei%20Yang%20Hot%20Pot&center=31.2305,121.4871"
    },
    {
      "name": "Shang-High Tea",
      "coord": [
        31.2418,
        121.4829
      ],
      "desc": "Art Deco afternoon tea; colonial-era elegance; pastry perfection",
      "longDesc": "Beautifully restored colonial afternoon tea experience with perfect pastries. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shang-High%20Tea&center=31.2418,121.4829"
    },
    {
      "name": "El Willy",
      "coord": [
        31.2346,
        121.4982
      ],
      "desc": "Spanish tapas bar; Iberian treasures; lively Mediterranean vibe",
      "longDesc": "Lively Spanish tapas temple with jamón, seafood, and Mediterranean wines. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=El%20Willy&center=31.2346,121.4982"
    },
    {
      "name": "Fu 1088",
      "coord": [
        31.2292,
        121.4756
      ],
      "desc": "Innovative Shanghainese; playful modern technique; seasonal creativity",
      "longDesc": "Playful Shanghainese cuisine reimagined with modern technique; every dish surprises. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Fu%201088&center=31.2292,121.4756"
    },
    {
      "name": "Chun Fang Noodles",
      "coord": [
        31.2276,
        121.4891
      ],
      "desc": "Hand-cut shank noodles; savory broth; generations-old recipe",
      "longDesc": "Generations-old shank noodle recipe; broth is slow-simmered perfection. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chun%20Fang%20Noodles&center=31.2276,121.4891"
    },
    {
      "name": "Shanghai Laozha",
      "coord": [
        31.2311,
        121.4884
      ],
      "desc": "Shredded pork & pickled vegetables; local favorite; 70-year tradition",
      "longDesc": "Iconic shredded pork specialty beloved since 1950s; authentic Shanghai dumpling. Exceptional destination for cultural and culinary exploration. Handmade dumplings and traditional preparations showcase delicate craftsmanship and culinary precision daily.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Laozha&center=31.2311,121.4884"
    },
    {
      "name": "Beefbar Shanghai",
      "coord": [
        31.2394,
        121.5091
      ],
      "desc": "Wagyu temple; theater-style grilling; premium cuts celebration",
      "longDesc": "Wagyu paradise where premium beef is grilled table-side to perfection. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beefbar%20Shanghai&center=31.2394,121.5091"
    },
    {
      "name": "Din Tai Fung Shanghai",
      "coord": [
        31.2295,
        121.4872
      ],
      "desc": "Xiaolongbao temple; soup dumpling perfection; efficient precision",
      "longDesc": "Legendary dumpling house; their soup dumplings with perfect skin and broth. Exceptional destination for cultural and culinary exploration. Handmade dumplings and traditional preparations showcase delicate craftsmanship and culinary precision daily.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Din%20Tai%20Fung%20Shanghai&center=31.2295,121.4872"
    },
    {
      "name": "Chez Panisse Shanghai",
      "coord": [
        31.2268,
        121.4726
      ],
      "desc": "French casual elegance; market-driven menus; wine bar charm",
      "longDesc": "Relaxed French bistro with market-driven menus and excellent wines. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chez%20Panisse%20Shanghai&center=31.2268,121.4726"
    },
    {
      "name": "Ta Vie",
      "coord": [
        22.2825,
        114.1602
      ],
      "desc": "3* Michelin; French-Japanese fusion; tasting menus; intimate",
      "longDesc": "Hong Kong's culinary gem; delicate French technique fused with Japanese precision. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ta%20Vie&center=22.2825,114.1602"
    },
    {
      "name": "T'ang Court",
      "coord": [
        22.3033,
        114.1602
      ],
      "desc": "Cantonese 3* Michelin; dim sum art; roasted perfection excellence",
      "longDesc": "Michelin-starred Cantonese temple; dim sum elevated to high art. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=T%27ang%20Court&center=22.3033,114.1602"
    },
    {
      "name": "Sushi Shikon",
      "coord": [
        22.2948,
        114.1758
      ],
      "desc": "Japanese 3* Michelin; 11-seat omakase; fish-forward purity",
      "longDesc": "Intimate 11-seat sushi sanctuary; each piece is chef's meditation on fish. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sushi%20Shikon&center=22.2948,114.1758"
    },
    {
      "name": "Lung King Heen",
      "coord": [
        22.2866,
        114.1567
      ],
      "desc": "Cantonese 2* Michelin; dim sum royalty; harbor views exclusive",
      "longDesc": "Michelin-starred dim sum temple with stunning harbor views and elegance. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lung%20King%20Heen&center=22.2866,114.1567"
    },
    {
      "name": "Caprice",
      "coord": [
        22.2866,
        114.1567
      ],
      "desc": "French 2* Michelin; classic technique; elegant fine dining",
      "longDesc": "Classic French fine dining with impeccable service and wine excellence. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Caprice&center=22.2866,114.1567"
    },
    {
      "name": "Lai Ching Heen",
      "coord": [
        22.2934,
        114.174
      ],
      "desc": "Cantonese 2* Michelin; roasted meats; dim sum excellence",
      "longDesc": "Michelin-starred Cantonese temple famous for roasted meats and artistry. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lai%20Ching%20Heen&center=22.2934,114.174"
    },
    {
      "name": "Amber at Mandarin Oriental",
      "coord": [
        22.2819,
        114.1594
      ],
      "desc": "French 2* Michelin; contemporary cuisine; elegant atmosphere",
      "longDesc": "Contemporary French elegance with attentive service; one of Hong Kong's finest. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Amber%20at%20Mandarin%20Oriental&center=22.2819,114.1594"
    },
    {
      "name": "Summer Palace",
      "coord": [
        22.2866,
        114.1567
      ],
      "desc": "Northern Chinese 1* Michelin; dumpling perfection; minimalist",
      "longDesc": "Minimalist Northern Chinese dumpling temple; each xiaolongbao is a perfect parcel of carefully crafted flavor and delicate texture, prepared with artisanal precision.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Summer%20Palace&center=22.2866,114.1567"
    },
    {
      "name": "Peking Garden",
      "coord": [
        22.2971,
        114.1745
      ],
      "desc": "Peking Duck legend; 40+ year institution; tableside carving",
      "longDesc": "40-year Peking Duck institution; carving ceremony at your table is theater. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Peking%20Garden&center=22.2971,114.1745"
    },
    {
      "name": "Dim Sum Square",
      "coord": [
        22.3007,
        114.1738
      ],
      "desc": "Michelin-recommended dim sum; 100+ varieties; trolley service",
      "longDesc": "Bustling dim sum hall with 100+ varieties; trolley service is quintessential Hong Kong. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dim%20Sum%20Square&center=22.3007,114.1738"
    },
    {
      "name": "Lung Shan Tso",
      "coord": [
        22.2825,
        114.1602
      ],
      "desc": "Seafood Cantonese; live tanks; market-fresh daily specials",
      "longDesc": "Live seafood tanks showcase daily catch; Cantonese preparations highlight quality. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lung%20Shan%20Tso&center=22.2825,114.1602"
    },
    {
      "name": "Tim Ho Wan",
      "coord": [
        22.2888,
        114.1667
      ],
      "desc": "Michelin-starred dim sum; humble storefront; legendary dumplings",
      "longDesc": "Michelin-star dim sum in humble storefront; great food needs no setting. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Tim%20Ho%20Wan&center=22.2888,114.1667"
    },
    {
      "name": "The Hong Kong Jockey Club Bar & Grill",
      "coord": [
        22.3033,
        114.1602
      ],
      "desc": "Classic steakhouse; heritage establishment; old-world charm",
      "longDesc": "Historic steakhouse with old-world charm; institution where expats and locals celebrate. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Hong%20Kong%20Jockey%20Club%20Bar%20%26%20Grill&center=22.3033,114.1602"
    },
    {
      "name": "Bubba Gump Shrimp Hong Kong",
      "coord": [
        22.285,
        114.172
      ],
      "desc": "Casual beachfront seafood; Victoria views; fun family dining",
      "longDesc": "Casual beachfront seafood with panoramic harbour views; family-friendly. Exceptional destination for cultural and culinary exploration. Spacious accommodations, excellent facilities, and kid-friendly services make this ideal for traveling families and children.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bubba%20Gump%20Shrimp%20Hong%20Kong&center=22.285,114.172"
    },
    {
      "name": "Yung Kee Restaurant",
      "coord": [
        22.2968,
        114.1747
      ],
      "desc": "Roast goose legend; Cantonese classics; institution since 1928",
      "longDesc": "Legendary Cantonese roast goose house since 1928; perfect goose skin. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yung%20Kee%20Restaurant&center=22.2968,114.1747"
    },
    {
      "name": "Yu's Family Kitchen",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Sichuan spice mastery; mapo tofu legend; numbing pepper bliss",
      "longDesc": "Legendary Sichuan heat; their mapo tofu is numbing, spicy revelation. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yu%27s%20Family%20Kitchen&center=30.5728,104.0662"
    },
    {
      "name": "Xiang Zhu Ji Dan Zi",
      "coord": [
        30.5642,
        104.0501
      ],
      "desc": "Fragrant rice noodles; Chengdu-style comfort; casual perfection",
      "longDesc": "Casual Chengdu gem serving fragrant rice noodles with local intensity. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xiang%20Zhu%20Ji%20Dan%20Zi&center=30.5642,104.0501"
    },
    {
      "name": "Chen Mapo Tofu",
      "coord": [
        30.5668,
        104.0598
      ],
      "desc": "Mapo tofu birthplace; historic recipe; must-try pilgrimage",
      "longDesc": "Original mapo tofu birthplace; pilgrimage for serious Sichuan enthusiasts. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chen%20Mapo%20Tofu&center=30.5668,104.0598"
    },
    {
      "name": "Chengdu Hot Pot Paradise",
      "coord": [
        30.5682,
        104.0583
      ],
      "desc": "Hot pot temple; custom broths; interactive feast; group dining",
      "longDesc": "Vibrant hot pot epicenter with customizable broths and communal atmosphere. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Hot%20Pot%20Paradise&center=30.5682,104.0583"
    },
    {
      "name": "Guangya Dumpling Parlor",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Steamed dumplings; fold-by-fold craftsmanship; savory perfection",
      "longDesc": "Handmade dumpling artistry; each fold is evidence of generations of craft. Exceptional destination for cultural and culinary exploration. Handmade dumplings and traditional preparations showcase delicate craftsmanship and culinary precision daily.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guangya%20Dumpling%20Parlor&center=30.5728,104.0662"
    },
    {
      "name": "Tian Fu Old Kitchen",
      "coord": [
        30.5668,
        104.0598
      ],
      "desc": "Sichuan comfort classics; rustic elegance; authentic flavors",
      "longDesc": "Rustic Sichuan comfort cooking; the kind of place where locals eat daily. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Tian%20Fu%20Old%20Kitchen&center=30.5668,104.0598"
    },
    {
      "name": "Yulin Hot Pot",
      "coord": [
        30.5642,
        104.0501
      ],
      "desc": "Yulin-style hot pot; traditional spices; adventurous eaters",
      "longDesc": "Traditional Yulin-style hot pot with unique flavor; adventurous dining. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yulin%20Hot%20Pot&center=30.5642,104.0501"
    },
    {
      "name": "Sweet Water Noodle House",
      "coord": [
        30.5682,
        104.0583
      ],
      "desc": "Dan dan noodles; sesame sauce mastery; breakfast staple",
      "longDesc": "Perfected dan dan noodles; sesame sauce and pepper create breakfast. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sweet%20Water%20Noodle%20House&center=30.5682,104.0583"
    },
    {
      "name": "Sichuan Cuisine Fine Dining",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Haute Sichuan; refined plating; ingredient-focused; upscale",
      "longDesc": "Elevated Sichuan cuisine with refined plating and premium ingredients. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sichuan%20Cuisine%20Fine%20Dining&center=30.5728,104.0662"
    },
    {
      "name": "Da Qin Xiaochi",
      "coord": [
        34.3416,
        109.0357
      ],
      "desc": "Ancient Silk Road flavors; spiced breads; street food elevation",
      "longDesc": "Silk Road spiced breads and ancient flavors; street food elevated. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Da%20Qin%20Xiaochi&center=34.3416,109.0357"
    },
    {
      "name": "Jia Wei Shuang Shi Fu",
      "coord": [
        34.3466,
        109.0365
      ],
      "desc": "Oil-splashed noodles; cold dishes; Tang Dynasty recipes; rustic",
      "longDesc": "Oil-splashed noodles perfected; Tang Dynasty recipes with sophistication. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jia%20Wei%20Shuang%20Shi%20Fu&center=34.3466,109.0365"
    },
    {
      "name": "Xu's Restaurant",
      "coord": [
        34.3355,
        109.0442
      ],
      "desc": "Lamb-focused Shaanxi cuisine; cumin-spiced perfection; institution",
      "longDesc": "Cumin-spiced lamb specialties; Shaanxi classics executed with pride. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xu%27s%20Restaurant&center=34.3355,109.0442"
    },
    {
      "name": "La Mian Workshop",
      "coord": [
        34.3401,
        109.0456
      ],
      "desc": "Hand-pulled la mian noodles; acrobatic craft; street theater",
      "longDesc": "Watch chefs hand-pull la mian in acrobatic displays; theater and perfume. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Mian%20Workshop&center=34.3401,109.0456"
    },
    {
      "name": "Muslim Quarter Kebab Masters",
      "coord": [
        34.3466,
        109.0365
      ],
      "desc": "Lamb kebab perfection; Silk Road spices; grilled smoke theater",
      "longDesc": "Historic Muslim Quarter lamb kebabs; charcoal-grilled perfection. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Muslim%20Quarter%20Kebab%20Masters&center=34.3466,109.0365"
    },
    {
      "name": "Biang Biang Noodles",
      "coord": [
        34.3416,
        109.0357
      ],
      "desc": "Wide slapped noodles; hand-craft visible; comforting bowls",
      "longDesc": "Handmade wide noodles slapped before your eyes; comfort with performance. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Biang%20Biang%20Noodles&center=34.3416,109.0357"
    },
    {
      "name": "Song Dynasty Banquet",
      "coord": [
        34.3401,
        109.0456
      ],
      "desc": "Ancient dynasty banquet recreation; historical recipes; ceremonial",
      "longDesc": "Historically-inspired banquet recreating Tang Dynasty tables ceremonially. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Song%20Dynasty%20Banquet&center=34.3401,109.0456"
    },
    {
      "name": "Shaanxi Roujiamo House",
      "coord": [
        34.3466,
        109.0365
      ],
      "desc": "Spiced meat-filled flatbread; hand-shredded meat; street perfection",
      "longDesc": "Perfected roujiamo with hand-shredded lamb and spices; iconic street food. Exceptional destination for cultural and culinary exploration. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shaanxi%20Roujiamo%20House&center=34.3466,109.0365"
    },
    {
      "name": "Xi'an Noodle House",
      "coord": [
        34.3416,
        109.0357
      ],
      "desc": "Hand-pulled noodle perfection; broths simmered for hours; comfort",
      "longDesc": "Hand-pulled noodles with broths simmered hours; comfort elevated. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xi%27an%20Noodle%20House&center=34.3416,109.0357"
    },
    {
      "name": "Michelin Cantonese Dim Sum",
      "coord": [
        23.1291,
        113.2644
      ],
      "desc": "Cantonese 2* Michelin; dim sum royalty; morning ritual",
      "longDesc": "Michelin-starred Cantonese dim sum temple; morning ritual is treasure. Outstanding culinary excellence. World-class cuisine and impeccable service combine to create memorable dining experiences for food enthusiasts.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Michelin%20Cantonese%20Dim%20Sum&center=23.1291,113.2644"
    },
    {
      "name": "Guangzhou Roasted Meats Master",
      "coord": [
        23.1265,
        113.2626
      ],
      "desc": "Roast goose and duck; perfect glazed skin; Cantonese classics",
      "longDesc": "Master roaster; their glazed duck and goose hang in window daily. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guangzhou%20Roasted%20Meats%20Master&center=23.1265,113.2626"
    },
    {
      "name": "Guangzhou Seafood Bazaar",
      "coord": [
        23.1113,
        113.2515
      ],
      "desc": "Live tank selections; Cantonese cooking; market-fresh specials",
      "longDesc": "Bustling seafood bazaar where you pick from live tanks; authentically Guangzhou. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guangzhou%20Seafood%20Bazaar&center=23.1113,113.2515"
    },
    {
      "name": "Pearl River Night Dinner Cruise",
      "coord": [
        23.1265,
        113.2626
      ],
      "desc": "River cruise dinner; city lights views; Cantonese buffet",
      "longDesc": "Romantic dinner cruise with Cantonese buffet; Pearl River views frame meal. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pearl%20River%20Night%20Dinner%20Cruise&center=23.1265,113.2626"
    },
    {
      "name": "Guangzhou Congee King",
      "coord": [
        23.1291,
        113.2644
      ],
      "desc": "Rice congee perfection; savory toppings; comfort breakfast bowl",
      "longDesc": "Legendary congee house; porridge with century egg and meat is perfect. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guangzhou%20Congee%20King&center=23.1291,113.2644"
    },
    {
      "name": "Lijiang Old Town Hotpot",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Mountain hot pot; Yunnan wild herbs; communal warmth",
      "longDesc": "Mountain hot pot featuring Yunnan wild ingredients; communal dining immersion. Scenic hiking and adventure opportunities. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lijiang%20Old%20Town%20Hotpot&center=26.8738,100.2318"
    },
    {
      "name": "Yunnan Garden Kitchen",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Yunnan countryside cuisine; wild mushrooms; forest flavors",
      "longDesc": "Yunnan countryside cooking featuring wild mushrooms and mountain herbs. Scenic hiking and adventure opportunities. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yunnan%20Garden%20Kitchen&center=26.8738,100.2318"
    },
    {
      "name": "Dai Cuisine Riverside",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Dai ethnic cuisine; bamboo-steamed fish; coconut-lime brightness",
      "longDesc": "Authentic Dai cuisine with bamboo-steamed fish and tropical brightness. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dai%20Cuisine%20Riverside&center=26.8738,100.2318"
    },
    {
      "name": "Guilin Rice Noodles Temple",
      "coord": [
        25.2908,
        110.2911
      ],
      "desc": "Guilin rice noodles; cartilage broth; karst town staple",
      "longDesc": "Silky rice noodles in savory cartilage broth; Guilin's signature dish. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guilin%20Rice%20Noodles%20Temple&center=25.2908,110.2911"
    },
    {
      "name": "Yangshuo Waterfront Lounge",
      "coord": [
        24.7725,
        110.4876
      ],
      "desc": "River-view international fare; western fusion; traveler gathering",
      "longDesc": "Charming riverside spot blending international and local dishes. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yangshuo%20Waterfront%20Lounge&center=24.7725,110.4876"
    },
    {
      "name": "Fish and Bamboo Raft Dinner",
      "coord": [
        25.2908,
        110.2911
      ],
      "desc": "Bamboo raft dining; evening karst views; romantic atmosphere",
      "longDesc": "Dinner on historic bamboo rafts; karst peaks lit by lanterns. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Fish%20and%20Bamboo%20Raft%20Dinner&center=25.2908,110.2911"
    },
    {
      "name": "Hangzhou Old Hangzhou Tea House",
      "coord": [
        30.2268,
        120.09
      ],
      "desc": "Dragon Well tea; West Lake fish; seasonal elegance",
      "longDesc": "Delicate West Lake fish and Dragon Well tea ceremonies with refinement. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20Old%20Hangzhou%20Tea%20House&center=30.2268,120.09"
    },
    {
      "name": "Hangzhou Song Dynasty Night Banquet",
      "coord": [
        30.2268,
        120.09
      ],
      "desc": "Historical banquet spectacle; Song Dynasty recipes; theatrical",
      "longDesc": "Theatrical banquet recreating Song Dynasty feasts; 22-course spectacle. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20Song%20Dynasty%20Night%20Banquet&center=30.2268,120.09"
    },
    {
      "name": "Kunming Wild Mushroom Restaurant",
      "coord": [
        25.045,
        102.7108
      ],
      "desc": "Yunnan wild mushroom specialties; seasonal foraging; earthy",
      "longDesc": "Dedicated to Yunnan's famous wild mushrooms; seasonal treasures. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Kunming%20Wild%20Mushroom%20Restaurant&center=25.045,102.7108"
    },
    {
      "name": "Shangri-La Tibetan Butter Tea House",
      "coord": [
        27.829,
        99.7082
      ],
      "desc": "Tibetan butter tea; roasted barley; high-altitude traditions",
      "longDesc": "Authentic Tibetan butter tea and roasted barley in cozy setting. Exceptional destination for cultural and culinary exploration. Perfect crispy skin and tender meat showcase culinary mastery passed down through generations of dedication.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shangri-La%20Tibetan%20Butter%20Tea%20House&center=27.829,99.7082"
    }
  ],
  "experiences": [
    {
      "name": "Forbidden City",
      "coord": [
        39.9163,
        116.3972
      ],
      "desc": "Imperial palace; 980 buildings; 600 years of dynasties; iconic",
      "longDesc": "World's largest imperial palace with 980 buildings spanning 600 years of Chinese dynasties; unparalleled architectural and cultural masterpiece. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Forbidden%20City&center=39.9163,116.3972"
    },
    {
      "name": "Great Wall (Mutianyu Section)",
      "coord": [
        40.4553,
        116.5674
      ],
      "desc": "Scenic mountain wall; cable car; autumn foliage; family-friendly",
      "longDesc": "Most scenic and accessible Great Wall section with cable car access; offers breathtaking mountain views and beautifully restored watchtowers. Scenic hiking and adventure opportunities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Great%20Wall%20%28Mutianyu%20Section%29&center=40.4553,116.5674"
    },
    {
      "name": "Great Wall (Jinshanling Section)",
      "coord": [
        40.4256,
        117.2346
      ],
      "desc": "Ruined wall hiking; less crowded; dramatic restoration contrast",
      "longDesc": "Dramatic landscape where restored and ruined wall sections stand side-by-side creating striking contrast; paradise for serious hikers seeking adventure. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Great%20Wall%20%28Jinshanling%20Section%29&center=40.4256,117.2346"
    },
    {
      "name": "Summer Palace",
      "coord": [
        39.9984,
        116.2822
      ],
      "desc": "Imperial lake retreat; Kunming Lake; temples and pavilions",
      "longDesc": "Serene lakeside imperial retreat featuring beautiful gardens, historic temples, traditional boats, and peaceful atmosphere; perfect escape from Forbidden City crowds.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Summer%20Palace&center=39.9984,116.2822"
    },
    {
      "name": "Temple of Heaven",
      "coord": [
        39.8847,
        116.4081
      ],
      "desc": "Circular architecture; imperial ritual spaces; local tai chi",
      "longDesc": "Circular ceremonial temple complex where emperors once prayed for harvests; morning tai chi with locals creates a magical cultural experience.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Temple%20of%20Heaven&center=39.8847,116.4081"
    },
    {
      "name": "Beijing Opera at National Theatre",
      "coord": [
        39.9062,
        116.392
      ],
      "desc": "Classical Chinese theater; elaborate costumes; acrobatic",
      "longDesc": "Dazzling classical Chinese opera featuring elaborate costumes, acrobatics, martial arts, and intricate storytelling spanning centuries of theatrical tradition. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Opera%20at%20National%20Theatre&center=39.9062,116.392"
    },
    {
      "name": "Ming Tombs",
      "coord": [
        40.2566,
        116.2328
      ],
      "desc": "Sacred burial complex; 13 emperor mausoleums; contemplation",
      "longDesc": "Sacred burial grounds honoring 13 emperors; serene complex showcases Ming Dynasty ceremonial architecture with imperial beauty and spiritual reverence. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ming%20Tombs&center=40.2566,116.2328"
    },
    {
      "name": "Beijing Hutong Tour on Bicycle",
      "coord": [
        39.9313,
        116.4051
      ],
      "desc": "Historic alleyway neighborhoods; daily life immersion; courtyards",
      "longDesc": "Navigate ancient alleyways on bicycle; peek into family courtyards and experience authentic old Beijing rhythm and neighborhood life. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Hutong%20Tour%20on%20Bicycle&center=39.9313,116.4051"
    },
    {
      "name": "Lama Temple (Yonghegong)",
      "coord": [
        39.9432,
        116.4347
      ],
      "desc": "Tibetan Buddhist temple; incense clouds; meditation halls",
      "longDesc": "Active Tibetan Buddhist temple with incense-filled meditation halls; the magnificent 18-meter gilded Buddha statue is absolutely breathtaking. Spiritual and cultural immersion.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lama%20Temple%20%28Yonghegong%29&center=39.9432,116.4347"
    },
    {
      "name": "National Museum of China",
      "coord": [
        39.8963,
        116.4073
      ],
      "desc": "5,000 years of history; world's largest art museum; free",
      "longDesc": "World's largest museum housing 5,000 years of Chinese history from ancient bronze to contemporary art across multiple dynasties. Exceptional destination for cultural and culinary exploration.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=National%20Museum%20of%20China&center=39.8963,116.4073"
    },
    {
      "name": "798 Art District",
      "coord": [
        39.9854,
        116.4662
      ],
      "desc": "Contemporary art galleries; converted factory; cafes; murals",
      "longDesc": "Hip contemporary art district in converted military factory; features cutting-edge galleries, artist studios, and vibrant street art showcasing modern China.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=798%20Art%20District&center=39.9854,116.4662"
    },
    {
      "name": "Beijing Calligraphy Masterclass",
      "coord": [
        39.907,
        116.409
      ],
      "desc": "Learn brush technique; ink meditation; art form immersion",
      "longDesc": "Learn ancient brush techniques from master calligraphers. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Calligraphy%20Masterclass&center=39.907,116.409"
    },
    {
      "name": "The Bund (Waitan)",
      "coord": [
        31.2396,
        121.4874
      ],
      "desc": "Colonial riverfront boulevard; Art Deco architecture; sunset",
      "longDesc": "Historic colonial promenade with Art Deco buildings; romantic sunset. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=The%20Bund%20%28Waitan%29&center=31.2396,121.4874"
    },
    {
      "name": "Yu Garden (Yuyuan)",
      "coord": [
        31.2308,
        121.489
      ],
      "desc": "Ming Dynasty garden; rocky landscapes; intricate pavilions",
      "longDesc": "Masterwork of Ming Dynasty design; intricate pavilions and pools. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yu%20Garden%20%28Yuyuan%29&center=31.2308,121.489"
    },
    {
      "name": "Shanghai Museum",
      "coord": [
        31.2313,
        121.4747
      ],
      "desc": "Ancient bronzes to modern art; world-class Chinese collections",
      "longDesc": "World-class museum featuring bronzes, ceramics, and art spanning millennia. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Museum&center=31.2313,121.4747"
    },
    {
      "name": "Oriental Pearl TV Tower",
      "coord": [
        31.2397,
        121.5041
      ],
      "desc": "Futuristic tower; Sky Walk; 360-degree city views; 468m",
      "longDesc": "Iconic tower; SkyWalk and observation decks offer 360 views. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Oriental%20Pearl%20TV%20Tower&center=31.2397,121.5041"
    },
    {
      "name": "Jing'an Temple",
      "coord": [
        31.2281,
        121.4558
      ],
      "desc": "Active Buddhist temple; city-center sanctuary; serene",
      "longDesc": "Sacred Buddhist temple amid modern skyscrapers; peaceful refuge. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jing%27an%20Temple&center=31.2281,121.4558"
    },
    {
      "name": "Shanghai Acrobatics Show",
      "coord": [
        31.223,
        121.472
      ],
      "desc": "Death-defying stunts; human contortion; 60-minute spectacle",
      "longDesc": "Gravity-defying acrobatics; 60 minutes of pure spectacle. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Acrobatics%20Show&center=31.223,121.472"
    },
    {
      "name": "Zhujiajiao Water Town",
      "coord": [
        31.1649,
        121.0737
      ],
      "desc": "Ancient water town; Venice of East; stone bridges; riverside",
      "longDesc": "Picturesque water town with stone bridges and riverside teahouses. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Zhujiajiao%20Water%20Town&center=31.1649,121.0737"
    },
    {
      "name": "Longhua Temple & Pagoda",
      "coord": [
        31.176,
        121.4827
      ],
      "desc": "Ancient temple; 40m brick pagoda; historical grounds",
      "longDesc": "Serene temple complex with historic pagoda dating to 977 AD. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Longhua%20Temple%20%26%20Pagoda&center=31.176,121.4827"
    },
    {
      "name": "Shanghai Silk Museum",
      "coord": [
        31.1752,
        121.4897
      ],
      "desc": "Silk history museum; live cocoon displays; weaving demonstrations",
      "longDesc": "Museum of China's silk traditions; live cocoons and looms. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Silk%20Museum&center=31.1752,121.4897"
    },
    {
      "name": "French Concession Stroll",
      "coord": [
        31.2189,
        121.4489
      ],
      "desc": "Tree-lined streets; Art Deco villas; cafes; upscale shopping",
      "longDesc": "Colonial neighborhood with tree-lined streets and charming cafes. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=French%20Concession%20Stroll&center=31.2189,121.4489"
    },
    {
      "name": "Shanghai Old City Xiaolongbao Tour",
      "coord": [
        31.2308,
        121.489
      ],
      "desc": "Dumpling workshop; fold dumplings yourself; eat your creation",
      "longDesc": "Hands-on dumpling folding; learn and enjoy your freshly-steamed creation. Exceptional destination for cultural and culinary exploration. Handmade dumplings and traditional preparations showcase delicate craftsmanship and culinary precision daily.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Old%20City%20Xiaolongbao%20Tour&center=31.2308,121.489"
    },
    {
      "name": "Victoria Peak",
      "coord": [
        22.3128,
        114.1628
      ],
      "desc": "Sky-high views; Peak Tram ride; lookout terraces; sunset",
      "longDesc": "Iconic viewpoint with breathtaking harbour vistas and Peak Tram. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Victoria%20Peak&center=22.3128,114.1628"
    },
    {
      "name": "Star Ferry (Central ↔ Tsim Sha Tsui)",
      "coord": [
        22.2977,
        114.1728
      ],
      "desc": "Historic double-decker ferry; 12-minute harbor traverse; magic",
      "longDesc": "Legendary double-decker ferry; 12-minute ride offers harbour perfection. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Star%20Ferry%20%28Central%20%E2%86%94%20Tsim%20Sha%20Tsui%29&center=22.2977,114.1728"
    },
    {
      "name": "Big Buddha (Tian Tan Buddha)",
      "coord": [
        22.2495,
        113.9102
      ],
      "desc": "70-meter bronze Buddha; mountaintop temple; cable car; pilgrimage",
      "longDesc": "Monumental 70-meter Buddha; cable car and 268 steps to serenity. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Big%20Buddha%20%28Tian%20Tan%20Buddha%29&center=22.2495,113.9102"
    },
    {
      "name": "Symphony of Lights Harbour Show",
      "coord": [
        22.2981,
        114.1747
      ],
      "desc": "Synchronized laser & light show; 44 buildings; evening magic",
      "longDesc": "Nightly synchronized light show across 44 buildings; free waterfront views. Exceptional destination for cultural and culinary exploration. Evening magic, illuminated beauty, and theatrical performances create unforgettable sensory experiences under starlit skies.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Symphony%20of%20Lights%20Harbour%20Show&center=22.2981,114.1747"
    },
    {
      "name": "Traditional Chinese Junk Cruise",
      "coord": [
        22.2977,
        114.1728
      ],
      "desc": "Red-sailed junk boat; harbour sailing; sunset & dinner cruises",
      "longDesc": "Romantic traditional junk sail; sunset cruises with dinner. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Traditional%20Chinese%20Junk%20Cruise&center=22.2977,114.1728"
    },
    {
      "name": "Hong Kong Museum of History",
      "coord": [
        22.2969,
        114.1746
      ],
      "desc": "4,000 years of history; immersive timeline; costumed reenactments",
      "longDesc": "Comprehensive museum spanning 4,000 years with immersive exhibits. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Museum%20of%20History&center=22.2969,114.1746"
    },
    {
      "name": "Temple Street Night Market",
      "coord": [
        22.3071,
        114.1735
      ],
      "desc": "Bustling night bazaar; street food; vintage treasures; authentic",
      "longDesc": "Legendary night market with street food and quintessential culture. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Temple%20Street%20Night%20Market&center=22.3071,114.1735"
    },
    {
      "name": "Hong Kong Disneyland",
      "coord": [
        22.311,
        113.9426
      ],
      "desc": "Enchanting theme park; character meet-and-greets; parades",
      "longDesc": "Beloved theme park with classic attractions and character experiences. Exceptional destination for cultural and culinary exploration. Beautiful landscapes, recreational facilities, and serene spaces provide ideal family relaxation and outdoor exploration opportunities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Disneyland&center=22.311,113.9426"
    },
    {
      "name": "Ocean Park Hong Kong",
      "coord": [
        22.2457,
        114.1801
      ],
      "desc": "Thrilling amusement park; aquatic animals; roller coasters",
      "longDesc": "Action-packed park with water rides, animal encounters, and coasters. Exceptional destination for cultural and culinary exploration. Beautiful landscapes, recreational facilities, and serene spaces provide ideal family relaxation and outdoor exploration opportunities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ocean%20Park%20Hong%20Kong&center=22.2457,114.1801"
    },
    {
      "name": "Wong Tai Sin Temple",
      "coord": [
        22.336,
        114.1946
      ],
      "desc": "Ornate Buddhist-Taoist temple; fortune-telling; incense clouds",
      "longDesc": "Ornate sacred temple with fortune-telling and incense clouds. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Wong%20Tai%20Sin%20Temple&center=22.336,114.1946"
    },
    {
      "name": "Stanley Beach & Waterfront",
      "coord": [
        22.2152,
        114.2101
      ],
      "desc": "Seaside village; beachfront bars; sunset walk; local feel",
      "longDesc": "Charming seaside village with beach and waterfront bars. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Stanley%20Beach%20%26%20Waterfront&center=22.2152,114.2101"
    },
    {
      "name": "Lei Yue Mun Seafood Harbor",
      "coord": [
        22.3049,
        114.2241
      ],
      "desc": "Waterfront seafood market; harbor-facing restaurants; live tanks",
      "longDesc": "Historic seafood harbor where you select from live tanks and cook. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lei%20Yue%20Mun%20Seafood%20Harbor&center=22.3049,114.2241"
    },
    {
      "name": "Hong Kong Star Ferry Heritage Ride",
      "coord": [
        22.2977,
        114.1728
      ],
      "desc": "Double-decker ferry heritage; upper deck ride; photo location",
      "longDesc": "Ride iconic upper deck for photo-perfect harbour views. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Star%20Ferry%20Heritage%20Ride&center=22.2977,114.1728"
    },
    {
      "name": "Giant Panda Breeding Base",
      "coord": [
        30.7572,
        104.0662
      ],
      "desc": "100+ pandas; morning feeding sessions; research facility",
      "longDesc": "Sanctuary with 100+ pandas; morning feeding sessions with playful cubs. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Giant%20Panda%20Breeding%20Base&center=30.7572,104.0662"
    },
    {
      "name": "Wuhou Shrine & Museum",
      "coord": [
        30.5557,
        104.0613
      ],
      "desc": "Historic temple complex; Three Kingdoms history; gardens",
      "longDesc": "Sacred shrine honoring Three Kingdoms generals; serene gardens. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Wuhou%20Shrine%20%26%20Museum&center=30.5557,104.0613"
    },
    {
      "name": "Jinli Ancient Street",
      "coord": [
        30.5544,
        104.0689
      ],
      "desc": "Ming Dynasty street recreation; lanterns; street food; shops",
      "longDesc": "Charming Ming Dynasty street recreation with vendors and food. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jinli%20Ancient%20Street&center=30.5544,104.0689"
    },
    {
      "name": "Chengdu Kuanzhai Xiangzi",
      "coord": [
        30.5707,
        104.0682
      ],
      "desc": "Historic old quarter; tea culture; wooden architecture",
      "longDesc": "Beautifully restored historic quarter with wooden architecture. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Kuanzhai%20Xiangzi&center=30.5707,104.0682"
    },
    {
      "name": "Chengdu Tea House Culture",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Sit-down meditative tea ceremonies; bamboo chairs; people-watching",
      "longDesc": "Meditative tea house culture where locals gather for hours. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Tea%20House%20Culture&center=30.5728,104.0662"
    },
    {
      "name": "Anren Ancient Town",
      "coord": [
        30.3168,
        103.8742
      ],
      "desc": "Qing Dynasty town; water mills; museums; wooden bridge villages",
      "longDesc": "Beautifully preserved Qing Dynasty town with mills and villages. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Anren%20Ancient%20Town&center=30.3168,103.8742"
    },
    {
      "name": "Mount Emei Buddhist Temple",
      "coord": [
        29.556,
        103.3414
      ],
      "desc": "Sacred Buddhist peak; cable car ascent; temple complex",
      "longDesc": "Sacred mountain with ancient temples; cable car to sunrise. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mount%20Emei%20Buddhist%20Temple&center=29.556,103.3414"
    },
    {
      "name": "Leshan Giant Buddha",
      "coord": [
        29.5513,
        103.7723
      ],
      "desc": "71-meter rock-carved Buddha; UNESCO World Heritage; 1,300-year",
      "longDesc": "Monumental 71-meter Buddha carved over 1,300 years ago. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Leshan%20Giant%20Buddha&center=29.5513,103.7723"
    },
    {
      "name": "Sichuan Opera Face-Changing Performance",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Ancient theatrical art form; rapid mask transformations",
      "longDesc": "Mind-bending opera with lightning-fast mask transformations. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sichuan%20Opera%20Face-Changing%20Performance&center=30.5728,104.0662"
    },
    {
      "name": "Terracotta Army",
      "coord": [
        34.3826,
        109.2774
      ],
      "desc": "8,000 warrior statues; underground army; UNESCO; 2,000-year",
      "longDesc": "Breathtaking army of 8,000 warriors guarding emperor for 2,000 years. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Terracotta%20Army&center=34.3826,109.2774"
    },
    {
      "name": "Xi'an City Wall",
      "coord": [
        34.3415,
        109.0355
      ],
      "desc": "14-km Ming Dynasty wall; bike or walk; sunset best; 360-degree",
      "longDesc": "Remarkably preserved 14-km wall; perimeter offers 360-degree views. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xi%27an%20City%20Wall&center=34.3415,109.0355"
    },
    {
      "name": "Big Wild Goose Pagoda",
      "coord": [
        34.2308,
        109.1173
      ],
      "desc": "7-story Tang Dynasty pagoda; 700-year-old; mountain views",
      "longDesc": "Graceful 7-story pagoda dominating skyline; temple gardens. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Big%20Wild%20Goose%20Pagoda&center=34.2308,109.1173"
    },
    {
      "name": "Shaanxi History Museum",
      "coord": [
        34.262,
        109.1145
      ],
      "desc": "3,000 years of artifacts; ancient bronze vessels; dynasty timeline",
      "longDesc": "Museum housing 3,000 years of treasures; bronzes trace dynasty evolution. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shaanxi%20History%20Museum&center=34.262,109.1145"
    },
    {
      "name": "Muslim Quarter Walking Tour",
      "coord": [
        34.3466,
        109.0365
      ],
      "desc": "Ancient Silk Road market; street food stalls; cultural immersion",
      "longDesc": "Historic Silk Road quarter with centuries of Muslim culture. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Muslim%20Quarter%20Walking%20Tour&center=34.3466,109.0365"
    },
    {
      "name": "Banpo Neolithic Village Museum",
      "coord": [
        34.3876,
        109.1201
      ],
      "desc": "8,000-year-old archaeological site; reconstructed dwellings",
      "longDesc": "8,000-year-old site showcasing earliest Chinese villages. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Banpo%20Neolithic%20Village%20Museum&center=34.3876,109.1201"
    },
    {
      "name": "Dayan Pagoda Night Show",
      "coord": [
        34.2308,
        109.1173
      ],
      "desc": "Projection mapping; musical performance; illuminated pagoda",
      "longDesc": "Stunning nighttime projection and music show on illuminated pagoda. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dayan%20Pagoda%20Night%20Show&center=34.2308,109.1173"
    },
    {
      "name": "Beilin Museum & Stone Forest",
      "coord": [
        34.3415,
        109.0355
      ],
      "desc": "2,000+ stone inscriptions; calligraphy forest; Tang Dynasty tablets",
      "longDesc": "Museum of stone sculpture and calligraphy spanning 2,000 years. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beilin%20Museum%20%26%20Stone%20Forest&center=34.3415,109.0355"
    },
    {
      "name": "Xi'an Lantern Festival",
      "coord": [
        34.3415,
        109.0355
      ],
      "desc": "Lunar New Year lanterns; ceremonial processions; glowing",
      "longDesc": "Lunar New Year celebration with thousands of lanterns and processions. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xi%27an%20Lantern%20Festival&center=34.3415,109.0355"
    },
    {
      "name": "Li River Bamboo Raft Cruise",
      "coord": [
        25.2908,
        110.2911
      ],
      "desc": "Bamboo rafting; karst peaks; water buffalo; sunrise/sunset",
      "longDesc": "Legendary bamboo journey through surreal karst landscape. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Li%20River%20Bamboo%20Raft%20Cruise&center=25.2908,110.2911"
    },
    {
      "name": "Karst Mountain Hiking",
      "coord": [
        24.7725,
        110.4876
      ],
      "desc": "Surreal limestone peaks; rural villages; riverside trails",
      "longDesc": "Hiking through dreamlike karst with villages and peaks. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Karst%20Mountain%20Hiking&center=24.7725,110.4876"
    },
    {
      "name": "Guilin Reed Flute Cave",
      "coord": [
        25.3403,
        110.2839
      ],
      "desc": "Stalactite cavern; illuminated formations; 180-meter walkthrough",
      "longDesc": "Magical limestone cavern with rainbow-lit stalactites. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guilin%20Reed%20Flute%20Cave&center=25.3403,110.2839"
    },
    {
      "name": "Dragon's Backbone Rice Terraces",
      "coord": [
        25.7445,
        110.3447
      ],
      "desc": "Sculptural rice paddies; ethnic minority villages; mountain hikes",
      "longDesc": "Breathtaking rice terraces carved into mountainside with villages. Scenic hiking and adventure opportunities. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dragon%27s%20Backbone%20Rice%20Terraces&center=25.7445,110.3447"
    },
    {
      "name": "Cormorant Fishing (Night Performance)",
      "coord": [
        25.2908,
        110.2911
      ],
      "desc": "Ancient night fishing tradition; cormorant birds; lantern-lit",
      "longDesc": "Ancient cormorant fishing tradition performed at night on rafts. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cormorant%20Fishing%20%28Night%20Performance%29&center=25.2908,110.2911"
    },
    {
      "name": "Lijiang Old Town",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Ancient Naxi settlement; wooden architecture; waterways",
      "longDesc": "UNESCO-protected ancient Naxi town with Silk Road heritage. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lijiang%20Old%20Town&center=26.8738,100.2318"
    },
    {
      "name": "Jade Dragon Snow Mountain",
      "coord": [
        27.0434,
        100.231
      ],
      "desc": "Mountain peaks; cable car ascent; alpine scenery; 5,596m",
      "longDesc": "Sacred mountain with cable car to alpine meadows and panoramas. Scenic hiking and adventure opportunities. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jade%20Dragon%20Snow%20Mountain&center=27.0434,100.231"
    },
    {
      "name": "Shangri-La Tibetan Monastery",
      "coord": [
        27.829,
        99.7082
      ],
      "desc": "Hilltop monastery; prayer wheels; Tibetan culture; sunrise",
      "longDesc": "Golden-roofed monastery on hilltop; sunrise prayers create spirituality. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shangri-La%20Tibetan%20Monastery&center=27.829,99.7082"
    },
    {
      "name": "Yunnan Ethnic Minority Museum",
      "coord": [
        25.045,
        102.7108
      ],
      "desc": "56 ethnic groups; traditional dress; village recreations",
      "longDesc": "Museum celebrating 56 ethnic minorities with villages and dress. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Yunnan%20Ethnic%20Minority%20Museum&center=25.045,102.7108"
    },
    {
      "name": "Hangzhou West Lake",
      "coord": [
        30.2741,
        120.1551
      ],
      "desc": "Poetic lake; causeways; pagodas; Dragon Well tea gardens",
      "longDesc": "Legendary lake immortalized in poetry; causeways and temples. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20West%20Lake&center=30.2741,120.1551"
    },
    {
      "name": "Hangzhou Longjing Tea Ceremony",
      "coord": [
        30.2268,
        120.09
      ],
      "desc": "Dragon Well tea tasting; tea master teaching; leaf unfolding",
      "longDesc": "Formal tea ceremony featuring Dragon Well; centuries of tradition. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20Longjing%20Tea%20Ceremony&center=30.2268,120.09"
    }
  ],
  "kidFriendly": [
    {
      "name": "Beijing Aquarium",
      "coord": [
        39.881,
        116.4178
      ],
      "desc": "15,000 aquatic animals; sharks; jellies; touch pools",
      "longDesc": "Modern aquarium with 15,000 animals; touch pools and shark tank. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Aquarium&center=39.881,116.4178"
    },
    {
      "name": "Beijing Zoo",
      "coord": [
        39.9689,
        116.3486
      ],
      "desc": "Giant pandas, tigers, penguins; 7,000+ animals; historic",
      "longDesc": "Historic zoo with 7,000+ animals including giant pandas and tigers. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Zoo&center=39.9689,116.3486"
    },
    {
      "name": "Chaoyang Park",
      "coord": [
        39.9659,
        116.4725
      ],
      "desc": "Large park; boating lake; playgrounds; picnic-friendly grass",
      "longDesc": "Sprawling park with paddle boats, playgrounds, and picnic areas. Exceptional destination for cultural and culinary exploration. Beautiful landscapes, recreational facilities, and serene spaces provide ideal family relaxation and outdoor exploration opportunities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chaoyang%20Park&center=39.9659,116.4725"
    },
    {
      "name": "Shanghai Wild Animal Park",
      "coord": [
        31.0963,
        121.2238
      ],
      "desc": "1,200+ animals; safari drive-through; daily shows; full-day",
      "longDesc": "Safari-style drive-through with 1,200+ animals and daily shows. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Wild%20Animal%20Park&center=31.0963,121.2238"
    },
    {
      "name": "Shanghai Children's Museum",
      "coord": [
        31.2288,
        121.4591
      ],
      "desc": "Interactive hands-on exhibits; science; art; design spaces",
      "longDesc": "Hands-on museum with interactive science, art, and design. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Children%27s%20Museum&center=31.2288,121.4591"
    },
    {
      "name": "Hong Kong Disneyland",
      "coord": [
        22.311,
        113.9426
      ],
      "desc": "Theme park; character meet-greets; parades; magical all-ages",
      "longDesc": "Family theme park with classic attractions and character experiences. Exceptional destination for cultural and culinary exploration. Spacious accommodations, excellent facilities, and kid-friendly services make this ideal for traveling families and children.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Disneyland&center=22.311,113.9426"
    },
    {
      "name": "Ocean Park Hong Kong",
      "coord": [
        22.2457,
        114.1801
      ],
      "desc": "Amusement park; animal shows; roller coasters; water rides",
      "longDesc": "Thrilling park with water rides, animal encounters, and coasters. Exceptional destination for cultural and culinary exploration. Beautiful landscapes, recreational facilities, and serene spaces provide ideal family relaxation and outdoor exploration opportunities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ocean%20Park%20Hong%20Kong&center=22.2457,114.1801"
    },
    {
      "name": "Hong Kong Science Museum",
      "coord": [
        22.2969,
        114.1746
      ],
      "desc": "400+ interactive exhibits; OMNIMAX theater; physics demos",
      "longDesc": "Interactive museum with 400+ exhibits and OMNIMAX theater. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Science%20Museum&center=22.2969,114.1746"
    },
    {
      "name": "Chengdu Panda Base Morning Visit",
      "coord": [
        30.7572,
        104.0662
      ],
      "desc": "100+ pandas; feeding sessions; cute encounters; photographers",
      "longDesc": "Morning panda encounters during feeding; playful cubs entertain. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Panda%20Base%20Morning%20Visit&center=30.7572,104.0662"
    },
    {
      "name": "Chengdu Children's Palace",
      "coord": [
        30.5882,
        104.0629
      ],
      "desc": "Art & science classes; traditional crafts; cultural spaces",
      "longDesc": "Activity center with art classes, science experiments, crafts. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Children%27s%20Palace&center=30.5882,104.0629"
    },
    {
      "name": "Chengdu Flower Expo Park",
      "coord": [
        30.4502,
        104.1789
      ],
      "desc": "Seasonal flower gardens; water parks; walking trails; family",
      "longDesc": "Beautiful seasonal gardens with water play and trails. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Flower%20Expo%20Park&center=30.4502,104.1789"
    },
    {
      "name": "Xi'an Children's Museum",
      "coord": [
        34.34,
        109.0456
      ],
      "desc": "Hands-on history; ancient civilization exhibits; learning zones",
      "longDesc": "Interactive museum bringing ancient history to life. Exceptional destination for cultural and culinary exploration. Comprehensive collections and interactive exhibits showcase history, culture, and artistic traditions spanning centuries of heritage.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xi%27an%20Children%27s%20Museum&center=34.34,109.0456"
    },
    {
      "name": "Hong Kong Peak Tram Experience",
      "coord": [
        22.3128,
        114.1628
      ],
      "desc": "Scenic funicular ride; thrilling ascent; lookout towers; photos",
      "longDesc": "Iconic funicular railway with stunning views; thrilling for kids. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Peak%20Tram%20Experience&center=22.3128,114.1628"
    },
    {
      "name": "Guilin Reed Flute Cave",
      "coord": [
        25.3403,
        110.2839
      ],
      "desc": "Magical cavern walk-through; colorful lit formations",
      "longDesc": "Rainbow-lit cavern with easy walking paths; magical for kids. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guilin%20Reed%20Flute%20Cave&center=25.3403,110.2839"
    },
    {
      "name": "Shanghai Longhua Temple Fair",
      "coord": [
        31.176,
        121.4827
      ],
      "desc": "Weekend market; street food; lanterns; folk performances",
      "longDesc": "Festive weekend market with food, lanterns, and performances. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Longhua%20Temple%20Fair&center=31.176,121.4827"
    },
    {
      "name": "Hangzhou Children's Park",
      "coord": [
        30.255,
        120.1481
      ],
      "desc": "Amusement rides; lake play; green spaces; family attractions",
      "longDesc": "Family-friendly park with rides and lakeside play areas. Exceptional destination for cultural and culinary exploration. Spacious accommodations, excellent facilities, and kid-friendly services make this ideal for traveling families and children.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20Children%27s%20Park&center=30.255,120.1481"
    },
    {
      "name": "Hong Kong Goldfish Market",
      "coord": [
        22.3007,
        114.179
      ],
      "desc": "Colorful market stalls; exotic fish; live creatures; tactile",
      "longDesc": "Fascinating market with hundreds of colorful fish species. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Goldfish%20Market&center=22.3007,114.179"
    },
    {
      "name": "Sichuan Opera Puppet Show",
      "coord": [
        30.5728,
        104.0662
      ],
      "desc": "Traditional puppet theater; colorful storytelling; cultural art",
      "longDesc": "Traditional puppet theater with colorful characters and stories. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sichuan%20Opera%20Puppet%20Show&center=30.5728,104.0662"
    },
    {
      "name": "Shanghai Yu Garden Lantern Festival",
      "coord": [
        31.2308,
        121.489
      ],
      "desc": "Seasonal lantern displays; glowing art installations; magic",
      "longDesc": "Seasonal lantern festival transforming gardens into wonderland. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Yu%20Garden%20Lantern%20Festival&center=31.2308,121.489"
    },
    {
      "name": "Lijiang Impression Shows",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Live cultural performance; ethnic dances; Yunnan traditions",
      "longDesc": "Spectacular live show with Yunnan ethnic dances; stunning. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lijiang%20Impression%20Shows&center=26.8738,100.2318"
    }
  ],
  "markets": [
    {
      "name": "Beijing Panjiayuan Antique Market",
      "coord": [
        39.875,
        116.4538
      ],
      "desc": "Massive weekend antique bazaar; 3,000+ vendors; jade, scrolls",
      "longDesc": "Sprawling weekend market with 3,000+ vendors selling treasures. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Panjiayuan%20Antique%20Market&center=39.875,116.4538"
    },
    {
      "name": "Beijing Caishikou Fabric Market",
      "coord": [
        39.8945,
        116.3985
      ],
      "desc": "Silk & fabric paradise; tailor services; wholesale prices",
      "longDesc": "Historic fabric market famous for silk and custom tailoring. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Caishikou%20Fabric%20Market&center=39.8945,116.3985"
    },
    {
      "name": "Beijing Hongqiao Pearl Market",
      "coord": [
        39.8978,
        116.4146
      ],
      "desc": "Freshwater pearls; jewelry; wholesale prices; 4-floor market",
      "longDesc": "Famous pearl market with 4 floors; bargaining is customary. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Beijing%20Hongqiao%20Pearl%20Market&center=39.8978,116.4146"
    },
    {
      "name": "Shanghai Yuyuan Garden Bazaar",
      "coord": [
        31.2308,
        121.489
      ],
      "desc": "Lantern-lit shopping arcade; jade, silk, crafts; tourist-friendly",
      "longDesc": "Charming arcade with silk shops and jade vendors. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Yuyuan%20Garden%20Bazaar&center=31.2308,121.489"
    },
    {
      "name": "Shanghai Jing'an Wholesale Market",
      "coord": [
        31.2248,
        121.4609
      ],
      "desc": "Silks and fabrics; wholesale prices; tailoring services",
      "longDesc": "Historic wholesale fabric market; tailors available for suits. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Jing%27an%20Wholesale%20Market&center=31.2248,121.4609"
    },
    {
      "name": "Shanghai Dongjiadu Fabric Market",
      "coord": [
        31.2264,
        121.5024
      ],
      "desc": "Wholesale silks and fabrics; best prices; multiple floors",
      "longDesc": "Major wholesale market with multiple floors of silks. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Dongjiadu%20Fabric%20Market&center=31.2264,121.5024"
    },
    {
      "name": "Shanghai Jiuguang Clothing & Accessories Market",
      "coord": [
        31.2305,
        121.4839
      ],
      "desc": "Wholesale fashion; designer knock-offs; fashion accessories",
      "longDesc": "Wholesale fashion market with affordable clothing. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Jiuguang%20Clothing%20%26%20Accessories%20Market&center=31.2305,121.4839"
    },
    {
      "name": "Hong Kong Ladies' Market",
      "coord": [
        22.318,
        114.179
      ],
      "desc": "Daytime fashion bazaar; clothing, bags, accessories; bustling",
      "longDesc": "Bustling daytime market with hundreds of stalls. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Ladies%27%20Market&center=22.318,114.179"
    },
    {
      "name": "Hong Kong Temple Street Market",
      "coord": [
        22.3071,
        114.1735
      ],
      "desc": "Night bazaar; street food stalls; vintage treasures; authentic",
      "longDesc": "Legendary night market with street food and culture. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Temple%20Street%20Market&center=22.3071,114.1735"
    },
    {
      "name": "Hong Kong Lei Yue Mun Seafood Market",
      "coord": [
        22.3049,
        114.2241
      ],
      "desc": "Working seafood harbor; live tanks; waterfront restaurants",
      "longDesc": "Historic seafood market where you select from live tanks. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hong%20Kong%20Lei%20Yue%20Mun%20Seafood%20Market&center=22.3049,114.2241"
    },
    {
      "name": "Chengdu Kuanzhai Xiangzi Craft Market",
      "coord": [
        30.5707,
        104.0682
      ],
      "desc": "Teakwood furniture; traditional crafts; artisan shops",
      "longDesc": "Historic quarter with artisan shops and heritage architecture. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Kuanzhai%20Xiangzi%20Craft%20Market&center=30.5707,104.0682"
    },
    {
      "name": "Chengdu Jinli Ancient Street Food Market",
      "coord": [
        30.5544,
        104.0689
      ],
      "desc": "Street food bazaar; dumplings, noodles, snacks; evening gathering",
      "longDesc": "Bustling food market with stalls selling street food. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chengdu%20Jinli%20Ancient%20Street%20Food%20Market&center=30.5544,104.0689"
    },
    {
      "name": "Xi'an Muslim Quarter Market",
      "coord": [
        34.3466,
        109.0365
      ],
      "desc": "Ancient Silk Road bazaar; spices; street food; cultural",
      "longDesc": "Historic Silk Road market with spice stalls and traditions. Traditional shopping and cultural experience. Numbing peppers and complex flavors create authentic Sichuan experiences that tantalize the senses profoundly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Xi%27an%20Muslim%20Quarter%20Market&center=34.3466,109.0365"
    },
    {
      "name": "Guilin Antique & Curio Market",
      "coord": [
        25.2908,
        110.2911
      ],
      "desc": "Stone carvings; jade; scrolls; local artisan crafts",
      "longDesc": "Market featuring local stone and jade carvings. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guilin%20Antique%20%26%20Curio%20Market&center=25.2908,110.2911"
    },
    {
      "name": "Lijiang Dayan Old Town Market",
      "coord": [
        26.8738,
        100.2318
      ],
      "desc": "Minority crafts; textiles; ethnic jewelry; local goods",
      "longDesc": "Traditional marketplace with Naxi textiles and jewelry. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lijiang%20Dayan%20Old%20Town%20Market&center=26.8738,100.2318"
    },
    {
      "name": "Hangzhou West Lake Silk Market",
      "coord": [
        30.2741,
        120.1551
      ],
      "desc": "Fine silks; brocades; traditional fabrics; artisan weaving",
      "longDesc": "Legendary silk market with fine brocades and weaving. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20West%20Lake%20Silk%20Market&center=30.2741,120.1551"
    },
    {
      "name": "Hangzhou Qinghefang Ancient Street",
      "coord": [
        30.2564,
        120.1616
      ],
      "desc": "Traditional herb medicine shops; porcelain; silk; antiques",
      "longDesc": "Historic street with traditional medicine shops and traders. Exceptional destination for cultural and culinary exploration. Distinctive character, quality offerings, and cultural significance make this a must-visit destination for travelers seeking authenticity.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hangzhou%20Qinghefang%20Ancient%20Street&center=30.2564,120.1616"
    },
    {
      "name": "Kunming Flower & Bird Market",
      "coord": [
        25.0367,
        102.7125
      ],
      "desc": "Live birds, fish, flowers; plant nurseries; tropical abundance",
      "longDesc": "Colorful market with exotic birds, fish, and tropical flowers. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Kunming%20Flower%20%26%20Bird%20Market&center=25.0367,102.7125"
    },
    {
      "name": "Guangzhou Antique & Culture Market",
      "coord": [
        23.1291,
        113.2644
      ],
      "desc": "Ceramics, porcelain, scrolls; art pieces; cultural artifacts",
      "longDesc": "Weekend antique market with ceramics and cultural pieces. Traditional shopping and cultural experience. Bustling atmosphere, authentic goods, and local culture create vibrant shopping and cultural immersion experiences for visitors.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Guangzhou%20Antique%20%26%20Culture%20Market&center=23.1291,113.2644"
    },
    {
      "name": "Shanghai Longhua Temple Market",
      "coord": [
        31.176,
        121.4827
      ],
      "desc": "Weekly temple fair; fresh goods; traditional crafts; folk",
      "longDesc": "Historic temple fair market with fresh goods and crafts. Spiritual and cultural immersion. Sacred spiritual atmosphere, incense, and meditation spaces offer peaceful cultural immersion and contemplative experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Shanghai%20Longhua%20Temple%20Market&center=31.176,121.4827"
    }
  ],
  "cityCenters": {
    "Beijing": [
      39.9042,
      116.4074,
      0.15
    ],
    "Shanghai": [
      31.2304,
      121.4737,
      0.12
    ],
    "Hong Kong": [
      22.2783,
      114.1747,
      0.1
    ],
    "Chengdu": [
      30.5728,
      104.0662,
      0.1
    ],
    "Xi'an": [
      34.3416,
      109.0357,
      0.1
    ],
    "Guangzhou": [
      23.1291,
      113.2644,
      0.1
    ],
    "Hangzhou": [
      30.2741,
      120.1551,
      0.1
    ],
    "Guilin": [
      25.2908,
      110.2911,
      0.08
    ],
    "Lijiang": [
      26.8738,
      100.2318,
      0.08
    ],
    "Yunnan": [
      25.045,
      102.7108,
      0.2
    ],
    "Yangshuo": [
      24.7725,
      110.4876,
      0.08
    ],
    "Longsheng": [
      25.7445,
      110.3447,
      0.08
    ],
    "Shangri-La": [
      27.829,
      99.7082,
      0.1
    ]
  },
  "itineraryData": {
    "a": {
      "name": "Greatest Hits (7 days)",
      "color": "#2563EB",
      "days": [
        {
          "day": 1,
          "title": "Arrive Beijing; Forbidden City",
          "items": [
            {
              "type": "hotel",
              "name": "The Peninsula Beijing",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "lunch",
              "name": "Duyichu",
              "coord": [
                39.9132,
                116.4015
              ]
            },
            {
              "type": "sightseeing",
              "name": "Forbidden City",
              "coord": [
                39.9163,
                116.3972
              ]
            },
            {
              "type": "dinner",
              "name": "Jing",
              "coord": [
                39.907,
                116.409
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Great Wall & Ming Tombs",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Great Wall (Mutianyu Section)",
              "coord": [
                40.4553,
                116.5674
              ]
            },
            {
              "type": "lunch",
              "name": "Quanjude",
              "coord": [
                39.9014,
                116.3945
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ming Tombs",
              "coord": [
                40.2566,
                116.2328
              ]
            },
            {
              "type": "dinner",
              "name": "Ai Ti Liao",
              "coord": [
                39.8989,
                116.4007
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Summer Palace & Temple of Heaven",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Summer Palace",
              "coord": [
                39.9984,
                116.2822
              ]
            },
            {
              "type": "lunch",
              "name": "Capital M",
              "coord": [
                39.9065,
                116.4089
              ]
            },
            {
              "type": "sightseeing",
              "name": "Temple of Heaven",
              "coord": [
                39.8847,
                116.4081
              ]
            },
            {
              "type": "dinner",
              "name": "Zhu Wei Xuan",
              "coord": [
                39.9067,
                116.3976
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Fly to Xi'an; Terracotta Army",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Xi'an",
              "coord": [
                34.3415,
                109.0355
              ]
            },
            {
              "type": "hotel",
              "name": "Shangri-La Xi'an",
              "coord": [
                34.3416,
                109.0357
              ]
            },
            {
              "type": "sightseeing",
              "name": "Terracotta Army",
              "coord": [
                34.3826,
                109.2774
              ]
            },
            {
              "type": "lunch",
              "name": "Da Qin Xiaochi",
              "coord": [
                34.3416,
                109.0357
              ]
            },
            {
              "type": "dinner",
              "name": "Song Dynasty Banquet",
              "coord": [
                34.3401,
                109.0456
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Xi'an City Wall & Muslim Quarter",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                34.3416,
                109.0357
              ]
            },
            {
              "type": "sightseeing",
              "name": "Xi'an City Wall",
              "coord": [
                34.3415,
                109.0355
              ]
            },
            {
              "type": "lunch",
              "name": "La Mian Workshop",
              "coord": [
                34.3401,
                109.0456
              ]
            },
            {
              "type": "sightseeing",
              "name": "Muslim Quarter Walking Tour",
              "coord": [
                34.3466,
                109.0365
              ]
            },
            {
              "type": "dinner",
              "name": "Shaanxi Roujiamo House",
              "coord": [
                34.3466,
                109.0365
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Fly to Shanghai; The Bund",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                34.3416,
                109.0357
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Shanghai",
              "coord": [
                31.2304,
                121.4737
              ]
            },
            {
              "type": "hotel",
              "name": "Pudong Shangri-La",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "The Bund (Waitan)",
              "coord": [
                31.2396,
                121.4874
              ]
            },
            {
              "type": "lunch",
              "name": "Noble House Noodles",
              "coord": [
                31.2287,
                121.4892
              ]
            },
            {
              "type": "dinner",
              "name": "Yu Yue Heen",
              "coord": [
                31.2363,
                121.5157
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Shanghai Museum & Yu Garden; Depart",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Museum",
              "coord": [
                31.2313,
                121.4747
              ]
            },
            {
              "type": "lunch",
              "name": "Jade Mansion",
              "coord": [
                31.24,
                121.4845
              ]
            },
            {
              "type": "sightseeing",
              "name": "Yu Garden (Yuyuan)",
              "coord": [
                31.2308,
                121.489
              ]
            },
            {
              "type": "optional",
              "name": "Afternoon flight home",
              "coord": [
                31.2304,
                121.4737
              ]
            }
          ]
        }
      ]
    },
    "b": {
      "name": "Hidden Gems (7 days)",
      "color": "#059669",
      "days": [
        {
          "day": 1,
          "title": "Arrive Chengdu; Pandas & Tea",
          "items": [
            {
              "type": "hotel",
              "name": "Shangri-La Chengdu",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Giant Panda Breeding Base",
              "coord": [
                30.7572,
                104.0662
              ]
            },
            {
              "type": "lunch",
              "name": "Yu's Family Kitchen",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Chengdu Tea House Culture",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "dinner",
              "name": "Chen Mapo Tofu",
              "coord": [
                30.5668,
                104.0598
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Leshan Buddha & Mount Emei",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Leshan Giant Buddha",
              "coord": [
                29.5513,
                103.7723
              ]
            },
            {
              "type": "lunch",
              "name": "Tian Fu Old Kitchen",
              "coord": [
                30.5668,
                104.0598
              ]
            },
            {
              "type": "sightseeing",
              "name": "Mount Emei Buddhist Temple",
              "coord": [
                29.556,
                103.3414
              ]
            },
            {
              "type": "dinner",
              "name": "Sichuan Cuisine Fine Dining",
              "coord": [
                30.5728,
                104.0662
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Chengdu Neighborhoods & Opera",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Jinli Ancient Street",
              "coord": [
                30.5544,
                104.0689
              ]
            },
            {
              "type": "lunch",
              "name": "Chengdu Hot Pot Paradise",
              "coord": [
                30.5682,
                104.0583
              ]
            },
            {
              "type": "sightseeing",
              "name": "Chengdu Kuanzhai Xiangzi",
              "coord": [
                30.5707,
                104.0682
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sichuan Opera Face-Changing Performance",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "dinner",
              "name": "Xiang Zhu Ji Dan Zi",
              "coord": [
                30.5642,
                104.0501
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Fly to Yunnan; Lijiang Old Town",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Lijiang",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "hotel",
              "name": "Banyan Tree Lijiang",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lijiang Old Town",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "lunch",
              "name": "Yunnan Garden Kitchen",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "dinner",
              "name": "Dai Cuisine Riverside",
              "coord": [
                26.8738,
                100.2318
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Jade Dragon Snow Mountain",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "sightseeing",
              "name": "Jade Dragon Snow Mountain",
              "coord": [
                27.0434,
                100.231
              ]
            },
            {
              "type": "lunch",
              "name": "Lijiang Old Town Hotpot",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lijiang Impression Shows",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "dinner",
              "name": "Yunnan Garden Kitchen",
              "coord": [
                26.8738,
                100.2318
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Fly to Guilin; Li River Cruise",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                26.8738,
                100.2318
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Guilin",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "hotel",
              "name": "The Leela Guilin",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "sightseeing",
              "name": "Li River Bamboo Raft Cruise",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "lunch",
              "name": "Guilin Rice Noodles Temple",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "dinner",
              "name": "Fish and Bamboo Raft Dinner",
              "coord": [
                25.2908,
                110.2911
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Karst Hiking & Yangshuo; Depart",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "sightseeing",
              "name": "Karst Mountain Hiking",
              "coord": [
                24.7725,
                110.4876
              ]
            },
            {
              "type": "lunch",
              "name": "Yangshuo Waterfront Lounge",
              "coord": [
                24.7725,
                110.4876
              ]
            },
            {
              "type": "optional",
              "name": "Afternoon flight home",
              "coord": [
                25.2908,
                110.2911
              ]
            }
          ]
        }
      ]
    },
    "c": {
      "name": "Family Comfort (10 days)",
      "color": "#D97706",
      "days": [
        {
          "day": 1,
          "title": "Arrive Beijing; Forbidden City",
          "items": [
            {
              "type": "hotel",
              "name": "Island Shangri-La Hong Kong",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Forbidden City",
              "coord": [
                39.9163,
                116.3972
              ]
            },
            {
              "type": "lunch",
              "name": "Duyichu",
              "coord": [
                39.9132,
                116.4015
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lama Temple (Yonghegong)",
              "coord": [
                39.9432,
                116.4347
              ]
            },
            {
              "type": "dinner",
              "name": "Capital M",
              "coord": [
                39.9065,
                116.4089
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Great Wall family hike",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Great Wall (Mutianyu Section)",
              "coord": [
                40.4553,
                116.5674
              ]
            },
            {
              "type": "lunch",
              "name": "Wall-side picnic",
              "coord": [
                40.4553,
                116.5674
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Summer Palace",
              "coord": [
                39.9984,
                116.2822
              ]
            },
            {
              "type": "dinner",
              "name": "Quanjude",
              "coord": [
                39.9014,
                116.3945
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Beijing Zoo & Hutong",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Beijing Zoo",
              "coord": [
                39.9689,
                116.3486
              ]
            },
            {
              "type": "lunch",
              "name": "Huang Cheng Lao Ma",
              "coord": [
                39.9043,
                116.3992
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Beijing Hutong Tour on Bicycle",
              "coord": [
                39.9313,
                116.4051
              ]
            },
            {
              "type": "dinner",
              "name": "Lao She Teahouse",
              "coord": [
                39.9032,
                116.4065
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Fly to Shanghai; Bund & Museum",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Shanghai",
              "coord": [
                31.2304,
                121.4737
              ]
            },
            {
              "type": "hotel",
              "name": "Pudong Shangri-La",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "The Bund (Waitan)",
              "coord": [
                31.2396,
                121.4874
              ]
            },
            {
              "type": "lunch",
              "name": "Shanghai Laozha",
              "coord": [
                31.2311,
                121.4884
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Museum",
              "coord": [
                31.2313,
                121.4747
              ]
            },
            {
              "type": "dinner",
              "name": "Noble House Noodles",
              "coord": [
                31.2287,
                121.4892
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Shanghai kids day",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Children's Museum",
              "coord": [
                31.2288,
                121.4591
              ]
            },
            {
              "type": "lunch",
              "name": "Din Tai Fung Shanghai",
              "coord": [
                31.2295,
                121.4872
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Oriental Pearl TV Tower",
              "coord": [
                31.2397,
                121.5041
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Acrobatics Show",
              "coord": [
                31.223,
                121.472
              ]
            },
            {
              "type": "dinner",
              "name": "Beefbar Shanghai",
              "coord": [
                31.2394,
                121.5091
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Water town day trip",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Zhujiajiao Water Town",
              "coord": [
                31.1649,
                121.0737
              ]
            },
            {
              "type": "lunch",
              "name": "Water town picnic",
              "coord": [
                31.1649,
                121.0737
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Yu Garden (Yuyuan)",
              "coord": [
                31.2308,
                121.489
              ]
            },
            {
              "type": "dinner",
              "name": "Jade Mansion",
              "coord": [
                31.24,
                121.4845
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Fly to Hong Kong",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Hong Kong",
              "coord": [
                22.2783,
                114.1747
              ]
            },
            {
              "type": "hotel",
              "name": "Island Shangri-La Hong Kong",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Star Ferry (Central ↔ Tsim Sha Tsui)",
              "coord": [
                22.2977,
                114.1728
              ]
            },
            {
              "type": "lunch",
              "name": "Dim Sum Square",
              "coord": [
                22.3007,
                114.1738
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Victoria Peak",
              "coord": [
                22.3128,
                114.1628
              ]
            },
            {
              "type": "dinner",
              "name": "Tim Ho Wan",
              "coord": [
                22.2888,
                114.1667
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Hong Kong family theme parks",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hong Kong Disneyland",
              "coord": [
                22.311,
                113.9426
              ]
            },
            {
              "type": "lunch",
              "name": "Disneyland lunch",
              "coord": [
                22.311,
                113.9426
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ocean Park Hong Kong",
              "coord": [
                22.2457,
                114.1801
              ]
            },
            {
              "type": "dinner",
              "name": "Peking Garden",
              "coord": [
                22.2971,
                114.1745
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Hong Kong culture & shopping",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hong Kong Museum of History",
              "coord": [
                22.2969,
                114.1746
              ]
            },
            {
              "type": "lunch",
              "name": "Lei Yue Mun Seafood Market",
              "coord": [
                22.3049,
                114.2241
              ]
            },
            {
              "type": "nap",
              "name": "Rest time",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Temple Street Night Market",
              "coord": [
                22.3071,
                114.1735
              ]
            },
            {
              "type": "dinner",
              "name": "Yung Kee Restaurant",
              "coord": [
                22.2968,
                114.1747
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Big Buddha & Depart",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.2772,
                114.1645
              ]
            },
            {
              "type": "sightseeing",
              "name": "Big Buddha (Tian Tan Buddha)",
              "coord": [
                22.2495,
                113.9102
              ]
            },
            {
              "type": "lunch",
              "name": "Last harbor meal",
              "coord": [
                22.2977,
                114.1728
              ]
            },
            {
              "type": "optional",
              "name": "Evening flight home",
              "coord": [
                22.2783,
                114.1747
              ]
            }
          ]
        }
      ]
    },
    "d": {
      "name": "Foodie Deep-Dive (10 days)",
      "color": "#DC2626",
      "days": [
        {
          "day": 1,
          "title": "Arrive Hong Kong; Dim Sum Breakfast",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hong Kong",
              "coord": [
                22.2866,
                114.1567
              ]
            },
            {
              "type": "breakfast",
              "name": "Dim Sum Square",
              "coord": [
                22.3007,
                114.1738
              ]
            },
            {
              "type": "sightseeing",
              "name": "Temple Street Night Market",
              "coord": [
                22.3071,
                114.1735
              ]
            },
            {
              "type": "lunch",
              "name": "Tim Ho Wan",
              "coord": [
                22.2888,
                114.1667
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lei Yue Mun Seafood Market",
              "coord": [
                22.3049,
                114.2241
              ]
            },
            {
              "type": "dinner",
              "name": "Ta Vie",
              "coord": [
                22.2825,
                114.1602
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Hong Kong Michelin tour",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.2866,
                114.1567
              ]
            },
            {
              "type": "lunch",
              "name": "T'ang Court",
              "coord": [
                22.3033,
                114.1602
              ]
            },
            {
              "type": "sightseeing",
              "name": "Victoria Peak",
              "coord": [
                22.3128,
                114.1628
              ]
            },
            {
              "type": "sightseeing",
              "name": "Stanley Beach & Waterfront",
              "coord": [
                22.2152,
                114.2101
              ]
            },
            {
              "type": "dinner",
              "name": "Sushi Shikon",
              "coord": [
                22.2948,
                114.1758
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Fly to Guangzhou; Roasted meats",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.2866,
                114.1567
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Guangzhou",
              "coord": [
                23.1291,
                113.2644
              ]
            },
            {
              "type": "hotel",
              "name": "Ritz-Carlton Guangzhou",
              "coord": [
                23.1291,
                113.2644
              ]
            },
            {
              "type": "lunch",
              "name": "Guangzhou Roasted Meats Master",
              "coord": [
                23.1265,
                113.2626
              ]
            },
            {
              "type": "sightseeing",
              "name": "Guangzhou Antique & Culture Market",
              "coord": [
                23.1291,
                113.2644
              ]
            },
            {
              "type": "dinner",
              "name": "Michelin Cantonese Dim Sum",
              "coord": [
                23.1291,
                113.2644
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Guangzhou seafood & Pearl River",
          "items": [
            {
              "type": "breakfast",
              "name": "Guangzhou Congee King",
              "coord": [
                23.1291,
                113.2644
              ]
            },
            {
              "type": "sightseeing",
              "name": "Guangzhou Seafood Bazaar",
              "coord": [
                23.1113,
                113.2515
              ]
            },
            {
              "type": "lunch",
              "name": "Fresh catch from market",
              "coord": [
                23.1113,
                113.2515
              ]
            },
            {
              "type": "optional",
              "name": "Afternoon rest",
              "coord": [
                23.1291,
                113.2644
              ]
            },
            {
              "type": "sightseeing",
              "name": "Pearl River Night Dinner Cruise",
              "coord": [
                23.1265,
                113.2626
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Fly to Chengdu; Sichuan spice",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                23.1291,
                113.2644
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Chengdu",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "hotel",
              "name": "Shangri-La Chengdu",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "lunch",
              "name": "Yu's Family Kitchen",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Chengdu Kuanzhai Xiangzi",
              "coord": [
                30.5707,
                104.0682
              ]
            },
            {
              "type": "dinner",
              "name": "Chen Mapo Tofu",
              "coord": [
                30.5668,
                104.0598
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Chengdu hot pot & street food",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Jinli Ancient Street",
              "coord": [
                30.5544,
                104.0689
              ]
            },
            {
              "type": "lunch",
              "name": "Chengdu Jinli Ancient Street Food Market",
              "coord": [
                30.5544,
                104.0689
              ]
            },
            {
              "type": "optional",
              "name": "Afternoon rest",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Chengdu Hot Pot Paradise",
              "coord": [
                30.5682,
                104.0583
              ]
            },
            {
              "type": "dinner",
              "name": "Chengdu Hot Pot Paradise",
              "coord": [
                30.5682,
                104.0583
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Fly to Shanghai; French-Asian cuisine",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Shanghai",
              "coord": [
                31.2304,
                121.4737
              ]
            },
            {
              "type": "hotel",
              "name": "Park Hyatt Shanghai",
              "coord": [
                31.2467,
                121.5069
              ]
            },
            {
              "type": "lunch",
              "name": "L'Atelier de Joël Robuchon",
              "coord": [
                31.238,
                121.5079
              ]
            },
            {
              "type": "sightseeing",
              "name": "The Bund (Waitan)",
              "coord": [
                31.2396,
                121.4874
              ]
            },
            {
              "type": "dinner",
              "name": "Yu Yue Heen",
              "coord": [
                31.2363,
                121.5157
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Shanghai Michelin & handmade dumplings",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                31.2467,
                121.5069
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Old City Xiaolongbao Tour",
              "coord": [
                31.2308,
                121.489
              ]
            },
            {
              "type": "lunch",
              "name": "Din Tai Fung Shanghai",
              "coord": [
                31.2295,
                121.4872
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Silk Museum",
              "coord": [
                31.1752,
                121.4897
              ]
            },
            {
              "type": "dinner",
              "name": "Ultraviolet",
              "coord": [
                31.2341,
                121.4778
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Shanghai noodles & street food",
          "items": [
            {
              "type": "breakfast",
              "name": "Chun Fang Noodles",
              "coord": [
                31.2276,
                121.4891
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Longhua Temple Market",
              "coord": [
                31.176,
                121.4827
              ]
            },
            {
              "type": "lunch",
              "name": "Shanghai Laozha",
              "coord": [
                31.2311,
                121.4884
              ]
            },
            {
              "type": "optional",
              "name": "Afternoon rest",
              "coord": [
                31.2467,
                121.5069
              ]
            },
            {
              "type": "sightseeing",
              "name": "Zhujiajiao Water Town",
              "coord": [
                31.1649,
                121.0737
              ]
            },
            {
              "type": "dinner",
              "name": "El Willy",
              "coord": [
                31.2346,
                121.4982
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Shanghai markets & departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                31.2467,
                121.5069
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Yuyuan Garden Bazaar",
              "coord": [
                31.2308,
                121.489
              ]
            },
            {
              "type": "lunch",
              "name": "Chez Panisse Shanghai",
              "coord": [
                31.2268,
                121.4726
              ]
            },
            {
              "type": "optional",
              "name": "Afternoon flight home",
              "coord": [
                31.2304,
                121.4737
              ]
            }
          ]
        }
      ]
    },
    "e": {
      "name": "Grand Tour (14 days)",
      "color": "#7C3AED",
      "days": [
        {
          "day": 1,
          "title": "Arrive Beijing; Forbidden City",
          "items": [
            {
              "type": "hotel",
              "name": "The Peninsula Beijing",
              "coord": [
                39.9094,
                116.4084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Forbidden City",
              "coord": [
                39.9163,
                116.3972
              ]
            },
            {
              "type": "lunch",
              "name": "Duyichu",
              "coord": [
                39.9132,
                116.4015
              ]
            },
            {
              "type": "dinner",
              "name": "Jing",
              "coord": [
                39.907,
                116.409
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Great Wall & Ming Tombs",
          "items": [
            {
              "type": "sightseeing",
              "name": "Great Wall (Mutianyu Section)",
              "coord": [
                40.4553,
                116.5674
              ]
            },
            {
              "type": "lunch",
              "name": "Quanjude",
              "coord": [
                39.9014,
                116.3945
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ming Tombs",
              "coord": [
                40.2566,
                116.2328
              ]
            },
            {
              "type": "dinner",
              "name": "Ai Ti Liao",
              "coord": [
                39.8989,
                116.4007
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Summer Palace & Temple of Heaven",
          "items": [
            {
              "type": "sightseeing",
              "name": "Summer Palace",
              "coord": [
                39.9984,
                116.2822
              ]
            },
            {
              "type": "lunch",
              "name": "Capital M",
              "coord": [
                39.9065,
                116.4089
              ]
            },
            {
              "type": "sightseeing",
              "name": "Temple of Heaven",
              "coord": [
                39.8847,
                116.4081
              ]
            },
            {
              "type": "dinner",
              "name": "Zhu Wei Xuan",
              "coord": [
                39.9067,
                116.3976
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Fly to Xi'an; Terracotta Army",
          "items": [
            {
              "type": "hotel",
              "name": "Shangri-La Xi'an",
              "coord": [
                34.3416,
                109.0357
              ]
            },
            {
              "type": "sightseeing",
              "name": "Terracotta Army",
              "coord": [
                34.3826,
                109.2774
              ]
            },
            {
              "type": "lunch",
              "name": "Da Qin Xiaochi",
              "coord": [
                34.3416,
                109.0357
              ]
            },
            {
              "type": "dinner",
              "name": "Song Dynasty Banquet",
              "coord": [
                34.3401,
                109.0456
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Xi'an City Wall & Muslim Quarter",
          "items": [
            {
              "type": "sightseeing",
              "name": "Xi'an City Wall",
              "coord": [
                34.3415,
                109.0355
              ]
            },
            {
              "type": "lunch",
              "name": "La Mian Workshop",
              "coord": [
                34.3401,
                109.0456
              ]
            },
            {
              "type": "sightseeing",
              "name": "Muslim Quarter Walking Tour",
              "coord": [
                34.3466,
                109.0365
              ]
            },
            {
              "type": "dinner",
              "name": "Shaanxi Roujiamo House",
              "coord": [
                34.3466,
                109.0365
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Xi'an Shaanxi Museum & Pagoda",
          "items": [
            {
              "type": "sightseeing",
              "name": "Shaanxi History Museum",
              "coord": [
                34.262,
                109.1145
              ]
            },
            {
              "type": "lunch",
              "name": "Jia Wei Shuang Shi Fu",
              "coord": [
                34.3466,
                109.0365
              ]
            },
            {
              "type": "sightseeing",
              "name": "Big Wild Goose Pagoda",
              "coord": [
                34.2308,
                109.1173
              ]
            },
            {
              "type": "sightseeing",
              "name": "Dayan Pagoda Night Show",
              "coord": [
                34.2308,
                109.1173
              ]
            },
            {
              "type": "dinner",
              "name": "Xu's Restaurant",
              "coord": [
                34.3355,
                109.0442
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Fly to Chengdu; Pandas & Temples",
          "items": [
            {
              "type": "hotel",
              "name": "Shangri-La Chengdu",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Giant Panda Breeding Base",
              "coord": [
                30.7572,
                104.0662
              ]
            },
            {
              "type": "lunch",
              "name": "Yu's Family Kitchen",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "sightseeing",
              "name": "Wuhou Shrine & Museum",
              "coord": [
                30.5557,
                104.0613
              ]
            },
            {
              "type": "dinner",
              "name": "Chen Mapo Tofu",
              "coord": [
                30.5668,
                104.0598
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Leshan Buddha & Chengdu culture",
          "items": [
            {
              "type": "sightseeing",
              "name": "Leshan Giant Buddha",
              "coord": [
                29.5513,
                103.7723
              ]
            },
            {
              "type": "lunch",
              "name": "Tian Fu Old Kitchen",
              "coord": [
                30.5668,
                104.0598
              ]
            },
            {
              "type": "sightseeing",
              "name": "Chengdu Kuanzhai Xiangzi",
              "coord": [
                30.5707,
                104.0682
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sichuan Opera Face-Changing Performance",
              "coord": [
                30.5728,
                104.0662
              ]
            },
            {
              "type": "dinner",
              "name": "Chengdu Hot Pot Paradise",
              "coord": [
                30.5682,
                104.0583
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Fly to Guilin; Li River Cruise",
          "items": [
            {
              "type": "hotel",
              "name": "The Leela Guilin",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "sightseeing",
              "name": "Li River Bamboo Raft Cruise",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "lunch",
              "name": "Guilin Rice Noodles Temple",
              "coord": [
                25.2908,
                110.2911
              ]
            },
            {
              "type": "sightseeing",
              "name": "Guilin Reed Flute Cave",
              "coord": [
                25.3403,
                110.2839
              ]
            },
            {
              "type": "dinner",
              "name": "Fish and Bamboo Raft Dinner",
              "coord": [
                25.2908,
                110.2911
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Yangshuo karst hiking",
          "items": [
            {
              "type": "sightseeing",
              "name": "Karst Mountain Hiking",
              "coord": [
                24.7725,
                110.4876
              ]
            },
            {
              "type": "lunch",
              "name": "Yangshuo Waterfront Lounge",
              "coord": [
                24.7725,
                110.4876
              ]
            },
            {
              "type": "sightseeing",
              "name": "Dragon's Backbone Rice Terraces",
              "coord": [
                25.7445,
                110.3447
              ]
            },
            {
              "type": "dinner",
              "name": "Yangshuo Waterfront Lounge",
              "coord": [
                24.7725,
                110.4876
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "Fly to Shanghai; Bund & museums",
          "items": [
            {
              "type": "hotel",
              "name": "Pudong Shangri-La",
              "coord": [
                31.2361,
                121.515
              ]
            },
            {
              "type": "sightseeing",
              "name": "The Bund (Waitan)",
              "coord": [
                31.2396,
                121.4874
              ]
            },
            {
              "type": "lunch",
              "name": "Noble House Noodles",
              "coord": [
                31.2287,
                121.4892
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shanghai Museum",
              "coord": [
                31.2313,
                121.4747
              ]
            },
            {
              "type": "dinner",
              "name": "Yu Yue Heen",
              "coord": [
                31.2363,
                121.5157
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Shanghai gardens & water town",
          "items": [
            {
              "type": "sightseeing",
              "name": "Yu Garden (Yuyuan)",
              "coord": [
                31.2308,
                121.489
              ]
            },
            {
              "type": "lunch",
              "name": "Jade Mansion",
              "coord": [
                31.24,
                121.4845
              ]
            },
            {
              "type": "sightseeing",
              "name": "Zhujiajiao Water Town",
              "coord": [
                31.1649,
                121.0737
              ]
            },
            {
              "type": "dinner",
              "name": "Chez Panisse Shanghai",
              "coord": [
                31.2268,
                121.4726
              ]
            }
          ]
        },
        {
          "day": 13,
          "title": "Fly to Hong Kong; Peak & markets",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hong Kong",
              "coord": [
                22.2866,
                114.1567
              ]
            },
            {
              "type": "sightseeing",
              "name": "Victoria Peak",
              "coord": [
                22.3128,
                114.1628
              ]
            },
            {
              "type": "lunch",
              "name": "Tim Ho Wan",
              "coord": [
                22.2888,
                114.1667
              ]
            },
            {
              "type": "sightseeing",
              "name": "Temple Street Night Market",
              "coord": [
                22.3071,
                114.1735
              ]
            },
            {
              "type": "dinner",
              "name": "Ta Vie",
              "coord": [
                22.2825,
                114.1602
              ]
            }
          ]
        },
        {
          "day": 14,
          "title": "Hong Kong Big Buddha & Depart",
          "items": [
            {
              "type": "sightseeing",
              "name": "Big Buddha (Tian Tan Buddha)",
              "coord": [
                22.2495,
                113.9102
              ]
            },
            {
              "type": "lunch",
              "name": "Lei Yue Mun Seafood Market",
              "coord": [
                22.3049,
                114.2241
              ]
            },
            {
              "type": "sightseeing",
              "name": "Star Ferry (Central ↔ Tsim Sha Tsui)",
              "coord": [
                22.2977,
                114.1728
              ]
            },
            {
              "type": "optional",
              "name": "Evening flight home",
              "coord": [
                22.2783,
                114.1747
              ]
            }
          ]
        }
      ]
    }
  }
}