{
  "key": "italy",
  "name": "Italy",
  "subtitle": "Art, cuisine & la dolce vita",
  "flag": "🇮🇹",
  "defaultCenter": [
    42.5,
    12.5
  ],
  "defaultZoom": 6,
  "hotels": [
    {
      "name": "Aki Family Resort",
      "coord": [
        46.7152,
        11.6556
      ],
      "desc": "Aki Family Resort - distinctive Italian destination",
      "longDesc": "All-inclusive alpine family resort with Montessori kids club. Montane activities and seasonal skiing nearby Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Aki%20Family%20Resort&center=46.7152,11.6556"
    },
    {
      "name": "Ancora Cortina",
      "coord": [
        46.5406,
        12.1275
      ],
      "desc": "Cortina d'Ampezzo luxury hotel, Dolomites",
      "longDesc": "in Cortina d'Ampezzo. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ancora%20Cortina&center=46.5406,12.1275"
    },
    {
      "name": "Castel Badia",
      "coord": [
        46.7831,
        11.9039
      ],
      "desc": "Castel Badia - distinctive Italian destination",
      "longDesc": "Medieval castle reimagined as luxury retreat. Wellness spa and mountain heritage in Dolomites Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castel%20Badia&center=46.7831,11.9039"
    },
    {
      "name": "Falkensteiner Family Resort Lido",
      "coord": [
        46.7833,
        11.7333
      ],
      "desc": "Falkensteiner Family Resort Lido - distinctive Italian destination",
      "longDesc": "All-inclusive family resort with curated activities. Dolomites location for memorable Italian adventures Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Falkensteiner%20Family%20Resort%20Lido&center=46.7833,11.7333"
    },
    {
      "name": "Hotel Saltus",
      "coord": [
        46.5,
        11.5
      ],
      "desc": "Hotel Saltus - distinctive Italian destination",
      "longDesc": "in South Tyrol. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Saltus&center=46.5,11.5"
    },
    {
      "name": "La Perla",
      "coord": [
        46.55,
        11.8667
      ],
      "desc": "Corvara alpine luxury, ski resort",
      "longDesc": "Mountain excellence combining alpine tradition with contemporary luxury. Iconic Dolomites ski destination Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Perla&center=46.55,11.8667"
    },
    {
      "name": "Quellenhof Luxury Resort Passeier",
      "coord": [
        46.7667,
        11.1833
      ],
      "desc": "Quellenhof Luxury Resort Passeier - distinctive Italian destination",
      "longDesc": "All-inclusive family resort with curated activities. South Tyrol location for memorable Italian adventures Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Quellenhof%20Luxury%20Resort%20Passeier&center=46.7667,11.1833"
    },
    {
      "name": "Passalacqua",
      "coord": [
        45.853,
        9.098
      ],
      "desc": "Lake Como luxury, ranked world's best hotel",
      "longDesc": "Iconic lakeside palazzo combining elegance with Como's refined hospitality tradition. Waterfront escape Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Passalacqua&center=45.853,9.098"
    },
    {
      "name": "Rosewood Castiglion del Bosco",
      "coord": [
        43.0996,
        11.8432
      ],
      "desc": "Rosewood Castiglion del Bosco - distinctive Italian destination",
      "longDesc": "Sprawling wine estate offering tastings and cooking classes. Authentic countryside immersion Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rosewood%20Castiglion%20del%20Bosco&center=43.0996,11.8432"
    },
    {
      "name": "Aman Venice",
      "coord": [
        45.4408,
        12.3155
      ],
      "desc": "Grand Canal palazzo, 16th-century palace",
      "longDesc": "Restored Renaissance palace on Venice's most famous waterway. Quintessential Venetian sophistication Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Aman%20Venice&center=45.4408,12.3155"
    },
    {
      "name": "Hotel Cipriani",
      "coord": [
        45.4408,
        12.3155
      ],
      "desc": "Venice island sanctuary, Belmond luxury",
      "longDesc": "Private island escape across from San Marco. Garden oasis with unmatched Venetian elegance and service Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Cipriani&center=45.4408,12.3155"
    },
    {
      "name": "Collegio alla Querce",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Florence Auberge, new luxury 2025",
      "longDesc": "Contemporary luxury in historic Florence setting. Design-forward approach to Renaissance city experience Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Collegio%20alla%20Querce&center=43.7695,11.2558"
    },
    {
      "name": "Four Seasons Hotel Firenze",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Four Seasons Hotel Firenze - distinctive Italian destination",
      "longDesc": "Historic Renaissance palace in cultural heart. Gardens, spa, and proximity to Uffizi Gallery Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Four%20Seasons%20Hotel%20Firenze&center=43.7695,11.2558"
    },
    {
      "name": "La Réserve Firenze",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Florence restored palazzo - authentic Italian experience",
      "longDesc": "Restored Renaissance palazzo radiating elegance. Florence cultural heart with contemporary comfort Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20R%C3%A9serve%20Firenze&center=43.7695,11.2558"
    },
    {
      "name": "Borgo Santandrea",
      "coord": [
        40.634,
        14.6027
      ],
      "desc": "Amalfi Coast luxury hotel, Campania",
      "longDesc": "in Amalfi Coast. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Borgo%20Santandrea&center=40.634,14.6027"
    },
    {
      "name": "Il San Pietro di Positano",
      "coord": [
        40.626,
        14.4809
      ],
      "desc": "Cliffside Amalfi luxury, private beach",
      "longDesc": "Dramatic clifftop setting above azure Tyrrhenian waters. Private beach access and Mediterranean grandeur Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20San%20Pietro%20di%20Positano&center=40.626,14.4809"
    },
    {
      "name": "JK Place Capri",
      "coord": [
        40.553,
        14.245
      ],
      "desc": "Capri design boutique hotel - luxury accommodation",
      "longDesc": "celebrating local character. Intimate spaces in Capri with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=JK%20Place%20Capri&center=40.553,14.245"
    },
    {
      "name": "San Domenico Palace Taormina",
      "coord": [
        37.8516,
        15.2876
      ],
      "desc": "San Domenico Palace Taormina - distinctive Italian destination",
      "longDesc": "Clifftop Sicilian luxury overlooking Greek theater. Mediterranean coastline and timeless grandeur Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=San%20Domenico%20Palace%20Taormina&center=37.8516,15.2876"
    },
    {
      "name": "Tonnara di Scopello",
      "coord": [
        37.9841,
        12.6669
      ],
      "desc": "Scopello luxury hotel, Sicily - luxury accommodation",
      "longDesc": "in Scopello. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Tonnara%20di%20Scopello&center=37.9841,12.6669"
    },
    {
      "name": "Verdura Resort",
      "coord": [
        37.5071,
        13.086
      ],
      "desc": "Verdura Resort - distinctive Italian destination",
      "longDesc": "Championship golf course in Sicilian countryside. Water sports, kids clubs, and island landscape Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Verdura%20Resort&center=37.5071,13.086"
    },
    {
      "name": "Villa Igiea",
      "coord": [
        38.1157,
        13.3615
      ],
      "desc": "Palermo Rocco Forte palace hotel",
      "longDesc": "Belle Époque palace overlooking Tyrrhenian Sea. Sicilian grandeur with modern service excellence Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Igiea&center=38.1157,13.3615"
    },
    {
      "name": "Villa Mabel",
      "coord": [
        37.8516,
        15.2876
      ],
      "desc": "Taormina design boutique hotel",
      "longDesc": "celebrating local character. Intimate spaces in Taormina with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Mabel&center=37.8516,15.2876"
    },
    {
      "name": "Casa Maiora",
      "coord": [
        41.0,
        16.5
      ],
      "desc": "Puglia spa & wellness retreat - authentic Italian experience",
      "longDesc": "Wellness sanctuary combining rejuvenation traditions. Spa treatments amid Puglia natural beauty Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Casa%20Maiora&center=41.0,16.5"
    },
    {
      "name": "La Fiermontina Palazzo Bozzi Corso",
      "coord": [
        40.3569,
        18.1719
      ],
      "desc": "Lecce luxury palazzo, Baroque heart",
      "longDesc": "Salento's finest palazzo in Lecce's historic center. Baroque craftsmanship and regional elegance Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Fiermontina%20Palazzo%20Bozzi%20Corso&center=40.3569,18.1719"
    },
    {
      "name": "Vista Ostuni",
      "coord": [
        40.8353,
        17.5789
      ],
      "desc": "Ostuni luxury hotel, Puglia - luxury accommodation",
      "longDesc": "in Ostuni. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Vista%20Ostuni&center=40.8353,17.5789"
    },
    {
      "name": "Borgo Santo Pietro",
      "coord": [
        43.1547,
        11.0847
      ],
      "desc": "Chiusdino Tuscany, spa estate - authentic Italian experience",
      "longDesc": "Working farm estate with award-winning spa. Authentic Tuscan experience with farm-to-table dining Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Borgo%20Santo%20Pietro&center=43.1547,11.0847"
    },
    {
      "name": "Castello di Casole",
      "coord": [
        43.3396,
        11.0465
      ],
      "desc": "Castello di Casole - distinctive Italian destination",
      "longDesc": "Estate château surrounded by Tuscan vineyards. Truffle hunts, cooking classes, countryside luxury Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castello%20di%20Casole&center=43.3396,11.0465"
    },
    {
      "name": "Castello di Vicarello",
      "coord": [
        43.1,
        11.8
      ],
      "desc": "Historic Tuscany castle hotel - luxury accommodation",
      "longDesc": "Medieval castle offering historic romance and modern luxury. Experience Tuscany heritage reimagined Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castello%20di%20Vicarello&center=43.1,11.8"
    },
    {
      "name": "Hotel Il Pellicano",
      "coord": [
        42.3942,
        11.2064
      ],
      "desc": "Porto Ercole luxury hotel, Tuscany",
      "longDesc": "in Porto Ercole. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Il%20Pellicano&center=42.3942,11.2064"
    },
    {
      "name": "La Suvera",
      "coord": [
        43.2531,
        11.1242
      ],
      "desc": "Pievescola luxury hotel, Tuscany",
      "longDesc": "in Pievescola. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Suvera&center=43.2531,11.1242"
    },
    {
      "name": "Quercia Rubra Villa",
      "coord": [
        43.1,
        11.8
      ],
      "desc": "Tuscany (countryside) luxury villa retreat",
      "longDesc": "Exclusive villa escape with private amenities. Perfect for multi-family gatherings in Tuscany (countryside) Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Quercia%20Rubra%20Villa&center=43.1,11.8"
    },
    {
      "name": "Bulgari Hotel Roma",
      "coord": [
        41.9028,
        12.4964
      ],
      "desc": "Rome luxury hotel, Lazio - luxury accommodation",
      "longDesc": "Contemporary luxury set within a restored Roman palazzo, offering refined spa experiences and rooftop dining with sweeping views across the ancient city.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bulgari%20Hotel%20Roma&center=41.9028,12.4964"
    },
    {
      "name": "Casa Monti",
      "coord": [
        41.9028,
        12.4964
      ],
      "desc": "Rome design boutique hotel - luxury accommodation",
      "longDesc": "celebrating local character. Intimate spaces in Rome with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Casa%20Monti&center=41.9028,12.4964"
    },
    {
      "name": "Orient Express La Minerva",
      "coord": [
        41.9028,
        12.4964
      ],
      "desc": "Rome luxury hotel, Lazio - luxury accommodation",
      "longDesc": "Eighteenth-century palazzo steps from the Pantheon, blending Roman grandeur with Orient Express elegance in storied rooms overlooking Piazza della Minerva.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Orient%20Express%20La%20Minerva&center=41.9028,12.4964"
    },
    {
      "name": "Ara Maris",
      "coord": [
        40.6263,
        14.3757
      ],
      "desc": "Sorrento luxury hotel, Campania",
      "longDesc": "in Sorrento. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ara%20Maris&center=40.6263,14.3757"
    },
    {
      "name": "Botania Relais",
      "coord": [
        40.7275,
        13.897
      ],
      "desc": "Ischia design boutique hotel - luxury accommodation",
      "longDesc": "celebrating local character. Intimate spaces in Ischia with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Botania%20Relais&center=40.7275,13.897"
    },
    {
      "name": "Botania Relais & Spa",
      "coord": [
        40.7275,
        13.897
      ],
      "desc": "Ischia spa & wellness retreat - authentic Italian experience",
      "longDesc": "Wellness sanctuary combining rejuvenation traditions. Spa treatments amid Ischia natural beauty Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Botania%20Relais%20%26%20Spa&center=40.7275,13.897"
    },
    {
      "name": "Casa Maria Luigia",
      "coord": [
        44.6472,
        10.9252
      ],
      "desc": "Modena design boutique hotel - luxury accommodation",
      "longDesc": "celebrating local character. Intimate spaces in Modena with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Casa%20Maria%20Luigia&center=44.6472,10.9252"
    },
    {
      "name": "Castello di Reschio",
      "coord": [
        43.2333,
        12.1333
      ],
      "desc": "Historic Lisciano Niccone castle hotel",
      "longDesc": "Medieval castle offering historic romance and modern luxury. Experience Umbria heritage reimagined Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castello%20di%20Reschio&center=43.2333,12.1333"
    },
    {
      "name": "Corte della Maestà",
      "coord": [
        42.6306,
        12.1306
      ],
      "desc": "Civita di Bagnoregio design boutique hotel",
      "longDesc": "celebrating local character. Intimate spaces in Civita di Bagnoregio with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Corte%20della%20Maest%C3%A0&center=42.6306,12.1306"
    },
    {
      "name": "Furore Grand Hotel",
      "coord": [
        40.6208,
        14.5519
      ],
      "desc": "Furore luxury hotel, Campania - luxury accommodation",
      "longDesc": "in Furore. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Furore%20Grand%20Hotel&center=40.6208,14.5519"
    },
    {
      "name": "Hotel De Len",
      "coord": [
        46.5406,
        12.1275
      ],
      "desc": "Cortina d'Ampezzo design boutique hotel",
      "longDesc": "celebrating local character. Intimate spaces in Cortina d'Ampezzo with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20De%20Len&center=46.5406,12.1275"
    },
    {
      "name": "La Badia Hotel",
      "coord": [
        42.7181,
        12.1092
      ],
      "desc": "Orvieto luxury hotel, Umbria - luxury accommodation",
      "longDesc": "in Orvieto. Impeccable service and Italian hospitality excellence Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Badia%20Hotel&center=42.7181,12.1092"
    },
    {
      "name": "Luxury Villa on Lake Garda",
      "coord": [
        45.55,
        10.5
      ],
      "desc": "Lake Garda (Monte Baldo) luxury villa retreat",
      "longDesc": "Exclusive villa escape with private amenities. Perfect for multi-family gatherings in Lake Garda (Monte Baldo) Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Luxury%20Villa%20on%20Lake%20Garda&center=45.55,10.5"
    },
    {
      "name": "Masseria Calderisi",
      "coord": [
        40.8337,
        17.3637
      ],
      "desc": "Fasano design boutique hotel - luxury accommodation",
      "longDesc": "celebrating local character. Intimate spaces in Fasano with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Masseria%20Calderisi&center=40.8337,17.3637"
    },
    {
      "name": "Masseria Potenti",
      "coord": [
        40.7998,
        17.5011
      ],
      "desc": "Manduria traditional farmhouse hotel",
      "longDesc": "Authentic farmhouse tradition in Manduria. Farm-to-table dining and countryside tranquility combined Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Masseria%20Potenti&center=40.7998,17.5011"
    },
    {
      "name": "Palazzo Daniele",
      "coord": [
        39.8333,
        18.3667
      ],
      "desc": "Palazzo Daniele - distinctive Italian destination",
      "longDesc": "Restored Renaissance palazzo radiating elegance. Gagliano del Capo cultural heart with contemporary comfort Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Palazzo%20Daniele&center=39.8333,18.3667"
    },
    {
      "name": "Podere Del Mare",
      "coord": [
        43.0992,
        11.6008
      ],
      "desc": "Tuscan coast luxury villa retreat",
      "longDesc": "Exclusive villa escape with private amenities. Perfect for multi-family gatherings in Tuscan coast Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Podere%20Del%20Mare&center=43.0992,11.6008"
    },
    {
      "name": "Private Villa on Salina",
      "coord": [
        38.5608,
        14.8539
      ],
      "desc": "Salina luxury villa retreat - authentic Italian experience",
      "longDesc": "Exclusive villa escape with private amenities. Perfect for multi-family gatherings in Salina Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Private%20Villa%20on%20Salina&center=38.5608,14.8539"
    },
    {
      "name": "Quellenhof Luxury Resort Lazise",
      "coord": [
        45.4981,
        10.7343
      ],
      "desc": "Quellenhof Luxury Resort Lazise - distinctive Italian destination",
      "longDesc": "All-inclusive family resort with curated activities. Lake Garda location for memorable Italian adventures Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Quellenhof%20Luxury%20Resort%20Lazise&center=45.4981,10.7343"
    },
    {
      "name": "Susafa",
      "coord": [
        37.8012,
        14.5002
      ],
      "desc": "Sicilian countryside design boutique hotel",
      "longDesc": "celebrating local character. Intimate spaces in Sicilian countryside with impeccable service Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Susafa&center=37.8012,14.5002"
    },
    {
      "name": "Hotel Ristorante Grotta Palazzese",
      "coord": [
        41.02,
        17.1987
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Luxury accommodation offering authentic Italian hospitality and exceptional service in a memorable location.",
      "city": "Polignano a Mare",
      "region": "Puglia",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Ristorante%20Grotta%20Palazzese&center=41.02,17.1987"
    },
    {
      "name": "Grotta Palazzese",
      "coord": [
        41.02,
        17.1987
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Grotta Palazzese culture and cuisine in an authentic setting.",
      "city": "Polignano a Mare",
      "region": "Puglia",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grotta%20Palazzese&center=41.02,17.1987"
    },
    {
      "name": "Cipriani, A Belmond Hotel, Venice",
      "coord": [
        45.441,
        12.316
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Cipriani, A Belmond Hotel, Venice culture and cuisine in an authentic setting.",
      "city": "Venice",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cipriani%2C%20A%20Belmond%20Hotel%2C%20Venice&center=45.441,12.316"
    },
    {
      "name": "Hotel Santa Caterina",
      "coord": [
        40.634,
        14.602
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Hotel Santa Caterina culture and cuisine in an authentic setting.",
      "city": "Amalfi Coast",
      "region": "Amalfi",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Santa%20Caterina&center=40.634,14.602"
    },
    {
      "name": "Jumeirah Capri Palace",
      "coord": [
        40.551,
        14.222
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Jumeirah Capri Palace culture and cuisine in an authentic setting.",
      "city": "Anacapri",
      "region": "Capri",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Jumeirah%20Capri%20Palace&center=40.551,14.222"
    },
    {
      "name": "Hotel Borgo San Felice",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Hotel Borgo San Felice culture and cuisine in an authentic setting.",
      "city": "Castelnuovo Berardenga",
      "region": "Tuscany",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Borgo%20San%20Felice&center=42.5,12.5"
    },
    {
      "name": "Bellevue Hotel & Spa",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Bellevue Hotel & Spa culture and cuisine in an authentic setting.",
      "city": "Cogne",
      "region": "Aosta Valley",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bellevue%20Hotel%20%26%20Spa&center=42.5,12.5"
    },
    {
      "name": "Palazzo Portinari Salviati",
      "coord": [
        43.77,
        11.256
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Palazzo Portinari Salviati culture and cuisine in an authentic setting.",
      "city": "Florence",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Palazzo%20Portinari%20Salviati&center=43.77,11.256"
    },
    {
      "name": "Villa Cora",
      "coord": [
        43.77,
        11.256
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa Cora culture and cuisine in an authentic setting.",
      "city": "Florence",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Cora&center=43.77,11.256"
    },
    {
      "name": "Villa La Massa",
      "coord": [
        43.77,
        11.256
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa La Massa culture and cuisine in an authentic setting.",
      "city": "Florence",
      "region": "riverfront",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20La%20Massa&center=43.77,11.256"
    },
    {
      "name": "EALA My Lakeside Dream",
      "coord": [
        45.63,
        10.71
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on EALA My Lakeside Dream culture and cuisine in an authentic setting.",
      "city": "Limone sul Garda",
      "region": "Lake Garda",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=EALA%20My%20Lakeside%20Dream&center=45.63,10.71"
    },
    {
      "name": "Therasia Resort Sea & Spa",
      "coord": [
        38.56,
        14.96
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Therasia Resort Sea & Spa culture and cuisine in an authentic setting.",
      "city": "Lipari / Vulcano",
      "region": "Aeolian Islands",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Therasia%20Resort%20Sea%20%26%20Spa&center=38.56,14.96"
    },
    {
      "name": "Grand Hotel Victoria Concept & Spa",
      "coord": [
        45.989,
        9.265
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Grand Hotel Victoria Concept & Spa culture and cuisine in an authentic setting.",
      "city": "Menaggio",
      "region": "Lake Como",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Hotel%20Victoria%20Concept%20%26%20Spa&center=45.989,9.265"
    },
    {
      "name": "Castel Fragsburg",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Castel Fragsburg culture and cuisine in an authentic setting.",
      "city": "Merano",
      "region": "South Tyrol",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castel%20Fragsburg&center=42.5,12.5"
    },
    {
      "name": "Villa Eden",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa Eden culture and cuisine in an authentic setting.",
      "city": "Merano",
      "region": "South Tyrol",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Eden&center=42.5,12.5"
    },
    {
      "name": "Grand Hotel et de Milan",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Grand Hotel et de Milan culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Hotel%20et%20de%20Milan&center=45.464,9.19"
    },
    {
      "name": "Portrait Milano",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Portrait Milano culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Portrait%20Milano&center=45.464,9.19"
    },
    {
      "name": "Castelfalfi",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Castelfalfi culture and cuisine in an authentic setting.",
      "city": "Montaione",
      "region": "Tuscany",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castelfalfi&center=42.5,12.5"
    },
    {
      "name": "I Borghi dell'Eremo",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on I Borghi dell'Eremo culture and cuisine in an authentic setting.",
      "city": "Narni",
      "region": "Umbria",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=I%20Borghi%20dell%27Eremo&center=42.5,12.5"
    },
    {
      "name": "Lefay Resort & Spa Dolomiti",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Lefay Resort & Spa Dolomiti culture and cuisine in an authentic setting.",
      "city": "Pinzolo",
      "region": "Dolomites",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lefay%20Resort%20%26%20Spa%20Dolomiti&center=42.5,12.5"
    },
    {
      "name": "Forestis",
      "coord": [
        46.715,
        11.656
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Forestis culture and cuisine in an authentic setting.",
      "city": "Bressanone",
      "region": "Dolomites",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Forestis&center=46.715,11.656"
    },
    {
      "name": "Hotel Vilòn",
      "coord": [
        41.903,
        12.496
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Hotel Vilòn culture and cuisine in an authentic setting.",
      "city": "Rome",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Vil%C3%B2n&center=41.903,12.496"
    },
    {
      "name": "JK Place Roma",
      "coord": [
        41.903,
        12.496
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on JK Place Roma culture and cuisine in an authentic setting.",
      "city": "Rome",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=JK%20Place%20Roma&center=41.903,12.496"
    },
    {
      "name": "Bellevue Syrene",
      "coord": [
        40.626,
        14.376
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Bellevue Syrene culture and cuisine in an authentic setting.",
      "city": "Sorrento",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bellevue%20Syrene&center=40.626,14.376"
    },
    {
      "name": "La Minervetta",
      "coord": [
        40.626,
        14.376
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on La Minervetta culture and cuisine in an authentic setting.",
      "city": "Sorrento",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Minervetta&center=40.626,14.376"
    },
    {
      "name": "Grand Hotel Timeo, A Belmond Hotel, Taormina",
      "coord": [
        37.852,
        15.285
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Grand Hotel Timeo, A Belmond Hotel, Taormina culture and cuisine in an authentic setting.",
      "city": "Taormina",
      "region": "Sicily",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Hotel%20Timeo%2C%20A%20Belmond%20Hotel%2C%20Taormina&center=37.852,15.285"
    },
    {
      "name": "Il Sereno",
      "coord": [
        45.989,
        9.265
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Il Sereno culture and cuisine in an authentic setting.",
      "city": "Torno",
      "region": "Lake Como",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20Sereno&center=45.989,9.265"
    },
    {
      "name": "Grand Hotel Tremezzo",
      "coord": [
        45.989,
        9.265
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Grand Hotel Tremezzo culture and cuisine in an authentic setting.",
      "city": "Tremezzo",
      "region": "Lake Como",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Hotel%20Tremezzo&center=45.989,9.265"
    },
    {
      "name": "Hotel Gritti Palace",
      "coord": [
        45.441,
        12.316
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Hotel Gritti Palace culture and cuisine in an authentic setting.",
      "city": "Venice",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Gritti%20Palace&center=45.441,12.316"
    },
    {
      "name": "Villa d'Este",
      "coord": [
        45.989,
        9.265
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa d'Este culture and cuisine in an authentic setting.",
      "city": "Cernobbio",
      "region": "Lake Como",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20d%27Este&center=45.989,9.265"
    },
    {
      "name": "Borgo Egnazia",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Borgo Egnazia culture and cuisine in an authentic setting.",
      "city": "Savelletri di Fasano",
      "region": "Puglia",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Borgo%20Egnazia&center=42.5,12.5"
    },
    {
      "name": "Masseria Torre Maizza",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Masseria Torre Maizza culture and cuisine in an authentic setting.",
      "city": "Savelletri di Fasano",
      "region": "Puglia",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Masseria%20Torre%20Maizza&center=42.5,12.5"
    },
    {
      "name": "Monaci delle Terre Nere",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Monaci delle Terre Nere culture and cuisine in an authentic setting.",
      "city": "Zafferana Etnea",
      "region": "Sicily",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Monaci%20delle%20Terre%20Nere&center=42.5,12.5"
    },
    {
      "name": "Mezzatorre Hotel & Thermal Spa",
      "coord": [
        40.73,
        13.896
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Mezzatorre Hotel & Thermal Spa culture and cuisine in an authentic setting.",
      "city": "Forio d'Ischia",
      "region": "Ischia",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mezzatorre%20Hotel%20%26%20Thermal%20Spa&center=40.73,13.896"
    },
    {
      "name": "COMO Castello del Nero",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on COMO Castello del Nero culture and cuisine in an authentic setting.",
      "city": "Tavarnelle Val di Pesa",
      "region": "Tuscany",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=COMO%20Castello%20del%20Nero&center=42.5,12.5"
    },
    {
      "name": "Grand Hotel Excelsior Vittoria",
      "coord": [
        40.626,
        14.376
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Grand Hotel Excelsior Vittoria culture and cuisine in an authentic setting.",
      "city": "Sorrento",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Hotel%20Excelsior%20Vittoria&center=40.626,14.376"
    },
    {
      "name": "Hassler Roma",
      "coord": [
        41.903,
        12.496
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Hassler Roma culture and cuisine in an authentic setting.",
      "city": "Rome",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hassler%20Roma&center=41.903,12.496"
    },
    {
      "name": "Six Senses Rome",
      "coord": [
        41.903,
        12.496
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Six Senses Rome culture and cuisine in an authentic setting.",
      "city": "Rome",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Six%20Senses%20Rome&center=41.903,12.496"
    },
    {
      "name": "Luca's Restaurant / Hotel La Gemma",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Luca's Restaurant / Hotel La Gemma culture and cuisine in an authentic setting.",
      "city": "Florence",
      "region": "Tuscany",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Luca%27s%20Restaurant%20/%20Hotel%20La%20Gemma&center=43.7695,11.2558"
    },
    {
      "name": "Villa Crespi",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa Crespi culture and cuisine in an authentic setting.",
      "city": "Orta San Giulio",
      "region": "Lake Orta",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Crespi&center=42.5,12.5"
    },
    {
      "name": "Seta by Antonio Guida",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Seta by Antonio Guida culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Seta%20by%20Antonio%20Guida&center=45.464,9.19"
    },
    {
      "name": "Villa Feltrinelli",
      "coord": [
        45.63,
        10.71
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa Feltrinelli culture and cuisine in an authentic setting.",
      "city": "Gargnano",
      "region": "Lake Garda",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Feltrinelli&center=45.63,10.71"
    },
    {
      "name": "Villa Elena",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Villa Elena culture and cuisine in an authentic setting.",
      "city": "Bergamo",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Elena&center=42.5,12.5"
    },
    {
      "name": "George Restaurant",
      "coord": [
        40.852,
        14.268
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on George Restaurant culture and cuisine in an authentic setting.",
      "city": "Naples",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=George%20Restaurant&center=40.852,14.268"
    },
    {
      "name": "Kid & Coe Italy Guide",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Kid & Coe Italy Guide culture and cuisine in an authentic setting.",
      "city": "Multiple",
      "region": "Multiple",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Kid%20%26%20Coe%20Italy%20Guide&center=42.5,12.5"
    },
    {
      "name": "Bioparco di Roma (zoo)",
      "coord": [
        41.903,
        12.496
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Bioparco di Roma (zoo) culture and cuisine in an authentic setting.",
      "city": "Rome",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bioparco%20di%20Roma%20%28zoo%29&center=41.903,12.496"
    },
    {
      "name": "Casina di Raffaello playroom",
      "coord": [
        41.903,
        12.496
      ],
      "desc": "Luxury accommodation offering authentic Italian hospitality and exceptional serv",
      "longDesc": "Discover this hotel gem offering a unique perspective on Casina di Raffaello playroom culture and cuisine in an authentic setting.",
      "city": "Rome",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Casina%20di%20Raffaello%20playroom&center=41.903,12.496"
    },
    {
      "name": "Grand Hotel Majestic Bologna",
      "coord": [
        44.497,
        11.345
      ],
      "city": "Bologna",
      "desc": "Belle Epoque luxury hotel in historic center",
      "longDesc": "Historic grand hotel featuring belle époque elegance, exceptional service, and prestigious location in Bologna's medieval heart.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Hotel%20Majestic%20Bologna&center=44.497,11.345"
    },
    {
      "name": "Belmond Villa San Michele",
      "coord": [
        43.79,
        11.3
      ],
      "city": "Florence",
      "region": "Tuscany",
      "desc": "Renaissance villa hotel with panoramic Florentine views",
      "longDesc": "Exquisite renaissance villa perched above Florence offering extraordinary art, gardens, and unrivaled views of the Duomo.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Belmond%20Villa%20San%20Michele&center=43.79,11.3"
    },
    {
      "name": "Hotel Excelsior Venice",
      "coord": [
        45.427,
        12.308
      ],
      "city": "Venice",
      "desc": "Beachfront luxury hotel with iconic red carpet",
      "longDesc": "Glamorous beachfront palace on the Lido famous for the Venice Film Festival and timeless Venetian luxury hospitality.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Excelsior%20Venice&center=45.427,12.308"
    },
    {
      "name": "Palazzo Avino Ravello",
      "coord": [
        40.649,
        14.611
      ],
      "city": "Ravello",
      "region": "Amalfi Coast",
      "desc": "Clifftop luxury palazzo with infinite sea views",
      "longDesc": "Exclusive clifftop palazzo offering dramatic Mediterranean views, terraced gardens, Michelin-starred dining, and unparalleled refinement.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Palazzo%20Avino%20Ravello&center=40.649,14.611"
    },
    {
      "name": "Villa Cora Florence",
      "coord": [
        43.755,
        11.268
      ],
      "city": "Florence",
      "region": "Tuscany",
      "desc": "Historic villa with Michelangelo sculpture collection",
      "longDesc": "Elegant historic villa featuring a private Michelangelo sculpture collection, lush gardens, and sophisticated Florentine hospitality.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Cora%20Florence&center=43.755,11.268"
    },
    {
      "name": "Rocco Forte House Rome",
      "coord": [
        41.905,
        12.502
      ],
      "city": "Rome",
      "desc": "Luxury palazzo near Spanish Steps and Trevi Fountain",
      "longDesc": "Intimate luxury palazzo meticulously restored in Rome's most exclusive neighborhood with uncompromising service and elegance.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rocco%20Forte%20House%20Rome&center=41.905,12.502"
    },
    {
      "name": "Borgo Egnazia Puglia",
      "coord": [
        40.758,
        17.347
      ],
      "city": "Fasano",
      "region": "Puglia",
      "desc": "Ultra-luxury resort mimicking whitewashed Puglian village",
      "longDesc": "Exclusive resort designed as a traditional whitewashed Puglian village with Michelin-starred dining and world-class spa facilities.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Borgo%20Egnazia%20Puglia&center=40.758,17.347"
    },
    {
      "name": "Hotel Danieli Venice",
      "coord": [
        45.436,
        12.342
      ],
      "city": "Venice",
      "desc": "Beachfront luxury palazzo with Venetian gothic architecture",
      "longDesc": "Historic Venetian palace offering stunning Grand Canal views, exemplary service, and quintessential Venetian sophistication and elegance.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hotel%20Danieli%20Venice&center=45.436,12.342"
    },
    {
      "name": "Verdura Resort Sicily",
      "coord": [
        37.25,
        13.15
      ],
      "city": "Sciacca",
      "region": "Sicily",
      "desc": "Beachfront luxury resort with golf and tennis",
      "longDesc": "Exclusive Sicilian beachfront resort offering private beach, championship golf course, fine dining, and Mediterranean luxury experience.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Verdura%20Resort%20Sicily&center=37.25,13.15"
    }
  ],
  "restaurants": [
    {
      "name": "Acquolina",
      "coord": [
        41.8935,
        12.4655
      ],
      "desc": "Refined seafood tasting menus with two Michelin stars in Rome's Parioli",
      "longDesc": ". 2 MICHELIN Stars; high-end tasting menus Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Acquolina&center=41.8935,12.4655"
    },
    {
      "name": "Agli Amici",
      "coord": [
        46.083,
        13.268
      ],
      "desc": "Two Michelin stars of refined Friulian cuisine in Godia near Udine",
      "longDesc": ". 2 MICHELIN Stars; Friuli destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Agli%20Amici&center=46.083,13.268"
    },
    {
      "name": "Ai Tre Scalini",
      "coord": [
        41.8871,
        12.4681
      ],
      "desc": "Beloved Monti wine bar with natural wines and Roman small plates",
      "longDesc": ". A fixture in Monti Ai Tre Scalini is a bustling wine bar cherished by locals Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ai%20Tre%20Scalini&center=41.8871,12.4681"
    },
    {
      "name": "Andrea Aprea",
      "coord": [
        45.468,
        9.184
      ],
      "desc": "Creative Neapolitan cuisine elevated to fine dining in central Milan",
      "longDesc": ". 2 MICHELIN Stars; modern Italian Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Andrea%20Aprea&center=45.468,9.184"
    },
    {
      "name": "Antica Corona Reale",
      "coord": [
        44.7041,
        8.0309
      ],
      "desc": "Antica Corona Reale - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Piedmont classic Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Antica%20Corona%20Reale&center=44.7041,8.0309"
    },
    {
      "name": "Antica Hostaria della Lanterna",
      "coord": [
        45.4654,
        9.1914
      ],
      "desc": "Antica Hostaria della Lanterna - distinctive Italian destination",
      "longDesc": ". Vogue pick; no-menu daily specials Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Antica%20Hostaria%20della%20Lanterna&center=45.4654,9.1914"
    },
    {
      "name": "Antica Osteria Cera",
      "coord": [
        45.4385,
        12.3135
      ],
      "desc": "Antica Osteria Cera - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; seafood destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Antica%20Osteria%20Cera&center=45.4385,12.3135"
    },
    {
      "name": "Antica Trattoria Suban",
      "coord": [
        45.65,
        13.78
      ],
      "desc": "Antica Trattoria Suban - distinctive Italian destination",
      "longDesc": ". Family-run since 1865. Austro-Hungarian tradition Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Antica%20Trattoria%20Suban&center=45.65,13.78"
    },
    {
      "name": "Arnolfo",
      "coord": [
        43.7726,
        11.2586
      ],
      "desc": "Arnolfo - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Tuscan fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Arnolfo&center=43.7726,11.2586"
    },
    {
      "name": "Atelier Moessmer Norbert Niederkofler",
      "coord": [
        46.796,
        11.936
      ],
      "desc": "Three Michelin stars of mountain cuisine in Brunico, South Tyrol",
      "longDesc": ". 3 MICHELIN Stars; Dolomites destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Atelier%20Moessmer%20Norbert%20Niederkofler&center=46.796,11.936"
    },
    {
      "name": "Caffè degli Specchi",
      "coord": [
        45.65,
        13.78
      ],
      "desc": "historic café, Trieste - authentic Italian experience",
      "longDesc": ". Grand 19th-c café. Trieste's living room. Piazza Unità d'Italia Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Caff%C3%A8%20degli%20Specchi&center=45.65,13.78"
    },
    {
      "name": "Caino",
      "coord": [
        43.768,
        11.258
      ],
      "desc": "Caino - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Tuscan classic Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Caino&center=43.768,11.258"
    },
    {
      "name": "Campo del Drago",
      "coord": [
        43.7734,
        11.2594
      ],
      "desc": "Campo del Drago - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; wine-country splurge Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Campo%20del%20Drago&center=43.7734,11.2594"
    },
    {
      "name": "Casa Perbellini 12 Apostoli",
      "coord": [
        45.4423,
        10.9963
      ],
      "desc": "Three Michelin stars of intimate counter dining in historic Verona",
      "longDesc": ". 3 MICHELIN Stars; destination fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Casa%20Perbellini%2012%20Apostoli&center=45.4423,10.9963"
    },
    {
      "name": "Castel fine dining",
      "coord": [
        46.669,
        11.159
      ],
      "desc": "Elegant castle dining with Tyrolean-Mediterranean fusion near Merano",
      "longDesc": ". 2 MICHELIN Stars; South Tyrol destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Castel%20fine%20dining&center=46.669,11.159"
    },
    {
      "name": "D'O",
      "coord": [
        45.498,
        9.021
      ],
      "desc": "Davide Oldani's pop-cuisine revolution in a minimalist Milanese setting",
      "longDesc": ". 2 MICHELIN Stars; chef-driven menus Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=D%27O&center=45.498,9.021"
    },
    {
      "name": "Da Vittorio",
      "coord": [
        45.672,
        9.763
      ],
      "desc": "Cerea family's three Michelin stars of Lombard cuisine near Bergamo",
      "longDesc": ". 3 MICHELIN Stars; iconic fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Da%20Vittorio&center=45.672,9.763"
    },
    {
      "name": "Dal Pescatore",
      "coord": [
        45.4602,
        9.1862
      ],
      "desc": "Italian Contemporary, Runate - authentic Italian experience",
      "longDesc": ". 3 MICHELIN Stars; legendary family restaurant Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dal%20Pescatore&center=45.4602,9.1862"
    },
    {
      "name": "Duomo",
      "coord": [
        36.927,
        14.732
      ],
      "desc": "Ciccio Sultano's baroque Sicilian fine dining in historic Ragusa Ibla",
      "longDesc": ". 2 MICHELIN Stars; Ragusa destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Duomo&center=36.927,14.732"
    },
    {
      "name": "Enoteca La Torre",
      "coord": [
        42.418,
        12.105
      ],
      "desc": "Creative Tuscan-Lazio cuisine with deep wine cellar in Villa Laetitia",
      "longDesc": "Fine dining excellence. Set within Anna Venturini Fendi’s magnificent Villa Laetitia Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Enoteca%20La%20Torre&center=42.418,12.105"
    },
    {
      "name": "Enoteca Pinchiorri",
      "coord": [
        43.7663,
        11.2523
      ],
      "desc": "Enoteca Pinchiorri - distinctive Italian destination",
      "longDesc": ". 3 MICHELIN Stars; Florence classic Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Enoteca%20Pinchiorri&center=43.7663,11.2523"
    },
    {
      "name": "Ercoli 1928",
      "coord": [
        41.8854,
        12.4736
      ],
      "desc": "Historic Roman gastronomia and wine bar in the Prati neighborhood",
      "longDesc": ". A Roman institution since – yes you guessed it – 1928 Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ercoli%201928&center=41.8854,12.4736"
    },
    {
      "name": "Famiglia Rana",
      "coord": [
        45.383,
        11.039
      ],
      "desc": "Pasta dynasty's gourmet restaurant amid Verona vineyards",
      "longDesc": ". 2 MICHELIN Stars; destination dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Famiglia%20Rana&center=45.383,11.039"
    },
    {
      "name": "Felice a Testaccio",
      "coord": [
        41.8934,
        12.4656
      ],
      "desc": "Rome's legendary cacio e pepe since 1936 in the Testaccio neighborhood",
      "longDesc": ". Testaccio is widely considered the best neighbourhood for Roman cuisine Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Felice%20a%20Testaccio&center=41.8934,12.4656"
    },
    {
      "name": "Giggetto al Portico",
      "coord": [
        41.893,
        12.477
      ],
      "desc": "Giggetto al Portico - distinctive Italian destination",
      "longDesc": ". Famous cacio e pepe. Jewish Quarter Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Giggetto%20al%20Portico&center=41.893,12.477"
    },
    {
      "name": "Harry's Piccolo",
      "coord": [
        45.65,
        13.78
      ],
      "desc": "Harry's Piccolo - distinctive Italian destination",
      "longDesc": "Fine dining excellence. 2 Michelin stars. Trieste's finest Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Harry%27s%20Piccolo&center=45.65,13.78"
    },
    {
      "name": "I Tenerumi",
      "coord": [
        41.8877,
        12.4713
      ],
      "desc": "Sicilian-Roman trattoria focused on seasonal island ingredients in Rome",
      "longDesc": ". 2 MICHELIN Stars; veg-forward menus Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=I%20Tenerumi&center=41.8877,12.4713"
    },
    {
      "name": "Il Liberty",
      "coord": [
        45.4659,
        9.1919
      ],
      "desc": "Trattoria, Milan - authentic Italian experience",
      "longDesc": ". Vogue pick; classic Milanese comfort food Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20Liberty&center=45.4659,9.1919"
    },
    {
      "name": "Il Mulino ai quattro venti",
      "coord": [
        41.8879,
        12.4689
      ],
      "desc": "Charming countryside restaurant south of Rome with garden dining",
      "longDesc": ". fish This remarkable Italian destination showcases exceptional heritage, culture, and tradition. Experience unforgettable moments and discover authentic Italian hospitality traditions.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20Mulino%20ai%20quattro%20venti&center=41.8879,12.4689"
    },
    {
      "name": "Il Pagliaccio",
      "coord": [
        41.896,
        12.472
      ],
      "desc": "Two Michelin stars of creative Japanese-Italian fusion near Campo de' Fiori",
      "longDesc": ". 2 MICHELIN Stars; destination dining in Rome Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20Pagliaccio&center=41.896,12.472"
    },
    {
      "name": "Il Piccolo Principe",
      "coord": [
        43.7663,
        11.2523
      ],
      "desc": "Il Piccolo Principe - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Riviera splurge Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20Piccolo%20Principe&center=43.7663,11.2523"
    },
    {
      "name": "Krèsios",
      "coord": [
        40.8476,
        14.2636
      ],
      "desc": "Krèsios - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; chef-driven tasting Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Kr%C3%A8sios&center=40.8476,14.2636"
    },
    {
      "name": "L'Olivo",
      "coord": [
        40.649,
        14.612
      ],
      "desc": "Mediterranean fine dining at Belmond Caruso with Amalfi panoramic views",
      "longDesc": ". 2 MICHELIN Stars; Capri fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=L%27Olivo&center=40.649,14.612"
    },
    {
      "name": "La Gelatiera",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "La Gelatiera - distinctive Italian destination",
      "longDesc": "Artisanal gelato perfection. Best gelato of 14 tested in Florence Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Gelatiera&center=43.7695,11.2558"
    },
    {
      "name": "La Latteria di San Marco",
      "coord": [
        45.4596,
        9.1944
      ],
      "desc": "Tiny trattoria, Milan - authentic Italian experience",
      "longDesc": ". Vogue pick; legendary small room; no reservations Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Latteria%20di%20San%20Marco&center=45.4596,9.1944"
    },
    {
      "name": "La Madia",
      "coord": [
        37.103,
        13.94
      ],
      "desc": "Two Michelin stars of modern Sicilian cuisine in coastal Licata",
      "longDesc": ". 2 MICHELIN Stars; Sicilian fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Madia&center=37.103,13.94"
    },
    {
      "name": "La Peca",
      "coord": [
        45.386,
        11.392
      ],
      "desc": "Two stars of Veneto cuisine with farm-sourced ingredients in Lonigo",
      "longDesc": "Nicola Portinari's refined Veneto cuisine draws on local farms and seasonal ingredients, served in an elegant country house setting near Vicenza's rolling hills.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Peca&center=45.386,11.392"
    },
    {
      "name": "La Pergola",
      "coord": [
        41.918,
        12.446
      ],
      "desc": "Rome's only three-star Michelin with panoramic Eternal City rooftop views",
      "longDesc": ". 3 MICHELIN Stars; Rome splurge classic Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Pergola&center=41.918,12.446"
    },
    {
      "name": "La Reggia degli Etruschi",
      "coord": [
        43.7696,
        11.2558
      ],
      "desc": "La Reggia degli Etruschi - distinctive Italian destination",
      "longDesc": ". Panoramic views over Florence exceptional service Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Reggia%20degli%20Etruschi&center=43.7696,11.2558"
    },
    {
      "name": "La Rei Natura by Michelangelo Mammoliti",
      "coord": [
        44.698,
        8.033
      ],
      "desc": "Three Michelin stars amid Langhe vineyards in Serralunga d'Alba",
      "longDesc": ". 3 MICHELIN Stars; Langhe fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Rei%20Natura%20by%20Michelangelo%20Mammoliti&center=44.698,8.033"
    },
    {
      "name": "La Semivuota",
      "coord": [
        45.4674,
        9.1866
      ],
      "desc": "La Semivuota - distinctive Italian destination",
      "longDesc": ". Vogue pick; nostalgic Milanese dishes Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Semivuota&center=45.4674,9.1866"
    },
    {
      "name": "Le Calandre",
      "coord": [
        45.417,
        11.814
      ],
      "desc": "Three Michelin stars of Massimiliano Alajmo's creative genius near Padua",
      "longDesc": ". 3 MICHELIN Stars; Italian culinary landmark Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Le%20Calandre&center=45.417,11.814"
    },
    {
      "name": "Lo Scoglio",
      "coord": [
        40.5919,
        14.345
      ],
      "desc": "seafood, Nerano - authentic Italian experience",
      "longDesc": ". Legendary Nerano restaurant. Pasta with zucchini Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lo%20Scoglio&center=40.5919,14.345"
    },
    {
      "name": "Madonnina del Pescatore",
      "coord": [
        43.724,
        13.21
      ],
      "desc": "Moreno Cedroni's Adriatic seafood artistry on Senigallia's coast",
      "longDesc": ". 2 MICHELIN Stars; Adriatic destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Madonnina%20del%20Pescatore&center=43.724,13.21"
    },
    {
      "name": "Magnolia",
      "coord": [
        44.4921,
        11.3459
      ],
      "desc": "Magnolia - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; refined dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Magnolia&center=44.4921,11.3459"
    },
    {
      "name": "Moma",
      "coord": [
        41.8938,
        12.4652
      ],
      "desc": "Seasonal Roman cuisine with creative flair near Via Veneto",
      "longDesc": "Fine dining excellence. A Michelin star establishment Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Moma&center=41.8938,12.4652"
    },
    {
      "name": "Osteria Brunello",
      "coord": [
        45.4615,
        9.1925
      ],
      "desc": "Osteria, Milan - authentic Italian experience",
      "longDesc": ". Vogue pick; modern osteria near Corso Garibaldi Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Osteria%20Brunello&center=45.4615,9.1925"
    },
    {
      "name": "Osteria Francescana",
      "coord": [
        44.6498,
        10.9222
      ],
      "desc": "Massimo Bottura's legendary three-star restaurant redefining Italian cuisine",
      "longDesc": ". 3 MICHELIN Stars; world-famous dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Osteria%20Francescana&center=44.6498,10.9222"
    },
    {
      "name": "Osteria dell’Acquabella",
      "coord": [
        45.4627,
        9.1913
      ],
      "desc": "Osteria dell’Acquabella - distinctive Italian destination",
      "longDesc": ". Vogue pick; classic Milanese dishes Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Osteria%20dell%E2%80%99Acquabella&center=45.4627,9.1913"
    },
    {
      "name": "Pastificio San Lorenzo",
      "coord": [
        41.8853,
        12.4737
      ],
      "desc": "Fresh pasta factory-turned-restaurant in Rome's San Lorenzo district",
      "longDesc": ". Tucked away in the lively student district of San Lorenzo Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pastificio%20San%20Lorenzo&center=41.8853,12.4737"
    },
    {
      "name": "Piazza Duomo",
      "coord": [
        44.7,
        8.035
      ],
      "desc": "Enrico Crippa's three Michelin stars with vegetable artistry in Alba",
      "longDesc": ". 3 MICHELIN Stars; Alba destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Piazza%20Duomo&center=44.7,8.035"
    },
    {
      "name": "Piazzetta Milù",
      "coord": [
        40.8484,
        14.2644
      ],
      "desc": "Piazzetta Milù - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Sorrento area Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Piazzetta%20Mil%C3%B9&center=40.8484,14.2644"
    },
    {
      "name": "Piero Pompili (Restaurant/Chef)",
      "coord": [
        44.4949,
        11.3426
      ],
      "desc": "Bologna - authentic Italian experience",
      "longDesc": ". Lasagna showcase. Chef Piero Pompili. Traditional Bolognese Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Piero%20Pompili%20%28Restaurant/Chef%29&center=44.4949,11.3426"
    },
    {
      "name": "Quattro Passi",
      "coord": [
        40.595,
        14.34
      ],
      "desc": "Two Michelin stars of Sorrentine coast cuisine overlooking Nerano bay",
      "longDesc": ". 3 MICHELIN Stars; coastal fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Quattro%20Passi&center=40.595,14.34"
    },
    {
      "name": "Reale",
      "coord": [
        41.784,
        14.11
      ],
      "desc": "Niko Romito's three Michelin stars of essential Italian cuisine in Abruzzo",
      "longDesc": ". 3 MICHELIN Stars; creative mountain dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Reale&center=41.784,14.11"
    },
    {
      "name": "Rifugio Crucolo",
      "coord": [
        46.5,
        11.8
      ],
      "desc": "alpine hut/rifugio, Historic alpine hut, Trentino",
      "longDesc": ". Historic alpine hut Italian-Austrian culinary fusion Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rifugio%20Crucolo&center=46.5,11.8"
    },
    {
      "name": "Ristorante Grassilli",
      "coord": [
        44.4949,
        11.3426
      ],
      "desc": "Ristorante Grassilli - distinctive Italian destination",
      "longDesc": ". Mortadella tortellini in brodo Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ristorante%20Grassilli&center=44.4949,11.3426"
    },
    {
      "name": "Romanè",
      "coord": [
        41.8866,
        12.4676
      ],
      "desc": "Traditional Roman pizza al taglio with creative seasonal toppings",
      "longDesc": ". Founded by Stefano Callegari (the mastermind behind Trapizzino Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Roman%C3%A8&center=41.8866,12.4676"
    },
    {
      "name": "Roscioli Salumeria con Cucina",
      "coord": [
        41.8903,
        12.4713
      ],
      "desc": "Rome's beloved salumeria-restaurant with legendary charcuterie selection",
      "longDesc": ". A household name This remarkable Italian destination showcases exceptional heritage, culture, and tradition. Experience unforgettable moments and discover authentic Italian hospitality traditions.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Roscioli%20Salumeria%20con%20Cucina&center=41.8903,12.4713"
    },
    {
      "name": "San Domenico",
      "coord": [
        44.4976,
        11.3404
      ],
      "desc": "San Domenico - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; old-school icon Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=San%20Domenico&center=44.4976,11.3404"
    },
    {
      "name": "Santa Elisabetta",
      "coord": [
        43.7651,
        11.2511
      ],
      "desc": "Santa Elisabetta - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Florence fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Santa%20Elisabetta&center=43.7651,11.2511"
    },
    {
      "name": "SantoPalato",
      "coord": [
        41.8876,
        12.4714
      ],
      "desc": "Chef Sarah Cicolini's nose-to-tail Roman cooking in Pigneto",
      "longDesc": ". A new wave of traditional Jewish-Roman cuisine reigns at Santo Palato (literally: sacred palate) Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=SantoPalato&center=41.8876,12.4714"
    },
    {
      "name": "St. George by Heinz Beck",
      "coord": [
        41.8874,
        12.4716
      ],
      "desc": "Heinz Beck's creative Mediterranean cuisine at The St. Regis Rome",
      "longDesc": ". 2 MICHELIN Stars; Taormina fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=St.%20George%20by%20Heinz%20Beck&center=41.8874,12.4716"
    },
    {
      "name": "Supplizio",
      "coord": [
        41.8857,
        12.4667
      ],
      "desc": "Gourmet street food supplì and Roman snacks near Largo Argentina",
      "longDesc": ". which makes the most of simple ingredients. Today Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Supplizio&center=41.8857,12.4667"
    },
    {
      "name": "Taverna Estia",
      "coord": [
        40.8473,
        14.2633
      ],
      "desc": "Taverna Estia - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; tasting menus Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Taverna%20Estia&center=40.8473,14.2633"
    },
    {
      "name": "Terra - The Magic Place",
      "coord": [
        46.637,
        11.355
      ],
      "desc": "Alpine fine dining with foraged Tyrolean ingredients in Sarentino",
      "longDesc": ". 2 MICHELIN Stars; alpine destination Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Terra%20-%20The%20Magic%20Place&center=46.637,11.355"
    },
    {
      "name": "Testina Milano",
      "coord": [
        45.4598,
        9.1858
      ],
      "desc": "Testina Milano - distinctive Italian destination",
      "longDesc": ". Vogue pick; Milanese specialties Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Testina%20Milano&center=45.4598,9.1858"
    },
    {
      "name": "Torre del Saracino",
      "coord": [
        40.8506,
        14.2666
      ],
      "desc": "Torre del Saracino - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; Sorrento coast views Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Torre%20del%20Saracino&center=40.8506,14.2666"
    },
    {
      "name": "Trapizzino | Trastevere",
      "coord": [
        41.8929,
        12.4661
      ],
      "desc": "Stefano Callegari's iconic Roman street food pocket-pizza in Trastevere",
      "longDesc": "Authentic wood-fired pizza. Stefano Callegari the mastermind behind Trapizzino Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trapizzino%20%7C%20Trastevere&center=41.8929,12.4661"
    },
    {
      "name": "Trattoria Da Cesare al Casaletto",
      "coord": [
        41.8918,
        12.4672
      ],
      "desc": "Legendary Roman trattoria with textbook carbonara in Monteverde",
      "longDesc": ". Located at the end of the 8 tram that snakes its way through the Trastevere neighbourhood Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Da%20Cesare%20al%20Casaletto&center=41.8918,12.4672"
    },
    {
      "name": "Trattoria Da Enzo al 29",
      "coord": [
        41.8851,
        12.4739
      ],
      "desc": "Queue-worthy Trastevere trattoria beloved for classic Roman pasta",
      "longDesc": ". A picturesque little eatery located on a quieter street in Trastevere Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Da%20Enzo%20al%2029&center=41.8851,12.4739"
    },
    {
      "name": "Trattoria Ermes",
      "coord": [
        44.6472,
        10.9252
      ],
      "desc": "traditional trattoria, Modena - authentic Italian experience",
      "longDesc": "Traditional Modena institution with identical menu since 1963, beloved by Michelin chefs",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Ermes&center=44.6472,10.9252"
    },
    {
      "name": "Trattoria Ermes (Modena)",
      "coord": [
        44.6472,
        10.9252
      ],
      "desc": "Traditional Modena trattoria with fixed menu since 1963, Massimo Bottura favorit",
      "longDesc": "Massimo Bottura's favorite lunch spot where a fixed daily menu of handmade Modenese classics has drawn loyal crowds since 1963 with no-frills hospitality.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Ermes%20%28Modena%29&center=44.6472,10.9252"
    },
    {
      "name": "Trattoria Masuelli San Marco",
      "coord": [
        45.4667,
        9.1873
      ],
      "desc": "Historic trattoria, Vogue pick; institution since 1921, Milan",
      "longDesc": ". Vogue pick; institution since 1921 Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Masuelli%20San%20Marco&center=45.4667,9.1873"
    },
    {
      "name": "Trattoria Pennestri",
      "coord": [
        41.8926,
        12.4664
      ],
      "desc": "Modern Roman osteria in Ostiense with natural wines and seasonal menu",
      "longDesc": ". With its cosy interiors and warm service Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Pennestri&center=41.8926,12.4664"
    },
    {
      "name": "Trattoria Sostanza",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Trattoria Sostanza - distinctive Italian destination",
      "longDesc": ". Famous butter chicken and artichoke omelette Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Sostanza&center=43.7695,11.2558"
    },
    {
      "name": "Trattoria Vecchia Arena",
      "coord": [
        45.4654,
        9.1914
      ],
      "desc": "Trattoria Vecchia Arena - distinctive Italian destination",
      "longDesc": ". Vogue pick; beloved neighborhood spot Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Vecchia%20Arena&center=45.4654,9.1914"
    },
    {
      "name": "Trattoria da Ruggero",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Trattoria da Ruggero - distinctive Italian destination",
      "longDesc": ". Personal favorite from Florence guide. Tuscan comfort food Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20da%20Ruggero&center=43.7695,11.2558"
    },
    {
      "name": "Trippa Milano",
      "coord": [
        45.4661,
        9.1879
      ],
      "desc": "Trippa Milano - authentic Italian experience",
      "longDesc": ". Vogue pick; modern trattoria with cult following Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trippa%20Milano&center=45.4661,9.1879"
    },
    {
      "name": "Uliassi",
      "coord": [
        43.718,
        13.218
      ],
      "desc": "Three Michelin stars of Adriatic seafood creativity in Senigallia",
      "longDesc": ". 3 MICHELIN Stars; Adriatic coast icon Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Uliassi&center=43.718,13.218"
    },
    {
      "name": "Verso Capitaneo",
      "coord": [
        45.4677,
        9.1937
      ],
      "desc": "Verso Capitaneo - distinctive Italian destination",
      "longDesc": ". 2 MICHELIN Stars; contemporary cuisine Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Verso%20Capitaneo&center=45.4677,9.1937"
    },
    {
      "name": "danì maison",
      "coord": [
        40.73,
        13.896
      ],
      "desc": "Nino Di Costanzo's two Michelin stars of island cuisine on Ischia",
      "longDesc": ". 2 MICHELIN Stars; island fine dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying.",
      "kidFriendly": false,
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=dan%C3%AC%20maison&center=40.73,13.896"
    },
    {
      "name": "Pizzicheria di De Miccoli Bruno (Antonio's Salumeria)",
      "coord": [
        43.3195,
        11.9306
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking methods with local ingredients.",
      "city": "Siena",
      "region": "Tuscany",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pizzicheria%20di%20De%20Miccoli%20Bruno%20%28Antonio%27s%20Salumeria%29&center=43.3195,11.9306"
    },
    {
      "name": "Where the Chefs Eat: Milan (Macelleria Popolare)",
      "coord": [
        45.4642,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Where the Chefs Eat: Milan (Macelleria Popolare) culture and cuisine in an authentic setting.",
      "city": "Milan",
      "region": "Lombardy",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Where%20the%20Chefs%20Eat%3A%20Milan%20%28Macelleria%20Popolare%29&center=45.4642,9.19"
    },
    {
      "name": "Da'Vinattieri",
      "coord": [
        43.7695,
        11.2558
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Da'Vinattieri culture and cuisine in an authentic setting.",
      "city": "Florence",
      "region": "Tuscany",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Da%27Vinattieri&center=43.7695,11.2558"
    },
    {
      "name": "La Palanca",
      "coord": [
        45.4408,
        12.3155
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on La Palanca culture and cuisine in an authentic setting.",
      "city": "Venice (Giudecca)",
      "region": "Veneto",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=La%20Palanca&center=45.4408,12.3155"
    },
    {
      "name": "Harry's Bar",
      "coord": [
        45.4408,
        12.3155
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Harry's Bar culture and cuisine in an authentic setting.",
      "city": "Venice",
      "region": "Veneto",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Harry%27s%20Bar&center=45.4408,12.3155"
    },
    {
      "name": "Do Forni",
      "coord": [
        45.4408,
        12.3155
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Do Forni culture and cuisine in an authentic setting.",
      "city": "Venice",
      "region": "Veneto",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Do%20Forni&center=45.4408,12.3155"
    },
    {
      "name": "Conca del Sogno",
      "coord": [
        40.5919,
        14.345
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Conca del Sogno culture and cuisine in an authentic setting.",
      "city": "Nerano",
      "region": "Campania/Amalfi",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Conca%20del%20Sogno&center=40.5919,14.345"
    },
    {
      "name": "Da Adolfo",
      "coord": [
        40.626,
        14.4809
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Da Adolfo culture and cuisine in an authentic setting.",
      "city": "Positano",
      "region": "Campania/Amalfi",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Da%20Adolfo&center=40.626,14.4809"
    },
    {
      "name": "Macelleria Popolare",
      "coord": [
        45.4642,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Macelleria Popolare culture and cuisine in an authentic setting.",
      "city": "Milan",
      "region": "Lombardy",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Macelleria%20Popolare&center=45.4642,9.19"
    },
    {
      "name": "Al Gatto Verde",
      "coord": [
        44.6472,
        10.9252
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Al Gatto Verde culture and cuisine in an authentic setting.",
      "city": "Modena",
      "region": "Emilia-Romagna",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Al%20Gatto%20Verde&center=44.6472,10.9252"
    },
    {
      "name": "Enrico Bartolini al Mudec",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Enrico Bartolini al Mudec culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Enrico%20Bartolini%20al%20Mudec&center=45.464,9.19"
    },
    {
      "name": "Glam Enrico Bartolini",
      "coord": [
        45.441,
        12.316
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Glam Enrico Bartolini culture and cuisine in an authentic setting.",
      "city": "Venice",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Glam%20Enrico%20Bartolini&center=45.441,12.316"
    },
    {
      "name": "Locanda Sant'Uffizio Enrico Bartolini",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Locanda Sant'Uffizio Enrico Bartolini culture and cuisine in an authentic setting.",
      "city": "Cioccaro",
      "region": "Piedmont",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Locanda%20Sant%27Uffizio%20Enrico%20Bartolini&center=42.5,12.5"
    },
    {
      "name": "Ratanà",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Ratanà culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ratan%C3%A0&center=45.464,9.19"
    },
    {
      "name": "Trattoria del Ciumbia",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Trattoria del Ciumbia culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20del%20Ciumbia&center=45.464,9.19"
    },
    {
      "name": "Trattoria Mirta",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Trattoria Mirta culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trattoria%20Mirta&center=45.464,9.19"
    },
    {
      "name": "El Brellin",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on El Brellin culture and cuisine in an authentic setting.",
      "city": "Milan",
      "region": "Navigli",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=El%20Brellin&center=45.464,9.19"
    },
    {
      "name": "Moebius Milano",
      "coord": [
        45.464,
        9.19
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Moebius Milano culture and cuisine in an authentic setting.",
      "city": "Milan",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Moebius%20Milano&center=45.464,9.19"
    },
    {
      "name": "Locale Firenze",
      "coord": [
        43.77,
        11.256
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Locale Firenze culture and cuisine in an authentic setting.",
      "city": "Florence",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Locale%20Firenze&center=43.77,11.256"
    },
    {
      "name": "Sartoria Cocktail Bar",
      "coord": [
        38.116,
        13.362
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Sartoria Cocktail Bar culture and cuisine in an authentic setting.",
      "city": "Palermo",
      "region": "Sicily",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sartoria%20Cocktail%20Bar&center=38.116,13.362"
    },
    {
      "name": "Morgana Cocktail Bar",
      "coord": [
        37.852,
        15.285
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Morgana Cocktail Bar culture and cuisine in an authentic setting.",
      "city": "Taormina",
      "region": "Sicily",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Morgana%20Cocktail%20Bar&center=37.852,15.285"
    },
    {
      "name": "Mak Mixology",
      "coord": [
        38.116,
        13.362
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Mak Mixology culture and cuisine in an authentic setting.",
      "city": "Palermo",
      "region": "Sicily",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mak%20Mixology&center=38.116,13.362"
    },
    {
      "name": "Bohéme",
      "coord": [
        37.502,
        15.087
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Bohéme culture and cuisine in an authentic setting.",
      "city": "Catania",
      "region": "Sicily",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Boh%C3%A9me&center=37.502,15.087"
    },
    {
      "name": "Pizza at L’Antica Pizzeria Da Michele",
      "coord": [
        40.852,
        14.268
      ],
      "desc": "Authentic Italian cuisine celebrating regional flavors and traditional cooking m",
      "longDesc": "Discover this restaurant gem offering a unique perspective on Pizza at L’Antica Pizzeria Da Michele culture and cuisine in an authentic setting.",
      "city": "Naples",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pizza%20at%20L%E2%80%99Antica%20Pizzeria%20Da%20Michele&center=40.852,14.268"
    },
    {
      "name": "Divinare",
      "coord": [
        43.77,
        11.256
      ],
      "city": "Florence",
      "region": "Tuscany",
      "desc": "Michelin-starred contemporary Italian cuisine",
      "longDesc": "Award-winning restaurant celebrating Italian ingredients with contemporary technique and refined seasonal tasting menus.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Divinare&center=43.77,11.256"
    },
    {
      "name": "Il Margine",
      "coord": [
        41.903,
        12.496
      ],
      "city": "Rome",
      "desc": "Michelin-starred Roman trattoria with traditional cuisine",
      "longDesc": "Celebrated restaurant honoring Roman culinary traditions with impeccable ingredients, humble elegance, and outstanding service.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Il%20Margine&center=41.903,12.496"
    },
    {
      "name": "Franceschetta 58",
      "coord": [
        44.495,
        11.343
      ],
      "city": "Bologna",
      "desc": "Modern trattoria celebrating Bolognese traditions",
      "longDesc": "Contemporary take on Bologna's legendary cuisine featuring handmade pasta, mortadella, and seasonal ingredients in casual-chic setting.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Franceschetta%2058&center=44.495,11.343"
    },
    {
      "name": "L'Olivo Capri",
      "coord": [
        40.551,
        14.222
      ],
      "city": "Capri",
      "region": "Campania",
      "desc": "Michelin-starred Mediterranean cuisine in Capri",
      "longDesc": "Michelin-starred Mediterranean restaurant featuring fresh seafood, Capri lemons, and island-inspired contemporary Italian cuisine.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=L%27Olivo%20Capri&center=40.551,14.222"
    }
  ],
  "experiences": [
    {
      "name": "Colosseum",
      "coord": [
        41.8902,
        12.4922
      ],
      "desc": "Colosseum - distinctive Italian destination",
      "longDesc": "Marvel at Italy's most iconic monument. Explore ancient arena where gladiators fought, discover underground chambers and arena floor ruins Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Colosseum&center=41.8902,12.4922"
    },
    {
      "name": "Roman Forum",
      "coord": [
        41.8925,
        12.4852
      ],
      "desc": "Ancient marketplace and civic center",
      "longDesc": "Walk among marble columns and temples spanning centuries of Roman history. Visit Temple of Saturn, House of the Vestal Virgins, and ancient basilicas.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Roman%20Forum&center=41.8925,12.4852"
    },
    {
      "name": "Pantheon",
      "coord": [
        41.8986,
        12.4769
      ],
      "desc": "Pantheon - distinctive Italian destination",
      "longDesc": "Step inside this 2,000-year-old masterpiece. Marvel at the oculus flooding light onto marble floors and Renaissance tombs within Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pantheon&center=41.8986,12.4769"
    },
    {
      "name": "Vatican Museums & Sistine Chapel",
      "coord": [
        41.9058,
        12.457
      ],
      "desc": "Vatican Museums & Sistine Chapel - distinctive Italian destination",
      "longDesc": "Ascend the papal staircase, walk through Renaissance galleries, and gaze at Michelangelo's iconic ceiling frescoes in the Sistine Chapel Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Vatican%20Museums%20%26%20Sistine%20Chapel&center=41.9058,12.457"
    },
    {
      "name": "St. Peter's Basilica",
      "coord": [
        41.9022,
        12.4539
      ],
      "desc": "World's largest church - stunning Renaissance basilica",
      "longDesc": "Enter Christendom's holiest site. Climb 551 steps to the dome for panoramic views, or descend to papal crypts below the altar.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=St.%20Peter%27s%20Basilica&center=41.9022,12.4539"
    },
    {
      "name": "Piazza Navona",
      "coord": [
        41.8992,
        12.4731
      ],
      "desc": "Piazza Navona - distinctive Italian destination",
      "longDesc": "Relax at this vibrant square. Watch street performers and artists, sip espresso at outdoor cafés, admire Bernini's fountains Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Piazza%20Navona&center=41.8992,12.4731"
    },
    {
      "name": "Spanish Steps",
      "coord": [
        41.906,
        12.4828
      ],
      "desc": "Spanish Steps - distinctive Italian destination",
      "longDesc": "Climb the famous 135 steps lined with azaleas in spring. Perfect for people-watching, shopping, and absorbing Roman elegance Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Spanish%20Steps&center=41.906,12.4828"
    },
    {
      "name": "Trevi Fountain",
      "coord": [
        41.9009,
        12.4833
      ],
      "desc": "Trevi Fountain - distinctive Italian destination",
      "longDesc": "Witness the theatrical Trevi Fountain. Throw in a coin to ensure your return to Rome, then escape to quieter nearby streets.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trevi%20Fountain&center=41.9009,12.4833"
    },
    {
      "name": "Trastevere",
      "coord": [
        41.8894,
        12.4712
      ],
      "desc": "Trastevere - distinctive Italian destination",
      "longDesc": "Wander ivy-covered alleyways and discover intimate trattorias. Explore artisan workshops, vintage shops, and authentic Roman nightlife Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trastevere&center=41.8894,12.4712"
    },
    {
      "name": "Villa Borghese",
      "coord": [
        41.914,
        12.492
      ],
      "desc": "Expansive park with gardens and museums",
      "longDesc": "Stroll through manicured gardens, rent a rowboat on the lake, visit Galleria Borghese for masterpieces by Bernini and Titian Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Borghese&center=41.914,12.492"
    },
    {
      "name": "Galleria Borghese",
      "coord": [
        41.9145,
        12.4936
      ],
      "desc": "Intimate museum of Renaissance and Baroque art",
      "longDesc": "See Bernini's dramatic sculptures and Caravaggio paintings in this gem. Requires advance tickets for uncrowded viewings Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Galleria%20Borghese&center=41.9145,12.4936"
    },
    {
      "name": "Capitoline Museums",
      "coord": [
        41.893,
        12.4852
      ],
      "desc": "Capitoline Museums - distinctive Italian destination",
      "longDesc": "Climb the Capitoline Hill to view the Lupa Capitolina (Capitoline Wolf), Roman bronzes, and paintings in Michelangelo-designed buildings Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Capitoline%20Museums&center=41.893,12.4852"
    },
    {
      "name": "Domus Aurea (Golden House)",
      "coord": [
        41.9105,
        12.4977
      ],
      "desc": "Nero's vast palace with frescoed rooms",
      "longDesc": "Descend into Nero's buried palace. Tour vaulted chambers with remarkable stucco work and ancient murals preserved for 2,000 years Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Domus%20Aurea%20%28Golden%20House%29&center=41.9105,12.4977"
    },
    {
      "name": "Villa Farnesina",
      "coord": [
        41.8868,
        12.4658
      ],
      "desc": "Villa Farnesina - distinctive Italian destination",
      "longDesc": "Enter this jewel in Trastevere. Admire Raphael's Loggia of Psyche and Sodoma's elegant frescoes in aristocratic apartments Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Farnesina&center=41.8868,12.4658"
    },
    {
      "name": "Galleria Colonna",
      "coord": [
        41.9031,
        12.481
      ],
      "desc": "Galleria Colonna - distinctive Italian destination",
      "longDesc": "Step into a princely residence. View Old Masters including works by Carracci and Tintoretto in candlelit galleries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Galleria%20Colonna&center=41.9031,12.481"
    },
    {
      "name": "Centrale Montemartini",
      "coord": [
        41.8719,
        12.5028
      ],
      "desc": "Unique museum in former power plant",
      "longDesc": "Marvel at classical sculptures amid industrial machinery. One of Rome's most evocative and least crowded museums Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Centrale%20Montemartini&center=41.8719,12.5028"
    },
    {
      "name": "Testaccio Market",
      "coord": [
        41.8727,
        12.4778
      ],
      "desc": "Historic market with authentic Roman food",
      "longDesc": "Hunt for fresh produce and street food. Try legendary pizza at Casa Manco, stewed tripe at Mordi e Vai, and regional specialties.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Testaccio%20Market&center=41.8727,12.4778"
    },
    {
      "name": "Campo de' Fiori Market",
      "coord": [
        41.8975,
        12.4721
      ],
      "desc": "Morning flower and produce market",
      "longDesc": "Arrive early to browse flowers, vegetables, and local goods. Historic square transforms into lively bar scene by evening Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Campo%20de%27%20Fiori%20Market&center=41.8975,12.4721"
    },
    {
      "name": "Almost Corner Bookshop",
      "coord": [
        41.8944,
        12.4705
      ],
      "desc": "Almost Corner Bookshop - distinctive Italian destination",
      "longDesc": "Discover hidden gem filled with used and new books. Cozy spot tucked around a corner, beloved by locals and travelers.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Almost%20Corner%20Bookshop&center=41.8944,12.4705"
    },
    {
      "name": "Botanical Garden of Rome",
      "coord": [
        41.8832,
        12.4617
      ],
      "desc": "Peaceful gardens on Trastevere hillside",
      "longDesc": "Escape crowds in this serene oasis. Explore Mediterranean plants, tropical greenhouses, and views over Rome's rooftops Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Botanical%20Garden%20of%20Rome&center=41.8832,12.4617"
    },
    {
      "name": "Ostia Antica",
      "coord": [
        41.7319,
        12.2976
      ],
      "desc": "Ancient Roman port city ruins - authentic Italian experience",
      "longDesc": "Wander well-preserved streets and buildings from the 2nd century. Discover mosaics, amphitheater, and apartments of ancient traders Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ostia%20Antica&center=41.7319,12.2976"
    },
    {
      "name": "Non-Catholic Cemetery",
      "coord": [
        41.868,
        12.4866
      ],
      "desc": "Non-Catholic Cemetery - distinctive Italian destination",
      "longDesc": "Visit resting place of Keats and Shelley among tombs of notable figures. Serene spot with marble monuments and tree-shaded paths.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Non-Catholic%20Cemetery&center=41.868,12.4866"
    },
    {
      "name": "Gianicolo Belvedere",
      "coord": [
        41.8993,
        12.4566
      ],
      "desc": "Gianicolo Belvedere - distinctive Italian destination",
      "longDesc": "Climb to Rome's most elevated point. Enjoy 360-degree vistas of domes, monuments, and the Campagna Romana countryside Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gianicolo%20Belvedere&center=41.8993,12.4566"
    },
    {
      "name": "Villa Doria Pamphili",
      "coord": [
        41.8956,
        12.4443
      ],
      "desc": "Villa Doria Pamphili - distinctive Italian destination",
      "longDesc": "Bike, jog, or stroll through 184 acres. Visit the baroque casino (small palace), pine groves, and lake in this aristocratic garden.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Doria%20Pamphili&center=41.8956,12.4443"
    },
    {
      "name": "Uffizi Gallery",
      "coord": [
        43.7677,
        11.2553
      ],
      "desc": "Uffizi Gallery - distinctive Italian destination",
      "longDesc": "Experience Botticelli's Birth of Venus, Caravaggio masterpieces, and masterworks spanning Renaissance to Baroque periods in awe-inspiring galleries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Uffizi%20Gallery&center=43.7677,11.2553"
    },
    {
      "name": "Duomo of Florence",
      "coord": [
        43.7731,
        11.256
      ],
      "desc": "Duomo of Florence - distinctive Italian destination",
      "longDesc": "Climb the iconic terracotta dome for breathtaking views. Admire geometric marble facade and Ghiberti's bronze doors below Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Duomo%20of%20Florence&center=43.7731,11.256"
    },
    {
      "name": "Ponte Vecchio",
      "coord": [
        43.768,
        11.2531
      ],
      "desc": "Ponte Vecchio - distinctive Italian destination",
      "longDesc": "Walk across Florence's oldest bridge built in 1345. Browse jewelry shops, watch artisans at work, and view Arno below at sunset.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ponte%20Vecchio&center=43.768,11.2531"
    },
    {
      "name": "Piazzale Michelangelo",
      "coord": [
        43.7629,
        11.265
      ],
      "desc": "Piazzale Michelangelo - distinctive Italian destination",
      "longDesc": "Ascend to this terrace overlooking Florence's entire skyline. Watch sunset paint the domes and Arno valley in golden light Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Piazzale%20Michelangelo&center=43.7629,11.265"
    },
    {
      "name": "Accademia Gallery",
      "coord": [
        43.7761,
        11.2603
      ],
      "desc": "Accademia Gallery - distinctive Italian destination",
      "longDesc": "Stand in awe before David, the greatest Renaissance sculpture. View Michelangelo's unfinished Prisoners and Madonna and Child altar Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Accademia%20Gallery&center=43.7761,11.2603"
    },
    {
      "name": "Bargello Museum",
      "coord": [
        43.7703,
        11.2666
      ],
      "desc": "Renaissance sculpture and decorative arts museum",
      "longDesc": "Explore Donatello bronzes, Michelangelo marbles, and Renaissance medals in this medieval palazzo with spectacular interior courtyard Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bargello%20Museum&center=43.7703,11.2666"
    },
    {
      "name": "Palazzo Pitti & Boboli Gardens",
      "coord": [
        43.7641,
        11.2494
      ],
      "desc": "Medici palace with panoramic hillside gardens",
      "longDesc": "Tour sumptuous Medici apartments then stroll Boboli's Renaissance gardens with fountains, grottos, and city vistas from hilltop Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Palazzo%20Pitti%20%26%20Boboli%20Gardens&center=43.7641,11.2494"
    },
    {
      "name": "Basilica of Santa Maria Novella",
      "coord": [
        43.7763,
        11.2442
      ],
      "desc": "Basilica of Santa Maria Novella - distinctive Italian destination",
      "longDesc": "Marvel at Masaccio's Trinity fresco and Ghirlandaio's altar scenes. Explore cloisters and pharmacy where Dominican friars mixed medicines Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Basilica%20of%20Santa%20Maria%20Novella&center=43.7763,11.2442"
    },
    {
      "name": "San Marco Basilica",
      "coord": [
        45.4345,
        12.3389
      ],
      "desc": "San Marco Basilica - distinctive Italian destination",
      "longDesc": "Enter this masterpiece of Eastern and Western art. Ascend the loggia for piazza views, explore treasury of relics and silver altarpieces.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=San%20Marco%20Basilica&center=45.4345,12.3389"
    },
    {
      "name": "Doge's Palace",
      "coord": [
        45.4352,
        12.3406
      ],
      "desc": "Venetian Gothic palace and government seat",
      "longDesc": "Tour ornate chambers where doges ruled. Descend to sinister cells via Bridge of Sighs, view Tintoretto's vast canvases Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Doge%27s%20Palace&center=45.4352,12.3406"
    },
    {
      "name": "Rialto Bridge",
      "coord": [
        45.4381,
        12.336
      ],
      "desc": "Rialto Bridge - distinctive Italian destination",
      "longDesc": "Stroll this marvel of Renaissance engineering lined with shops. Enjoy grand views of gondolas and palaces from the central arch.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rialto%20Bridge&center=45.4381,12.336"
    },
    {
      "name": "Grand Canal Gondola Ride",
      "coord": [
        45.4357,
        12.3358
      ],
      "desc": "Historic waterway tour by traditional boat",
      "longDesc": "Glide beneath ornate palaces on Venice's main thoroughfare. Experience the city as medieval merchants did from a gondola's perspective Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Canal%20Gondola%20Ride&center=45.4357,12.3358"
    },
    {
      "name": "Gallerie dell'Accademia",
      "coord": [
        45.4311,
        12.3191
      ],
      "desc": "Venetian Renaissance art museum",
      "longDesc": "View masterpieces by Bellini, Titian, and Tintoretto. Trace development of Venetian painting from Byzantine to Renaissance periods Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gallerie%20dell%27Accademia&center=45.4311,12.3191"
    },
    {
      "name": "Murano Glass Island",
      "coord": [
        45.458,
        12.353
      ],
      "desc": "Murano Glass Island - distinctive Italian destination",
      "longDesc": "Watch artisans craft glass in blazing furnaces. Browse galleries of vibrant vessels and chandeliers produced for centuries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Murano%20Glass%20Island&center=45.458,12.353"
    },
    {
      "name": "Burano Lace Island",
      "coord": [
        45.4853,
        12.417
      ],
      "desc": "Colorful fishing village known for lace",
      "longDesc": "Stroll streets painted in brilliant colors where lacemakers display intricate handiwork. Enjoy fresh seafood by picture-perfect lagoon Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Burano%20Lace%20Island&center=45.4853,12.417"
    },
    {
      "name": "Torcello Island",
      "coord": [
        45.4985,
        12.4002
      ],
      "desc": "Torcello Island - distinctive Italian destination",
      "longDesc": "Escape Venice's crowds on this peaceful island. Discover Santa Maria Assunta cathedral with stunning golden mosaic Last Judgement Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Torcello%20Island&center=45.4985,12.4002"
    },
    {
      "name": "Pompeii Archaeological Site",
      "coord": [
        40.751,
        14.4867
      ],
      "desc": "Pompeii Archaeological Site - distinctive Italian destination",
      "longDesc": "Walk streets frozen in 79 AD. Explore homes with mosaics, bakeries with loaves, and amphitheater. Contemplate lives halted by volcanic ash.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pompeii%20Archaeological%20Site&center=40.751,14.4867"
    },
    {
      "name": "Herculaneum",
      "coord": [
        40.8059,
        14.3534
      ],
      "desc": "Ancient town with better-preserved buildings",
      "longDesc": "Discover wooden beams, furniture, and organic materials preserved by volcanic mud. Less crowded than Pompeii, equally evocative Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Herculaneum&center=40.8059,14.3534"
    },
    {
      "name": "Naples National Museum",
      "coord": [
        40.8545,
        14.2443
      ],
      "desc": "Naples National Museum - distinctive Italian destination",
      "longDesc": "View extraordinary mosaics from Pompeian houses, Alexander mosaic masterpiece, and the Secret Cabinet's erotic art collection Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Naples%20National%20Museum&center=40.8545,14.2443"
    },
    {
      "name": "Polignano a Mare Hidden Cove",
      "coord": [
        41.0215,
        17.1987
      ],
      "desc": "Dramatic clifftop town with hidden beach",
      "longDesc": "Climb down rocky paths to secluded swimming spots. Return uphill for sunset pasta overlooking limestone cliffs and Adriatic Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Polignano%20a%20Mare%20Hidden%20Cove&center=41.0215,17.1987"
    },
    {
      "name": "Amalfi Coast Drive",
      "coord": [
        40.6333,
        14.6
      ],
      "desc": "Amalfi Coast Drive - distinctive Italian destination",
      "longDesc": "Traverse cliff-hugging roads with vertiginous drops. Stop at Positano's pastel villages, Ravello's hilltop gardens, and hidden beaches Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Amalfi%20Coast%20Drive&center=40.6333,14.6"
    },
    {
      "name": "Positano Beach Town",
      "coord": [
        40.6263,
        14.4829
      ],
      "desc": "Elegant vertical town on turquoise coast",
      "longDesc": "Descend to pebble beaches and waterfront restaurants. Browse designer boutiques clinging to cliffsides in this Riviera favorite Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Positano%20Beach%20Town&center=40.6263,14.4829"
    },
    {
      "name": "Siena Cathedral",
      "coord": [
        43.3183,
        11.3319
      ],
      "desc": "Siena Cathedral - distinctive Italian destination",
      "longDesc": "Marvel at dramatic black and white striped cathedral. Climb bell tower for Tuscan countryside vistas or explore intricate floor mosaics.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Siena%20Cathedral&center=43.3183,11.3319"
    },
    {
      "name": "Piazza del Campo",
      "coord": [
        43.3183,
        11.3327
      ],
      "desc": "Piazza del Campo - distinctive Italian destination",
      "longDesc": "Experience one of Italy's most beautiful squares. Watch il Palio horse race biannually or relax with gelato watching Sienese life.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Piazza%20del%20Campo&center=43.3183,11.3327"
    },
    {
      "name": "San Gimignano Medieval Town",
      "coord": [
        43.4675,
        11.9422
      ],
      "desc": "Hill town with soaring medieval towers",
      "longDesc": "Walk into the 13th century among 14 stone towers. Wander narrow lanes, taste local Vernaccia wine, and enjoy valley panoramas.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=San%20Gimignano%20Medieval%20Town&center=43.4675,11.9422"
    },
    {
      "name": "Pienza Renaissance Town",
      "coord": [
        43.1343,
        11.746
      ],
      "desc": "Perfectly planned Renaissance village",
      "longDesc": "Stroll the harmonious Piazza Pio II designed as urban ideal. Taste pecorino cheese and Brunello wine in this hilltop masterpiece.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pienza%20Renaissance%20Town&center=43.1343,11.746"
    },
    {
      "name": "Chianti Wine Region",
      "coord": [
        43.41,
        11.71
      ],
      "desc": "Chianti Wine Region - distinctive Italian destination",
      "longDesc": "Drive scenic routes through terraced vineyards. Stop at family-run wineries for tastings, olive oil samples, and alfresco lunches Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chianti%20Wine%20Region&center=43.41,11.71"
    },
    {
      "name": "Ca'Marcanda Winery",
      "coord": [
        43.229,
        10.6233
      ],
      "desc": "Ca'Marcanda Winery - distinctive Italian destination",
      "longDesc": "Visit Angelo Gaja's estate for Cabernet blend tasting. Explore cypress-lined roads, museum, and restaurant amid Tuscan elegance Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ca%27Marcanda%20Winery&center=43.229,10.6233"
    },
    {
      "name": "Brunello di Montalcino Winery",
      "coord": [
        43.0996,
        11.8432
      ],
      "desc": "Brunello di Montalcino Winery - distinctive Italian destination",
      "longDesc": "Tour barrel rooms aging Brunello wines. Learn about Tuscan viticulture, taste complex wines, and enjoy hilltop views Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Brunello%20di%20Montalcino%20Winery&center=43.0996,11.8432"
    },
    {
      "name": "Orcia Valley",
      "coord": [
        43.14,
        11.89
      ],
      "desc": "Orcia Valley - distinctive Italian destination",
      "longDesc": "Photograph the famous lone cypress and rolling hills. Hike among terra-cotta cliffs, visit thermal springs, and explore hill towns Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Orcia%20Valley&center=43.14,11.89"
    },
    {
      "name": "Montepulciano",
      "coord": [
        43.097,
        11.7878
      ],
      "desc": "Wine town with Renaissance palaces",
      "longDesc": "Climb steep main street lined with palazzo facades. Visit wine cellars, enjoy Vino Nobile tastings, and view Val d'Orcia below.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Montepulciano&center=43.097,11.7878"
    },
    {
      "name": "Dolomites (Tre Cime di Lavaredo)",
      "coord": [
        46.5963,
        12.0125
      ],
      "desc": "Dolomites (Tre Cime di Lavaredo) - distinctive Italian destination",
      "longDesc": "Hike beneath Italy's most iconic mountain trio. Marvel at geological formations shaped by ancient seas, stunning at sunrise and sunset.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dolomites%20%28Tre%20Cime%20di%20Lavaredo%29&center=46.5963,12.0125"
    },
    {
      "name": "Cortina d'Ampezzo",
      "coord": [
        46.537,
        12.136
      ],
      "desc": "Chic Alpine ski town and summer resort",
      "longDesc": "Explore elegant mountain village hosted 2026 Olympics. Hike scenic trails, dine at upscale restaurants, enjoy après-ski atmosphere Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cortina%20d%27Ampezzo&center=46.537,12.136"
    },
    {
      "name": "Lake Como",
      "coord": [
        45.989,
        9.265
      ],
      "desc": "Stunning Alpine lake with villas and villages",
      "longDesc": "Ferry between lakeside towns, visit Villa d'Este gardens, or hike surrounding mountains. Breathtaking in spring wildflowers and autumn colors Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lake%20Como&center=45.989,9.265"
    },
    {
      "name": "Bellagio",
      "coord": [
        45.9767,
        9.2606
      ],
      "desc": "Elegant town on Lake Como's promontory",
      "longDesc": "Wander waterfront promenade and steep village streets. Visit formal Villa Melzi gardens with lakeside views and sculptures Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bellagio&center=45.9767,9.2606"
    },
    {
      "name": "Lake Garda",
      "coord": [
        45.627,
        10.6545
      ],
      "desc": "Italy's largest lake with mountains and villages",
      "longDesc": "Sail or kayak turquoise waters surrounded by cliffs. Visit medieval towns, lemon groves, and olive oil producers along the shore.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lake%20Garda&center=45.627,10.6545"
    },
    {
      "name": "Cinque Terre",
      "coord": [
        44.1275,
        9.7095
      ],
      "desc": "Five connected villages on Ligurian coast",
      "longDesc": "Hike dramatic cliffside trails between villages. Swim in coves, taste pesto and anchovies, watch sunset from Vernazza's harbor Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cinque%20Terre&center=44.1275,9.7095"
    },
    {
      "name": "Manarola to Riomaggiore Coastal Path",
      "coord": [
        44.1318,
        9.7219
      ],
      "desc": "Manarola to Riomaggiore Coastal Path - distinctive Italian destination",
      "longDesc": "Stroll the most picturesque stretch on restored trail. Stop for gelato, swim in emerald cove, photograph colorful boats Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Manarola%20to%20Riomaggiore%20Coastal%20Path&center=44.1318,9.7219"
    },
    {
      "name": "Milan Cathedral",
      "coord": [
        45.4642,
        9.192
      ],
      "desc": "Milan Cathedral - distinctive Italian destination",
      "longDesc": "Ascend to vast roof covered in marble spires and sculptures. Gaze across Milan while standing near cathedral's soaring pinnacles Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Milan%20Cathedral&center=45.4642,9.192"
    },
    {
      "name": "Pinacoteca di Brera",
      "coord": [
        45.4711,
        9.1994
      ],
      "desc": "Milan's finest art museum - authentic Italian experience",
      "longDesc": "View Caravaggio paintings, Venetian masterpieces, and contemporary works in elegant neoclassical palazzo. Quieter than major Florence museums Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pinacoteca%20di%20Brera&center=45.4711,9.1994"
    },
    {
      "name": "Verona Roman Amphitheater",
      "coord": [
        45.4408,
        10.991
      ],
      "desc": "Verona Roman Amphitheater - distinctive Italian destination",
      "longDesc": "Experience performances in ancient amphitheater under stars. Or tour the structure and imagine gladiator combats in this preserved arena Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Verona%20Roman%20Amphitheater&center=45.4408,10.991"
    },
    {
      "name": "Ravello",
      "coord": [
        40.6297,
        14.6089
      ],
      "desc": "Hilltop village overlooking Amalfi Coast",
      "longDesc": "Explore terraced gardens and medieval churches. Visit Villa Rufolo and Villa Cimbrone with jaw-dropping coastal panoramas Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ravello&center=40.6297,14.6089"
    },
    {
      "name": "Matera Sassi",
      "coord": [
        40.666,
        16.604
      ],
      "desc": "Matera Sassi - distinctive Italian destination",
      "longDesc": "Wander through Matera's otherworldly Sassi district. Explore cave homes, churches, and passageways carved into stone for millennia Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Matera%20Sassi&center=40.666,16.604"
    },
    {
      "name": "Alberobello Trulli Houses",
      "coord": [
        40.785,
        17.236
      ],
      "desc": "Alberobello Trulli Houses - distinctive Italian destination",
      "longDesc": "Walk streets lined with distinctive trulli houses with conical roofs. Tour house museums, visit shops selling local crafts and foods.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Alberobello%20Trulli%20Houses&center=40.785,17.236"
    },
    {
      "name": "Barcolana Sailing Regatta",
      "coord": [
        45.6566,
        13.7773
      ],
      "desc": "Barcolana Sailing Regatta - distinctive Italian destination",
      "longDesc": "Watch 1,000+ boats race across Gulf of Trieste. Experience maritime tradition, local culture, and spectacular water competition from shore Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Barcolana%20Sailing%20Regatta&center=45.6566,13.7773"
    },
    {
      "name": "Trieste Grand Canal Walk",
      "coord": [
        45.6462,
        13.7821
      ],
      "desc": "Elegant waterfront promenade - authentic Italian experience",
      "longDesc": "Stroll Austro-Hungarian architecture along Canal Grande. Visit Neoclassical buildings, harbor views, and historic coffee houses Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Trieste%20Grand%20Canal%20Walk&center=45.6462,13.7821"
    },
    {
      "name": "Orta San Giulio",
      "coord": [
        45.8232,
        8.3943
      ],
      "desc": "Pedestrian island village on Lake Orta",
      "longDesc": "Visit this car-free gem with island San Giulio. Climb to basilica, explore narrow lanes, and relax in intimate piazza cafes.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Orta%20San%20Giulio&center=45.8232,8.3943"
    },
    {
      "name": "Camogli",
      "coord": [
        44.3462,
        9.1601
      ],
      "desc": "Colorful fishing village on Liguria coast",
      "longDesc": "Photograph pastel buildings reflected in harbor. Enjoy fresh seafood, swim in cove, and watch golden hour light paint facades Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Camogli&center=44.3462,9.1601"
    },
    {
      "name": "Dozza Murals Village",
      "coord": [
        44.3594,
        11.6289
      ],
      "desc": "Medieval town covered in street art",
      "longDesc": "Discover artistic murals throughout medieval streets. Browse artist studios, visit local galleries, and enjoy Emilia-Romagna wine region Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dozza%20Murals%20Village&center=44.3594,11.6289"
    },
    {
      "name": "Riomaggiore Waterfront",
      "coord": [
        44.1263,
        9.7283
      ],
      "desc": "Colorful village clinging to steep cliffs",
      "longDesc": "Watch dramatic waves crash against buildings. Swim in turquoise waters, dine seaside, and photograph iconic Cinque Terre scenery Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Riomaggiore%20Waterfront&center=44.1263,9.7283"
    },
    {
      "name": "Polvere di Tempo",
      "coord": [
        41.8984,
        12.4748
      ],
      "desc": "Quirky artisan shop of unique treasures",
      "longDesc": "Discover eclectic collection of vintage items, restored furniture, and curious objects. Hidden gem in Trastevere's creative heart Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Polvere%20di%20Tempo&center=41.8984,12.4748"
    },
    {
      "name": "Amalfi Coast boat day (short cruise)",
      "coord": [
        40.634,
        14.602
      ],
      "desc": "Immersive cultural experience showcasing Italy's artistic heritage and timeless ",
      "longDesc": "Immersive cultural experience showcasing Italy's artistic heritage and timeless traditions.",
      "city": "Amalfi Coast",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Amalfi%20Coast%20boat%20day%20%28short%20cruise%29&center=40.634,14.602"
    },
    {
      "name": "Mount Etna ‘volcano day’ (guided, choose easy options)",
      "coord": [
        42.5,
        12.5
      ],
      "desc": "Immersive cultural experience showcasing Italy's artistic heritage and timeless ",
      "longDesc": "Discover this experience gem offering a unique perspective on Mount Etna ‘volcano day’ (guided, choose easy options) culture and cuisine in an authentic setting.",
      "city": "Sicily",
      "region": "Etna",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mount%20Etna%20%E2%80%98volcano%20day%E2%80%99%20%28guided%2C%20choose%20easy%20options%29&center=42.5,12.5"
    },
    {
      "name": "Appian Way + Catacombs Tour",
      "coord": [
        41.903,
        12.496
      ],
      "city": "Rome",
      "desc": "Ancient Roman road with underground Christian catacombs",
      "longDesc": "Walk the historic Appian Way, lined with ancient tombs, then explore intricate underground catacombs sacred to early Christians.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Appian%20Way%20%2B%20Catacombs%20Tour&center=41.903,12.496"
    },
    {
      "name": "Fondazione Prada",
      "coord": [
        45.464,
        9.19
      ],
      "city": "Milan",
      "desc": "Contemporary art museum in converted distillery",
      "longDesc": "Cutting-edge contemporary art foundation housed in beautifully restored 1910s Milanese industrial architecture and courtyards.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Fondazione%20Prada&center=45.464,9.19"
    },
    {
      "name": "Peggy Guggenheim Collection",
      "coord": [
        45.441,
        12.316
      ],
      "city": "Venice",
      "desc": "World-class modern art museum on Grand Canal",
      "longDesc": "Prestigious modern art collection in a Venetian palazzo featuring works by Picasso, Kandinsky, and other 20th-century masters.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Peggy%20Guggenheim%20Collection&center=45.441,12.316"
    },
    {
      "name": "Path of the Gods",
      "coord": [
        40.64,
        14.55
      ],
      "city": "Ravello",
      "region": "Amalfi Coast",
      "desc": "Scenic coastal hiking trail between Praiano and Positano",
      "longDesc": "One of Europe's most spectacular coastal hikes offering dramatic Mediterranean vistas, steep cliffs, and charming villages.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Path%20of%20the%20Gods&center=40.64,14.55"
    },
    {
      "name": "Mount Etna Excursion",
      "coord": [
        37.751,
        15.004
      ],
      "city": "Catania",
      "region": "Sicily",
      "desc": "Europe's largest active volcano with guided summit tour",
      "longDesc": "Thrilling experience exploring Europe's most active volcano with dramatic volcanic landscapes and breathtaking panoramic views.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mount%20Etna%20Excursion&center=37.751,15.004"
    },
    {
      "name": "Naples Underground Tour",
      "coord": [
        40.852,
        14.268
      ],
      "city": "Naples",
      "desc": "Ancient Roman tunnels and quarries beneath the city",
      "longDesc": "Fascinating exploration of subterranean Naples revealing Greek and Roman history, aqueducts, and Greek theater carved in rock.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Naples%20Underground%20Tour&center=40.852,14.268"
    },
    {
      "name": "Navigli Aperitivo Experience",
      "coord": [
        45.464,
        9.19
      ],
      "city": "Milan",
      "desc": "Historic canal district with bars and evening aperitivo culture",
      "longDesc": "Milan's charming Navigli canal district with vibrant nightlife, trendy aperitivo bars, art galleries, and authentic local ambiance.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Navigli%20Aperitivo%20Experience&center=45.464,9.19"
    },
    {
      "name": "Chianti Wine Tour",
      "coord": [
        43.45,
        11.45
      ],
      "region": "Tuscany",
      "desc": "Visit Tuscan vineyards and taste world-class Chianti wine",
      "longDesc": "Explore rolling Tuscan hills dotted with legendary vineyards, wine cellars, and tastings of exceptional Chianti wines.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Chianti%20Wine%20Tour&center=43.45,11.45"
    },
    {
      "name": "Cooking Class Tuscany",
      "coord": [
        43.45,
        11.45
      ],
      "region": "Tuscany",
      "desc": "Hands-on Italian cooking class with farm-fresh ingredients",
      "longDesc": "Immersive culinary experience learning traditional Tuscan cooking from expert chefs using seasonal local and organic ingredients.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cooking%20Class%20Tuscany&center=43.45,11.45"
    },
    {
      "name": "Gondola Ride Venice",
      "coord": [
        45.441,
        12.316
      ],
      "city": "Venice",
      "desc": "Iconic Venetian experience in traditional black gondolas",
      "longDesc": "Quintessential Venice experience gliding through romantic canals in traditional gondolas, past historic palaces and under ancient bridges.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gondola%20Ride%20Venice&center=45.441,12.316"
    },
    {
      "name": "Cicchetti Crawl Venice",
      "coord": [
        45.441,
        12.316
      ],
      "city": "Venice",
      "desc": "Walking food tour of Venetian small plates and wine bars",
      "longDesc": "Guided food tour through Venice's hidden cicchetti bars sampling traditional Venetian small plates and local wines.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cicchetti%20Crawl%20Venice&center=45.441,12.316"
    },
    {
      "name": "Bologna Food Crawl",
      "coord": [
        44.495,
        11.343
      ],
      "city": "Bologna",
      "desc": "Walking tour of historic squares and food specialties",
      "longDesc": "Culinary walking tour through medieval Bologna discovering the city's legendary food culture: tortellini, mortadella, and balsamic vinegar.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bologna%20Food%20Crawl&center=44.495,11.343"
    },
    {
      "name": "Climb Asinelli Tower",
      "coord": [
        44.495,
        11.343
      ],
      "city": "Bologna",
      "desc": "Historic medieval tower with panoramic city views",
      "longDesc": "Ascend Bologna's leaning medieval tower for spectacular 360-degree views over terracotta rooftops and Renaissance architecture.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Climb%20Asinelli%20Tower&center=44.495,11.343"
    },
    {
      "name": "Lecce Baroque Day Tour",
      "coord": [
        40.352,
        18.175
      ],
      "city": "Lecce",
      "region": "Puglia",
      "desc": "Explore UNESCO baroque architecture and piazzas",
      "longDesc": "Immerse yourself in the golden baroque splendor of Lecce's architectural masterpieces, ornate churches, and elegant Renaissance squares.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lecce%20Baroque%20Day%20Tour&center=40.352,18.175"
    },
    {
      "name": "Matera Cave Exploration",
      "coord": [
        40.666,
        16.604
      ],
      "city": "Matera",
      "desc": "Ancient cave dwellings carved into limestone ravine",
      "longDesc": "Explore the haunting beauty of Matera's ancient Sassi district featuring ancient cave dwellings, churches, and timeless Mediterranean charm.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Matera%20Cave%20Exploration&center=40.666,16.604"
    },
    {
      "name": "Modena Balsamic Vinegar Tour",
      "coord": [
        44.647,
        10.925
      ],
      "city": "Modena",
      "desc": "Tour of traditional balsamic vinegar production atelier",
      "longDesc": "Visit a historic balsamic vinegar atelier learning centuries-old production methods and tasting exceptional aged balsamics.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Modena%20Balsamic%20Vinegar%20Tour&center=44.647,10.925"
    },
    {
      "name": "Noto Baroque Towns",
      "coord": [
        36.89,
        15.069
      ],
      "city": "Noto",
      "region": "Sicily",
      "desc": "UNESCO baroque towns with honey-colored limestone buildings",
      "longDesc": "Stunning baroque towns built in warm honey-hued limestone after 1693 earthquake, featuring magnificent architecture and piazzas.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Noto%20Baroque%20Towns&center=36.89,15.069"
    },
    {
      "name": "Ostuni White City",
      "coord": [
        40.73,
        17.578
      ],
      "city": "Ostuni",
      "region": "Puglia",
      "desc": "Whitewashed medieval town perched on Adriatic bluffs",
      "longDesc": "Enchanting whitewashed hilltop town with cascading staircases, blue-door cottages, and views over Puglia's crystalline Adriatic Sea.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ostuni%20White%20City&center=40.73,17.578"
    },
    {
      "name": "Palermo Street Food Tour",
      "coord": [
        38.116,
        13.362
      ],
      "city": "Palermo",
      "desc": "Authentic Sicilian street food in historic markets",
      "longDesc": "Vibrant walking tour through Palermo's legendary street food markets sampling arancini, pasta con le sarde, and panelle.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Palermo%20Street%20Food%20Tour&center=38.116,13.362"
    },
    {
      "name": "Sardinia Beaches Experience",
      "coord": [
        39.224,
        9.122
      ],
      "region": "Sardinia",
      "desc": "Pristine Mediterranean beaches with turquoise waters",
      "longDesc": "Explore Sardinia's paradisiacal beaches featuring crystal-clear turquoise waters, white sand, and dramatic granite rock formations.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sardinia%20Beaches%20Experience&center=39.224,9.122"
    },
    {
      "name": "Cinque Terre Coastal Walk",
      "coord": [
        44.128,
        9.71
      ],
      "region": "Cinque Terre",
      "desc": "Scenic hiking between five cliffside villages",
      "longDesc": "Iconic coastal trek connecting five colorful cliff-hanging villages, offering dramatic sea vistas and charming Mediterranean culture.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Cinque%20Terre%20Coastal%20Walk&center=44.128,9.71"
    },
    {
      "name": "Sellaronda Ski Loop",
      "coord": [
        46.558,
        11.757
      ],
      "region": "Dolomites",
      "desc": "Famous ski circuit in Dolomites with multiple ski areas",
      "longDesc": "World-renowned ski circuit linking four ski areas with stunning Dolomite scenery, challenging runs, and scenic alpine villages.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Sellaronda%20Ski%20Loop&center=46.558,11.757"
    },
    {
      "name": "Favignana Island Exploration",
      "coord": [
        37.932,
        12.33
      ],
      "city": "Favignana",
      "region": "Egadi Islands",
      "desc": "Beautiful island with beaches, tuna history, and caves",
      "longDesc": "Charming Sicilian island featuring pristine beaches, ancient Greek caves, fascinating tuna-fishing heritage, and turquoise Mediterranean waters.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Favignana%20Island%20Exploration&center=37.932,12.33"
    },
    {
      "name": "Ischia Thermal Day Trip",
      "coord": [
        40.73,
        13.896
      ],
      "city": "Ischia",
      "region": "Campania",
      "desc": "Island with natural hot springs and volcanic beaches",
      "longDesc": "Bay of Naples island famous for natural thermal springs, volcanic lava sand beaches, and relaxing spa and wellness experiences.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ischia%20Thermal%20Day%20Trip&center=40.73,13.896"
    },
    {
      "name": "Hidden Swimming Spot Polignano",
      "coord": [
        41.0,
        17.22
      ],
      "city": "Polignano a Mare",
      "region": "Puglia",
      "desc": "Secret coves with crystal-clear Adriatic waters",
      "longDesc": "Discover hidden coves and swimming spots nestled beneath dramatic white limestone cliffs with pristine Adriatic Mediterranean waters.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Hidden%20Swimming%20Spot%20Polignano&center=41.0,17.22"
    },
    {
      "name": "Ortigia Syracuse",
      "coord": [
        37.06,
        15.293
      ],
      "city": "Syracuse",
      "region": "Sicily",
      "desc": "Ancient island with Greek temples and baroque architecture",
      "longDesc": "Enchanting island district housing Greek temple ruins, baroque piazzas, historic cathedral, and seafront promenade with Mediterranean charm.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ortigia%20Syracuse&center=37.06,15.293"
    },
    {
      "name": "Historic Naples Walking Loop",
      "coord": [
        40.852,
        14.268
      ],
      "city": "Naples",
      "desc": "Walking tour of historic center, churches, and royal palace",
      "longDesc": "Comprehensive walking tour of Naples' historic center featuring royal palaces, stunning churches, vibrant piazzas, and authentic street life.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Historic%20Naples%20Walking%20Loop&center=40.852,14.268"
    }
  ],
  "kidFriendly": [
    {
      "name": "Explora Children's Museum",
      "coord": [
        41.909,
        12.495
      ],
      "desc": "Rome's interactive children's museum with hands-on exhibits for ages 0-12",
      "longDesc": "Explora offers imaginative, hands-on exhibits designed for toddlers through tweens. A perfect indoor activity for rainy days or afternoon resets in the city.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Explora%20Children%27s%20Museum&center=41.909,12.495"
    },
    {
      "name": "Villa Borghese",
      "coord": [
        41.914,
        12.49
      ],
      "desc": "Villa Borghese - distinctive Italian destination",
      "longDesc": "Vast green space perfect for picnics, rental boats on the lake, playgrounds, and art museums. An essential outdoor reset day in central Rome.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Villa%20Borghese&center=41.914,12.49"
    },
    {
      "name": "Bioparco di Roma",
      "coord": [
        41.917,
        12.485
      ],
      "desc": "Rome's zoo nestled within Villa Borghese gardens and grounds",
      "longDesc": "Classic zoo with exotic animals and well-maintained enclosures within beautiful Villa Borghese gardens. Perfect for younger children Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Bioparco%20di%20Roma&center=41.917,12.485"
    },
    {
      "name": "Casina di Raffaello",
      "coord": [
        41.92,
        12.488
      ],
      "desc": "Casina di Raffaello - distinctive Italian destination",
      "longDesc": "Creative indoor play space offering arts, crafts, and reading activities. Ideal for young kids on rainy days, located near the zoo and gardens.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Casina%20di%20Raffaello&center=41.92,12.488"
    },
    {
      "name": "Vatican Kids Treasure Hunt Tour",
      "coord": [
        41.906,
        12.457
      ],
      "desc": "Vatican gamified tour that transforms museums into interactive adventures",
      "longDesc": "Family-friendly Vatican tours transforming museums into exciting treasure hunts. Perfect for ages 6-12 to explore art and history playfully Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Vatican%20Kids%20Treasure%20Hunt%20Tour&center=41.906,12.457"
    },
    {
      "name": "Catacombs of St. Domitilla",
      "coord": [
        41.881,
        12.503
      ],
      "desc": "Ancient Roman catacombs offering fascinating historical exploration for older...",
      "longDesc": "Underground early Christian burial tunnels that captivate kids with history and mystery. Well-lit, guided tours make it engaging without being frightening.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Catacombs%20of%20St.%20Domitilla&center=41.881,12.503"
    },
    {
      "name": "Pizza-Making Experience",
      "coord": [
        41.895,
        12.475
      ],
      "desc": "Hands-on Roman cooking class teaching authentic pizza preparation",
      "longDesc": "Kids knead dough, top pizzas, and bake their creations in a wood-fired oven. A delicious, interactive way to learn Italian food culture authentically.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pizza-Making%20Experience&center=41.895,12.475"
    },
    {
      "name": "Gelato Tasting Crawl",
      "coord": [
        41.9,
        12.48
      ],
      "desc": "Multi-stop gelato tour exploring Rome's best artisanal gelato shops",
      "longDesc": "Walking tour sampling premium gelato shops across Rome. Kids explore flavors, learn gelato-making secrets, enjoy sweet rewards Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gelato%20Tasting%20Crawl&center=41.9,12.48"
    },
    {
      "name": "Grand Canal Vaporetto Ride",
      "coord": [
        45.441,
        12.316
      ],
      "desc": "Grand Canal Vaporetto Ride - distinctive Italian destination",
      "longDesc": "Magical boat ride along Venice's main waterway. Kids sit back while palaces, bridges, and gondolas drift past—pure enchantment for families.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Grand%20Canal%20Vaporetto%20Ride&center=45.441,12.316"
    },
    {
      "name": "Rialto Market Visit",
      "coord": [
        45.44,
        12.335
      ],
      "desc": "Venice's bustling historic market with colorful produce and seafood stalls",
      "longDesc": "Morning market visit overflowing with fresh fish, produce, and local vendors. Kids discover authentic Venetian life and vibrant market energy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rialto%20Market%20Visit&center=45.44,12.335"
    },
    {
      "name": "Mask-Decorating Workshop",
      "coord": [
        45.435,
        12.33
      ],
      "desc": "Mask-Decorating Workshop - distinctive Italian destination",
      "longDesc": "Kids paint and decorate traditional Venetian carnival masks in historic workshop. Tactile, creative memory-making experience in Venice Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mask-Decorating%20Workshop&center=45.435,12.33"
    },
    {
      "name": "Gondola Ride on Quiet Canals",
      "coord": [
        45.438,
        12.325
      ],
      "desc": "Gondola Ride on Quiet Canals - distinctive Italian destination",
      "longDesc": "Glide silently through narrow canals away from crowds. Quintessential Venice experience that transports kids to another century Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gondola%20Ride%20on%20Quiet%20Canals&center=45.438,12.325"
    },
    {
      "name": "Murano Glass-Making Class",
      "coord": [
        45.453,
        12.35
      ],
      "desc": "Murano Glass-Making Class - distinctive Italian destination",
      "longDesc": "Watch master glassblowers create pieces, then participate in ornament making. Older kids fascinated by craftsmanship and ancient techniques Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Murano%20Glass-Making%20Class&center=45.453,12.35"
    },
    {
      "name": "Peggy Guggenheim Collection Kids Workshops",
      "coord": [
        45.438,
        12.328
      ],
      "desc": "Sunday art workshops for families at Venice's modern art museum",
      "longDesc": "Age-appropriate art activities inspired by museum collections. Creative learning keeping kids engaged beyond typical gallery time Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Peggy%20Guggenheim%20Collection%20Kids%20Workshops&center=45.438,12.328"
    },
    {
      "name": "Museo Galileo",
      "coord": [
        43.768,
        11.257
      ],
      "desc": "Florence's interactive science museum with historic scientific instruments",
      "longDesc": "Hands-on science museum exploring telescopes, globes, scientific history. Perfect for curious minds aged eight and up Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Museo%20Galileo&center=43.768,11.257"
    },
    {
      "name": "Boboli Gardens",
      "coord": [
        43.764,
        11.25
      ],
      "desc": "Florence's sprawling palace gardens ideal for picnics and exploration",
      "longDesc": "Ancient Medici gardens with fountains, sculptures, and open spaces. Kids run around while adults enjoy Renaissance art in landscape form.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Boboli%20Gardens&center=43.764,11.25"
    },
    {
      "name": "Giardino Bardini Viewpoints",
      "coord": [
        43.761,
        11.262
      ],
      "desc": "Florence garden with stunning city views and varied terrain for exploration",
      "longDesc": "Historic garden with winding paths, ancient trees, panoramic Florence vistas. Peaceful alternative to crowded tourist sites Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Giardino%20Bardini%20Viewpoints&center=43.761,11.262"
    },
    {
      "name": "Family Cooking Class",
      "coord": [
        43.77,
        11.256
      ],
      "desc": "Florence kitchen classes teaching authentic Tuscan recipes",
      "longDesc": "Kids cook pasta, prepare sauces, taste Italian meals in traditional kitchen. Hands-on learning about Tuscan food culture Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Family%20Cooking%20Class&center=43.77,11.256"
    },
    {
      "name": "Gelato Plus Art Game",
      "coord": [
        43.772,
        11.255
      ],
      "desc": "Low-stress museum visits combined with gelato rewards",
      "longDesc": "Create a fun 'I Spy' art hunt through Florence's museums, then reward yourselves with gelato. Keeps kids engaged in galleries naturally.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Gelato%20Plus%20Art%20Game&center=43.772,11.255"
    },
    {
      "name": "Parco Sempione Playgrounds",
      "coord": [
        45.47,
        9.185
      ],
      "desc": "Parco Sempione Playgrounds - distinctive Italian destination",
      "longDesc": "Modern playgrounds, wide lawns, and monuments. A perfect place for kids to burn energy and families to picnic near the Duomo.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Parco%20Sempione%20Playgrounds&center=45.47,9.185"
    },
    {
      "name": "Duomo Rooftop Terraces",
      "coord": [
        45.464,
        9.192
      ],
      "desc": "Duomo Rooftop Terraces - distinctive Italian destination",
      "longDesc": "Climb Milan's cathedral rooftop for 360-degree city views. Kids enjoy ascent adventure and stunning panorama Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Duomo%20Rooftop%20Terraces&center=45.464,9.192"
    },
    {
      "name": "Leonardo da Vinci Science Museum",
      "coord": [
        45.465,
        9.188
      ],
      "desc": "Milan's comprehensive museum of science and technology exhibits",
      "longDesc": "Interactive displays featuring Leonardo's inventions and modern technology. Captivates curious minds from elementary through high school Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Leonardo%20da%20Vinci%20Science%20Museum&center=45.465,9.188"
    },
    {
      "name": "Lake Como Day Trip from Milan",
      "coord": [
        45.812,
        9.082
      ],
      "desc": "Scenic alpine lake with boats, charming villages, and gelato",
      "longDesc": "Easy train ride from Milan to picturesque lakeside towns. Kids enjoy boat rides, explore colorful villages, and enjoy Italian gelato tradition.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Lake%20Como%20Day%20Trip%20from%20Milan&center=45.812,9.082"
    },
    {
      "name": "L'Antica Pizzeria Da Michele",
      "coord": [
        40.855,
        14.27
      ],
      "desc": "Naples' legendary casual pizzeria famous for authentic wood-fired pizza",
      "longDesc": "No-frills Naples institution where kids watch skilled pizzaiolos craft perfect pies. Classic, delicious, authentically Neapolitan experience Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=L%27Antica%20Pizzeria%20Da%20Michele&center=40.855,14.27"
    },
    {
      "name": "Amalfi Coast Boat Excursion",
      "coord": [
        40.633,
        14.602
      ],
      "desc": "Amalfi Coast Boat Excursion - distinctive Italian destination",
      "longDesc": "Scenic boat cruise past dramatic cliffs and charming villages. Short enough for young travelers, magical for memories Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Amalfi%20Coast%20Boat%20Excursion&center=40.633,14.602"
    },
    {
      "name": "Mount Etna Guided Adventure",
      "coord": [
        37.735,
        15.004
      ],
      "desc": "Mount Etna Guided Adventure - distinctive Italian destination",
      "longDesc": "Age-appropriate Etna experiences from cable car to easy valley walks. Kids experience volcanic landscape and learn geology on active terrain.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mount%20Etna%20Guided%20Adventure&center=37.735,15.004"
    },
    {
      "name": "Dolomites Cable Cars and Walks",
      "coord": [
        46.537,
        12.136
      ],
      "desc": "Dolomites Cable Cars and Walks - distinctive Italian destination",
      "longDesc": "Scenic cable car rides followed by gentle valley walks. Older kids enjoy mountain scenery and alpine villages Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Dolomites%20Cable%20Cars%20and%20Walks&center=46.537,12.136"
    }
  ],
  "markets": [
    {
      "name": "Testaccio Market",
      "coord": [
        41.876,
        12.475
      ],
      "desc": "Rome's legendary neighborhood food market with vendors and local color",
      "longDesc": "Historic food market buzzing with local shoppers. Browse fresh produce, meats, cheeses, prepared foods. Essential Roman market atmosphere Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Testaccio%20Market&center=41.876,12.475"
    },
    {
      "name": "Campo de' Fiori",
      "coord": [
        41.896,
        12.472
      ],
      "desc": "Rome's iconic piazza market with flowers, produce, and daily energy",
      "longDesc": "Beloved public square market with vegetables, flowers, local vendors. Charming nightlife transforms piazza after market closes daily Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Campo%20de%27%20Fiori&center=41.896,12.472"
    },
    {
      "name": "Mercato Trionfale",
      "coord": [
        41.907,
        12.452
      ],
      "desc": "Rome's largest neighborhood market near Vatican with diverse offerings",
      "longDesc": "Bustling covered market offering fresh produce, meats, cheeses, and prepared foods. Less touristy than central markets, very authentic local experience.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20Trionfale&center=41.907,12.452"
    },
    {
      "name": "Forno Campo de' Fiori",
      "coord": [
        41.896,
        12.472
      ],
      "desc": "Forno Campo de' Fiori - distinctive Italian destination",
      "longDesc": "Iconic Roman bakery serving hot pizza by weight, fresh bread, pastries. Perfect for quick, delicious picnic fare Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Forno%20Campo%20de%27%20Fiori&center=41.896,12.472"
    },
    {
      "name": "Mercato di Campagna Amica",
      "coord": [
        41.886,
        12.495
      ],
      "desc": "Rome's farmers market near Circus Maximus with seasonal local produce",
      "longDesc": "Direct-from-farm market featuring seasonal Italian produce, honey, wines, artisanal foods. Weekends only, excellent for quality Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20di%20Campagna%20Amica&center=41.886,12.495"
    },
    {
      "name": "Mercato Centrale Florence",
      "coord": [
        43.776,
        11.253
      ],
      "desc": "Florence's covered food market hall with stalls and prepared food",
      "longDesc": "Historic market hall in iron structure housing fresh produce, meats, and food stalls. Upper floor offers excellent food court and wine bar.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20Centrale%20Florence&center=43.776,11.253"
    },
    {
      "name": "Da Nerbone",
      "coord": [
        43.776,
        11.254
      ],
      "desc": "Florence's market counter restaurant serving traditional Tuscan fare",
      "longDesc": "Standing-room-only trattoria inside Mercato Centrale. Locals eat shoulder-to-shoulder, authentic cheap eats, unforgettable market atmosphere Experience authentic Italian traditions and discover remarkable cultural heritage. Explore the exceptional character and regional distinction found throughout beautiful Italy.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Da%20Nerbone&center=43.776,11.254"
    },
    {
      "name": "Eataly Firenze",
      "coord": [
        43.773,
        11.26
      ],
      "desc": "Florence's premium Italian food emporium with restaurants and products",
      "longDesc": "Multi-level food temple showcasing artisanal Italian products, restaurants, demonstrations. Educational and delicious exploration of Italian food Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Eataly%20Firenze&center=43.773,11.26"
    },
    {
      "name": "Rialto Market Venice",
      "coord": [
        45.44,
        12.335
      ],
      "desc": "Venice's historic fish and produce market on the Grand Canal",
      "longDesc": "Ancient market famous for fresh fish and seasonal produce. Vibrant morning energy, picturesque canal setting, authentically Venetian Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rialto%20Market%20Venice&center=45.44,12.335"
    },
    {
      "name": "Ballarò Market Palermo",
      "coord": [
        38.112,
        13.36
      ],
      "desc": "Palermo's chaotic street food market with vendors and local energy",
      "longDesc": "Narrow streets packed with vendors shouting, selling street food, fresh produce. Pure sensory experience of Palermitan street life Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ballar%C3%B2%20Market%20Palermo&center=38.112,13.36"
    },
    {
      "name": "Vucciria Market Palermo",
      "coord": [
        38.118,
        13.366
      ],
      "desc": "Palermo's historic covered market with food vendors and local character",
      "longDesc": "Ancient covered market filled with fish stalls, produce vendors, traditional foods. Less touristy than Ballarò, deeply local atmosphere Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Vucciria%20Market%20Palermo&center=38.118,13.366"
    },
    {
      "name": "Pignasecca Market Naples",
      "coord": [
        40.858,
        14.267
      ],
      "desc": "Naples' historic neighborhood market with produce and local vendors",
      "longDesc": "Bustling covered market selling fresh produce, meats, prepared foods. Authentic Neapolitan neighborhood market experience daily Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Pignasecca%20Market%20Naples&center=40.858,14.267"
    },
    {
      "name": "Porta Nolana Seafood Market",
      "coord": [
        40.865,
        14.282
      ],
      "desc": "Naples' famous fishmongers market near historic Porto district",
      "longDesc": "Market dedicated to fresh seafood with rows of fishmongers. Impressive catch displays and authentic Neapolitan energy Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Porta%20Nolana%20Seafood%20Market&center=40.865,14.282"
    },
    {
      "name": "Mercato di Porta Palazzo Turin",
      "coord": [
        45.076,
        7.682
      ],
      "desc": "Turin's largest open-air market with produce and prepared foods",
      "longDesc": "Sprawling outdoor market offering fresh produce, meats, cheeses, prepared foods. Less crowded than southern, very local atmosphere Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20di%20Porta%20Palazzo%20Turin&center=45.076,7.682"
    },
    {
      "name": "Mercato Piazza Benefica Turin",
      "coord": [
        45.071,
        7.69
      ],
      "desc": "Turin's neighborhood market with artisanal products and local vendors",
      "longDesc": "Charming neighborhood market with smaller stalls and local producers. Coffee bars and locals create authentic Turin atmosphere Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20Piazza%20Benefica%20Turin&center=45.071,7.69"
    },
    {
      "name": "Mercato di Mezzo Bologna",
      "coord": [
        44.495,
        11.343
      ],
      "desc": "Bologna's historic covered market with produce and prepared foods",
      "longDesc": "Ancient market hall in city center selling fresh produce, meats, prepared foods. Heart of Bologna's food culture Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20di%20Mezzo%20Bologna&center=44.495,11.343"
    },
    {
      "name": "Mercato delle Erbe Bologna",
      "coord": [
        44.5,
        11.348
      ],
      "desc": "Bologna's covered vegetable market with seasonal local produce",
      "longDesc": "Historic market dedicated to fresh vegetables, herbs, seasonal Italian produce. Charming, less touristy than main market halls Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Mercato%20delle%20Erbe%20Bologna&center=44.5,11.348"
    },
    {
      "name": "San Lorenzo Market Florence",
      "coord": [
        43.776,
        11.254
      ],
      "desc": "Florence's famous leather market in historic basilica grounds",
      "longDesc": "Iconic outdoor market surrounding San Lorenzo church. Famous for leather goods and souvenirs with authentic Florentine flavor Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=San%20Lorenzo%20Market%20Florence&center=43.776,11.254"
    },
    {
      "name": "Ravenna Market",
      "coord": [
        44.414,
        12.2
      ],
      "desc": "Small historic market town with regional food and produce traditions",
      "longDesc": "Charming market in mosaic city featuring local Romagna produce and specialties. Quieter alternative to major Italian markets Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Ravenna%20Market&center=44.414,12.2"
    },
    {
      "name": "Capo Market Palermo",
      "coord": [
        38.12,
        13.365
      ],
      "desc": "Palermo's vibrant market street with street food and local vendors",
      "longDesc": "Open-air street market with energetic vendors selling produce, street food, local specialties. Sensory overload in best possible way Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly.",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Capo%20Market%20Palermo&center=38.12,13.365"
    },
    {
      "name": "Rialto Market morning visit",
      "coord": [
        45.441,
        12.316
      ],
      "desc": "Bustling marketplace offering authentic local produce, regional specialties, and",
      "longDesc": "Bustling marketplace offering authentic local produce, regional specialties, and traditional Italian goods.",
      "city": "Venice",
      "gmapsUrl": "https://www.google.com/maps/search/?api=1&query=Rialto%20Market%20morning%20visit&center=45.441,12.316"
    }
  ],
  "cityCenters": {
    "Rome": [
      41.9028,
      12.4964
    ],
    "Florence": [
      43.7696,
      11.2558
    ],
    "Venice": [
      45.4408,
      12.3155
    ],
    "Milan": [
      45.4642,
      9.19
    ],
    "Naples": [
      40.8518,
      14.2681
    ],
    "Bologna": [
      44.4949,
      11.3426
    ],
    "Siena": [
      43.3188,
      11.3308
    ],
    "Verona": [
      45.4384,
      10.9916
    ],
    "Positano": [
      40.6263,
      14.484
    ],
    "Ravello": [
      40.6491,
      14.6114
    ],
    "Capri": [
      40.5507,
      14.2224
    ],
    "Taormina": [
      37.8516,
      15.2854
    ],
    "Palermo": [
      38.1157,
      13.3615
    ],
    "Matera": [
      40.6664,
      16.6043
    ],
    "Lecce": [
      40.3516,
      18.175
    ],
    "Lake Como": [
      45.9885,
      9.265
    ],
    "Cortina": [
      46.5369,
      12.1357
    ],
    "Orvieto": [
      42.7185,
      12.1098
    ],
    "Sorrento": [
      40.6263,
      14.3759
    ],
    "Modena": [
      44.6471,
      10.9252
    ],
    "Alba": [
      44.7,
      8.035
    ],
    "Bressanone": [
      46.7152,
      11.656
    ]
  },
  "itineraryData": {
    "a": {
      "name": "Greatest Hits (7 Days)",
      "color": "#2563EB",
      "days": [
        {
          "day": 1,
          "title": "Rome Arrival & Colosseum",
          "items": [
            {
              "type": "info",
              "name": "Arrive in Rome"
            },
            {
              "name": "Colosseum",
              "coord": [
                41.8902,
                12.4922
              ],
              "desc": "Colosseum - distinctive Italian destination",
              "longDesc": "Marvel at Italy's most iconic monument. Explore ancient arena where gladiators fought, discover underground chambers and arena floor ruins Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "type": "info",
              "name": "Dinner in Trastevere"
            }
          ]
        },
        {
          "day": 2,
          "title": "Vatican & Pantheon",
          "items": [
            {
              "name": "Vatican Museums & Sistine Chapel",
              "coord": [
                41.9058,
                12.457
              ],
              "desc": "Vatican Museums & Sistine Chapel - distinctive Italian destination",
              "longDesc": "Ascend the papal staircase, walk through Renaissance galleries, and gaze at Michelangelo's iconic ceiling frescoes in the Sistine Chapel Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "name": "Pantheon",
              "coord": [
                41.8986,
                12.4769
              ],
              "desc": "Pantheon - distinctive Italian destination",
              "longDesc": "Step inside this 2,000-year-old masterpiece. Marvel at the oculus flooding light onto marble floors and Renaissance tombs within Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            },
            {
              "type": "info",
              "name": "Evening in Centro Storico"
            }
          ]
        },
        {
          "day": 3,
          "title": "Villa Borghese & Train to Florence",
          "items": [
            {
              "name": "Villa Borghese",
              "coord": [
                41.914,
                12.49
              ],
              "desc": "Villa Borghese - distinctive Italian destination",
              "longDesc": "Vast green space perfect for picnics, rental boats on the lake, playgrounds, and art museums. An essential outdoor reset day in central Rome."
            },
            {
              "name": "Testaccio Market",
              "coord": [
                41.876,
                12.475
              ],
              "desc": "Rome's legendary neighborhood food market with vendors and local color",
              "longDesc": "Historic food market buzzing with local shoppers. Browse fresh produce, meats, cheeses, prepared foods. Essential Roman market atmosphere Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            },
            {
              "type": "info",
              "name": "Train to Florence"
            }
          ]
        },
        {
          "day": 4,
          "title": "Florence Uffizi & Duomo",
          "items": [
            {
              "name": "Uffizi Gallery",
              "coord": [
                43.7677,
                11.2553
              ],
              "desc": "Uffizi Gallery - distinctive Italian destination",
              "longDesc": "Experience Botticelli's Birth of Venus, Caravaggio masterpieces, and masterworks spanning Renaissance to Baroque periods in awe-inspiring galleries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "name": "Duomo of Florence",
              "coord": [
                43.7731,
                11.256
              ],
              "desc": "Duomo of Florence - distinctive Italian destination",
              "longDesc": "Climb the iconic terracotta dome for breathtaking views. Admire geometric marble facade and Ghiberti's bronze doors below Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "name": "Ponte Vecchio",
              "coord": [
                43.768,
                11.2531
              ],
              "desc": "Ponte Vecchio - distinctive Italian destination",
              "longDesc": "Walk across Florence's oldest bridge built in 1345. Browse jewelry shops, watch artisans at work, and view Arno below at sunset."
            }
          ]
        },
        {
          "day": 5,
          "title": "Florence & Train to Venice",
          "items": [
            {
              "name": "Accademia Gallery",
              "coord": [
                43.7761,
                11.2603
              ],
              "desc": "Accademia Gallery - distinctive Italian destination",
              "longDesc": "Stand in awe before David, the greatest Renaissance sculpture. View Michelangelo's unfinished Prisoners and Madonna and Child altar Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            },
            {
              "name": "Piazzale Michelangelo",
              "coord": [
                43.7629,
                11.265
              ],
              "desc": "Piazzale Michelangelo - distinctive Italian destination",
              "longDesc": "Ascend to this terrace overlooking Florence's entire skyline. Watch sunset paint the domes and Arno valley in golden light Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "type": "info",
              "name": "Train to Venice"
            }
          ]
        },
        {
          "day": 6,
          "title": "Venice San Marco & Gondolas",
          "items": [
            {
              "name": "San Marco Basilica",
              "coord": [
                45.4345,
                12.3389
              ],
              "desc": "San Marco Basilica - distinctive Italian destination",
              "longDesc": "Enter this masterpiece of Eastern and Western art. Ascend the loggia for piazza views, explore treasury of relics and silver altarpieces."
            },
            {
              "name": "Doge's Palace",
              "coord": [
                45.4352,
                12.3406
              ],
              "desc": "Venetian Gothic palace and government seat",
              "longDesc": "Tour ornate chambers where doges ruled. Descend to sinister cells via Bridge of Sighs, view Tintoretto's vast canvases Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            },
            {
              "name": "Rialto Bridge",
              "coord": [
                45.4381,
                12.336
              ],
              "desc": "Rialto Bridge - distinctive Italian destination",
              "longDesc": "Stroll this marvel of Renaissance engineering lined with shops. Enjoy grand views of gondolas and palaces from the central arch."
            },
            {
              "type": "info",
              "name": "Gondola ride"
            }
          ]
        },
        {
          "day": 7,
          "title": "Murano & Burano Islands",
          "items": [
            {
              "name": "Murano Glass Island",
              "coord": [
                45.458,
                12.353
              ],
              "desc": "Murano Glass Island - distinctive Italian destination",
              "longDesc": "Watch artisans craft glass in blazing furnaces. Browse galleries of vibrant vessels and chandeliers produced for centuries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "name": "Burano Lace Island",
              "coord": [
                45.4853,
                12.417
              ],
              "desc": "Colorful fishing village known for lace",
              "longDesc": "Stroll streets painted in brilliant colors where lacemakers display intricate handiwork. Enjoy fresh seafood by picture-perfect lagoon Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Departure"
            }
          ]
        }
      ]
    },
    "b": {
      "name": "Hidden Gems (7 Days)",
      "color": "#059669",
      "days": [
        {
          "day": 1,
          "title": "Bologna Arrival",
          "items": [
            {
              "type": "info",
              "name": "Arrive in Bologna, portico walks"
            },
            {
              "type": "info",
              "name": "Dinner in city center"
            }
          ]
        },
        {
          "day": 2,
          "title": "Bologna Markets & Cooking",
          "items": [
            {
              "name": "Mercato di Mezzo Bologna",
              "coord": [
                44.495,
                11.343
              ],
              "desc": "Bologna's historic covered market with produce and prepared foods",
              "longDesc": "Ancient market hall in city center selling fresh produce, meats, prepared foods. Heart of Bologna's food culture Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Cooking class - traditional pasta"
            }
          ]
        },
        {
          "day": 3,
          "title": "Day Trip to Modena",
          "items": [
            {
              "type": "info",
              "name": "Train to Modena"
            },
            {
              "name": "Osteria Francescana",
              "coord": [
                44.6498,
                10.9222
              ],
              "desc": "Osteria Francescana - distinctive Italian destination",
              "longDesc": ". 3 MICHELIN Stars; world-famous dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying."
            },
            {
              "type": "info",
              "name": "Parmesan factory tour"
            }
          ]
        },
        {
          "day": 4,
          "title": "Siena & Wine Tasting",
          "items": [
            {
              "type": "info",
              "name": "Train to Siena"
            },
            {
              "name": "Piazza del Campo",
              "coord": [
                43.3183,
                11.3327
              ],
              "desc": "Piazza del Campo - distinctive Italian destination",
              "longDesc": "Experience one of Italy's most beautiful squares. Watch il Palio horse race biannually or relax with gelato watching Sienese life."
            },
            {
              "type": "info",
              "name": "Wine tasting"
            }
          ]
        },
        {
          "day": 5,
          "title": "Tuscan Hill Towns",
          "items": [
            {
              "name": "San Gimignano Medieval Town",
              "coord": [
                43.4675,
                11.9422
              ],
              "desc": "Hill town with soaring medieval towers",
              "longDesc": "Walk into the 13th century among 14 stone towers. Wander narrow lanes, taste local Vernaccia wine, and enjoy valley panoramas."
            },
            {
              "name": "Montepulciano",
              "coord": [
                43.097,
                11.7878
              ],
              "desc": "Wine town with Renaissance palaces",
              "longDesc": "Climb steep main street lined with palazzo facades. Visit wine cellars, enjoy Vino Nobile tastings, and view Val d'Orcia below."
            }
          ]
        },
        {
          "day": 6,
          "title": "Orvieto Underground",
          "items": [
            {
              "type": "info",
              "name": "Train to Orvieto"
            },
            {
              "name": "Siena Cathedral",
              "coord": [
                43.3183,
                11.3319
              ],
              "desc": "Siena Cathedral - distinctive Italian destination",
              "longDesc": "Marvel at dramatic black and white striped cathedral. Climb bell tower for Tuscan countryside vistas or explore intricate floor mosaics."
            },
            {
              "type": "info",
              "name": "Underground caves exploration"
            }
          ]
        },
        {
          "day": 7,
          "title": "Departure",
          "items": [
            {
              "type": "info",
              "name": "Return to Rome or depart"
            }
          ]
        }
      ]
    },
    "c": {
      "name": "Family Comfort (10 Days)",
      "color": "#D97706",
      "days": [
        {
          "day": 1,
          "title": "Rome & Villa Borghese",
          "items": [
            {
              "type": "info",
              "name": "Arrive in Rome"
            },
            {
              "name": "Villa Borghese",
              "coord": [
                41.914,
                12.49
              ],
              "desc": "Villa Borghese - distinctive Italian destination",
              "longDesc": "Vast green space perfect for picnics, rental boats on the lake, playgrounds, and art museums. An essential outdoor reset day in central Rome."
            },
            {
              "type": "info",
              "name": "Gelato crawl"
            }
          ]
        },
        {
          "day": 2,
          "title": "Colosseum & Explora Museum",
          "items": [
            {
              "name": "Colosseum",
              "coord": [
                41.8902,
                12.4922
              ],
              "desc": "Colosseum - distinctive Italian destination",
              "longDesc": "Marvel at Italy's most iconic monument. Explore ancient arena where gladiators fought, discover underground chambers and arena floor ruins Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "type": "info",
              "name": "Roman Forum"
            },
            {
              "type": "info",
              "name": "Explora Children's Museum visit"
            }
          ]
        },
        {
          "day": 3,
          "title": "Vatican & Pizza Making",
          "items": [
            {
              "type": "info",
              "name": "Vatican early morning visit"
            },
            {
              "type": "info",
              "name": "Pizza-making class"
            },
            {
              "type": "info",
              "name": "Train to Sorrento"
            }
          ]
        },
        {
          "day": 4,
          "title": "Sorrento Beach & Lemon Groves",
          "items": [
            {
              "type": "info",
              "name": "Arrive Sorrento"
            },
            {
              "type": "info",
              "name": "Beach relaxation"
            },
            {
              "type": "info",
              "name": "Lemon grove exploration"
            }
          ]
        },
        {
          "day": 5,
          "title": "Amalfi Coast Boat Trip",
          "items": [
            {
              "type": "info",
              "name": "Boat excursion along coast"
            },
            {
              "name": "Positano Beach Town",
              "coord": [
                40.6263,
                14.4829
              ],
              "desc": "Elegant vertical town on turquoise coast",
              "longDesc": "Descend to pebble beaches and waterfront restaurants. Browse designer boutiques clinging to cliffsides in this Riviera favorite Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            }
          ]
        },
        {
          "day": 6,
          "title": "Pompeii & Travel to Florence",
          "items": [
            {
              "name": "Pompeii Archaeological Site",
              "coord": [
                40.751,
                14.4867
              ],
              "desc": "Pompeii Archaeological Site - distinctive Italian destination",
              "longDesc": "Walk streets frozen in 79 AD. Explore homes with mosaics, bakeries with loaves, and amphitheater. Contemplate lives halted by volcanic ash."
            },
            {
              "type": "info",
              "name": "Train to Florence"
            }
          ]
        },
        {
          "day": 7,
          "title": "Florence Duomo & Boboli",
          "items": [
            {
              "name": "Duomo of Florence",
              "coord": [
                43.7731,
                11.256
              ],
              "desc": "Duomo of Florence - distinctive Italian destination",
              "longDesc": "Climb the iconic terracotta dome for breathtaking views. Admire geometric marble facade and Ghiberti's bronze doors below Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Gelato sampling"
            },
            {
              "name": "Palazzo Pitti & Boboli Gardens",
              "coord": [
                43.7641,
                11.2494
              ],
              "desc": "Medici palace with panoramic hillside gardens",
              "longDesc": "Tour sumptuous Medici apartments then stroll Boboli's Renaissance gardens with fountains, grottos, and city vistas from hilltop Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            }
          ]
        },
        {
          "day": 8,
          "title": "Florence Art & Cooking",
          "items": [
            {
              "name": "Uffizi Gallery",
              "coord": [
                43.7677,
                11.2553
              ],
              "desc": "Uffizi Gallery - distinctive Italian destination",
              "longDesc": "Experience Botticelli's Birth of Venus, Caravaggio masterpieces, and masterworks spanning Renaissance to Baroque periods in awe-inspiring galleries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Family cooking class"
            }
          ]
        },
        {
          "day": 9,
          "title": "Train to Venice",
          "items": [
            {
              "type": "info",
              "name": "Travel to Venice"
            },
            {
              "name": "Grand Canal Gondola Ride",
              "coord": [
                45.4357,
                12.3358
              ],
              "desc": "Historic waterway tour by traditional boat",
              "longDesc": "Glide beneath ornate palaces on Venice's main thoroughfare. Experience the city as medieval merchants did from a gondola's perspective Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "name": "San Marco Basilica",
              "coord": [
                45.4345,
                12.3389
              ],
              "desc": "San Marco Basilica - distinctive Italian destination",
              "longDesc": "Enter this masterpiece of Eastern and Western art. Ascend the loggia for piazza views, explore treasury of relics and silver altarpieces."
            }
          ]
        },
        {
          "day": 10,
          "title": "Murano & Departure",
          "items": [
            {
              "type": "info",
              "name": "Murano glass workshop"
            },
            {
              "type": "info",
              "name": "Departure"
            }
          ]
        }
      ]
    },
    "d": {
      "name": "Foodie Deep-Dive (10 Days)",
      "color": "#DC2626",
      "days": [
        {
          "day": 1,
          "title": "Rome Testaccio Market",
          "items": [
            {
              "type": "info",
              "name": "Arrive in Rome"
            },
            {
              "name": "Testaccio Market",
              "coord": [
                41.876,
                12.475
              ],
              "desc": "Rome's legendary neighborhood food market with vendors and local color",
              "longDesc": "Historic food market buzzing with local shoppers. Browse fresh produce, meats, cheeses, prepared foods. Essential Roman market atmosphere Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            },
            {
              "type": "info",
              "name": "Cacio e pepe crawl"
            }
          ]
        },
        {
          "day": 2,
          "title": "Rome Trattorias & Wine",
          "items": [
            {
              "type": "info",
              "name": "Traditional Roman trattorias"
            },
            {
              "type": "info",
              "name": "Wine bar evening"
            },
            {
              "name": "Trastevere",
              "coord": [
                41.8894,
                12.4712
              ],
              "desc": "Trastevere - distinctive Italian destination",
              "longDesc": "Wander ivy-covered alleyways and discover intimate trattorias. Explore artisan workshops, vintage shops, and authentic Roman nightlife Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering."
            }
          ]
        },
        {
          "day": 3,
          "title": "Rome & Train to Bologna",
          "items": [
            {
              "type": "info",
              "name": "Morning market visit"
            },
            {
              "type": "info",
              "name": "Train to Bologna"
            }
          ]
        },
        {
          "day": 4,
          "title": "Bologna Tortellini & Markets",
          "items": [
            {
              "type": "info",
              "name": "Tortellini tasting"
            },
            {
              "name": "Mercato delle Erbe Bologna",
              "coord": [
                44.5,
                11.348
              ],
              "desc": "Bologna's covered vegetable market with seasonal local produce",
              "longDesc": "Historic market dedicated to fresh vegetables, herbs, seasonal Italian produce. Charming, less touristy than main market halls Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Prosciutto tasting"
            }
          ]
        },
        {
          "day": 5,
          "title": "Modena & Balsamic Vinegar",
          "items": [
            {
              "type": "info",
              "name": "Day trip to Modena"
            },
            {
              "name": "Osteria Francescana",
              "coord": [
                44.6498,
                10.9222
              ],
              "desc": "Osteria Francescana - distinctive Italian destination",
              "longDesc": ". 3 MICHELIN Stars; world-famous dining Immerse yourself in authentic Italian culture and timeless traditions. Discover remarkable heritage and genuine regional character worth exploring thoroughly and enjoying."
            },
            {
              "type": "info",
              "name": "Balsamic vinegar tour"
            }
          ]
        },
        {
          "day": 6,
          "title": "Alba & Truffle Region",
          "items": [
            {
              "type": "info",
              "name": "Train to Alba, Piedmont"
            },
            {
              "type": "info",
              "name": "Truffle region exploration"
            },
            {
              "type": "info",
              "name": "Barolo wine tasting"
            }
          ]
        },
        {
          "day": 7,
          "title": "Piedmont Wine Tasting",
          "items": [
            {
              "type": "info",
              "name": "Wine region day trip"
            },
            {
              "type": "info",
              "name": "Local osteria dining"
            }
          ]
        },
        {
          "day": 8,
          "title": "Milan & Navigli District",
          "items": [
            {
              "type": "info",
              "name": "Train to Milan"
            },
            {
              "type": "info",
              "name": "Navigli district dinner"
            }
          ]
        },
        {
          "day": 9,
          "title": "Lake Como",
          "items": [
            {
              "name": "Lake Como",
              "coord": [
                45.989,
                9.265
              ],
              "desc": "Stunning Alpine lake with villas and villages",
              "longDesc": "Ferry between lakeside towns, visit Villa d'Este gardens, or hike surrounding mountains. Breathtaking in spring wildflowers and autumn colors Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "name": "Bellagio",
              "coord": [
                45.9767,
                9.2606
              ],
              "desc": "Elegant town on Lake Como's promontory",
              "longDesc": "Wander waterfront promenade and steep village streets. Visit formal Villa Melzi gardens with lakeside views and sculptures Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Lakeside dining"
            }
          ]
        },
        {
          "day": 10,
          "title": "Como & Departure",
          "items": [
            {
              "type": "info",
              "name": "Como morning exploration"
            },
            {
              "type": "info",
              "name": "Departure"
            }
          ]
        }
      ]
    },
    "e": {
      "name": "Grand Tour (14 Days)",
      "color": "#7C3AED",
      "days": [
        {
          "day": 1,
          "title": "Rome Arrival",
          "items": [
            {
              "type": "info",
              "name": "Arrive in Rome"
            },
            {
              "name": "Trastevere",
              "coord": [
                41.8894,
                12.4712
              ],
              "desc": "Trastevere - distinctive Italian destination",
              "longDesc": "Wander ivy-covered alleyways and discover intimate trattorias. Explore artisan workshops, vintage shops, and authentic Roman nightlife Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering."
            }
          ]
        },
        {
          "day": 2,
          "title": "Rome Colosseum & Forum",
          "items": [
            {
              "name": "Colosseum",
              "coord": [
                41.8902,
                12.4922
              ],
              "desc": "Colosseum - distinctive Italian destination",
              "longDesc": "Marvel at Italy's most iconic monument. Explore ancient arena where gladiators fought, discover underground chambers and arena floor ruins Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "name": "Roman Forum",
              "coord": [
                41.8925,
                12.4852
              ],
              "desc": "Ancient marketplace and civic center",
              "longDesc": "Walk among marble columns and temples spanning centuries of Roman history. Visit Temple of Saturn, House of the Vestal Virgins, and ancient basilicas."
            },
            {
              "name": "Pantheon",
              "coord": [
                41.8986,
                12.4769
              ],
              "desc": "Pantheon - distinctive Italian destination",
              "longDesc": "Step inside this 2,000-year-old masterpiece. Marvel at the oculus flooding light onto marble floors and Renaissance tombs within Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            }
          ]
        },
        {
          "day": 3,
          "title": "Vatican & Train to Naples",
          "items": [
            {
              "name": "Vatican Museums & Sistine Chapel",
              "coord": [
                41.9058,
                12.457
              ],
              "desc": "Vatican Museums & Sistine Chapel - distinctive Italian destination",
              "longDesc": "Ascend the papal staircase, walk through Renaissance galleries, and gaze at Michelangelo's iconic ceiling frescoes in the Sistine Chapel Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth."
            },
            {
              "type": "info",
              "name": "Train to Naples"
            }
          ]
        },
        {
          "day": 4,
          "title": "Naples & Pompeii",
          "items": [
            {
              "type": "info",
              "name": "Naples morning exploration"
            },
            {
              "name": "Pompeii Archaeological Site",
              "coord": [
                40.751,
                14.4867
              ],
              "desc": "Pompeii Archaeological Site - distinctive Italian destination",
              "longDesc": "Walk streets frozen in 79 AD. Explore homes with mosaics, bakeries with loaves, and amphitheater. Contemplate lives halted by volcanic ash."
            }
          ]
        },
        {
          "day": 5,
          "title": "Amalfi Coast Drive",
          "items": [
            {
              "name": "Amalfi Coast Drive",
              "coord": [
                40.6333,
                14.6
              ],
              "desc": "Amalfi Coast Drive - distinctive Italian destination",
              "longDesc": "Traverse cliff-hugging roads with vertiginous drops. Stop at Positano's pastel villages, Ravello's hilltop gardens, and hidden beaches Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "name": "Positano Beach Town",
              "coord": [
                40.6263,
                14.4829
              ],
              "desc": "Elegant vertical town on turquoise coast",
              "longDesc": "Descend to pebble beaches and waterfront restaurants. Browse designer boutiques clinging to cliffsides in this Riviera favorite Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "name": "Ravello",
              "coord": [
                40.6297,
                14.6089
              ],
              "desc": "Hilltop village overlooking Amalfi Coast",
              "longDesc": "Explore terraced gardens and medieval churches. Visit Villa Rufolo and Villa Cimbrone with jaw-dropping coastal panoramas Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring thoroughly and discovering."
            }
          ]
        },
        {
          "day": 6,
          "title": "Capri Day Trip",
          "items": [
            {
              "type": "info",
              "name": "Boat to Capri"
            },
            {
              "type": "info",
              "name": "Beach exploration"
            },
            {
              "type": "info",
              "name": "Return to coast"
            }
          ]
        },
        {
          "day": 7,
          "title": "Drive to Matera",
          "items": [
            {
              "type": "info",
              "name": "Drive to Matera"
            },
            {
              "name": "Matera Sassi",
              "coord": [
                40.666,
                16.604
              ],
              "desc": "Matera Sassi - distinctive Italian destination",
              "longDesc": "Wander through Matera's otherworldly Sassi district. Explore cave homes, churches, and passageways carved into stone for millennia Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            }
          ]
        },
        {
          "day": 8,
          "title": "Puglia - Alberobello Trulli",
          "items": [
            {
              "type": "info",
              "name": "Drive to Puglia"
            },
            {
              "name": "Alberobello Trulli Houses",
              "coord": [
                40.785,
                17.236
              ],
              "desc": "Alberobello Trulli Houses - distinctive Italian destination",
              "longDesc": "Walk streets lined with distinctive trulli houses with conical roofs. Tour house museums, visit shops selling local crafts and foods."
            }
          ]
        },
        {
          "day": 9,
          "title": "Lecce Baroque Walking Tour",
          "items": [
            {
              "type": "info",
              "name": "Travel to Lecce"
            },
            {
              "type": "info",
              "name": "Baroque architecture walking tour"
            },
            {
              "type": "info",
              "name": "Puglian dinner"
            }
          ]
        },
        {
          "day": 10,
          "title": "Train to Florence",
          "items": [
            {
              "type": "info",
              "name": "Travel to Florence"
            }
          ]
        },
        {
          "day": 11,
          "title": "Florence Uffizi & Duomo",
          "items": [
            {
              "name": "Uffizi Gallery",
              "coord": [
                43.7677,
                11.2553
              ],
              "desc": "Uffizi Gallery - distinctive Italian destination",
              "longDesc": "Experience Botticelli's Birth of Venus, Caravaggio masterpieces, and masterworks spanning Renaissance to Baroque periods in awe-inspiring galleries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "name": "Duomo of Florence",
              "coord": [
                43.7731,
                11.256
              ],
              "desc": "Duomo of Florence - distinctive Italian destination",
              "longDesc": "Climb the iconic terracotta dome for breathtaking views. Admire geometric marble facade and Ghiberti's bronze doors below Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Florence walking tour"
            }
          ]
        },
        {
          "day": 12,
          "title": "Tuscan Day Trip",
          "items": [
            {
              "name": "Chianti Wine Region",
              "coord": [
                43.41,
                11.71
              ],
              "desc": "Chianti Wine Region - distinctive Italian destination",
              "longDesc": "Drive scenic routes through terraced vineyards. Stop at family-run wineries for tastings, olive oil samples, and alfresco lunches Discover remarkable Italian heritage and authentic regional traditions. A truly exceptional cultural experience worth thoroughly."
            },
            {
              "type": "info",
              "name": "Wine tasting and exploration"
            }
          ]
        },
        {
          "day": 13,
          "title": "Train to Venice",
          "items": [
            {
              "type": "info",
              "name": "Travel to Venice"
            },
            {
              "name": "San Marco Basilica",
              "coord": [
                45.4345,
                12.3389
              ],
              "desc": "San Marco Basilica - distinctive Italian destination",
              "longDesc": "Enter this masterpiece of Eastern and Western art. Ascend the loggia for piazza views, explore treasury of relics and silver altarpieces."
            },
            {
              "type": "info",
              "name": "Gondola ride"
            }
          ]
        },
        {
          "day": 14,
          "title": "Venice Islands & Departure",
          "items": [
            {
              "name": "Murano Glass Island",
              "coord": [
                45.458,
                12.353
              ],
              "desc": "Murano Glass Island - distinctive Italian destination",
              "longDesc": "Watch artisans craft glass in blazing furnaces. Browse galleries of vibrant vessels and chandeliers produced for centuries Experience authentic regional traditions and discover remarkable Italian cultural heritage throughout this exceptional destination. Worth exploring."
            },
            {
              "type": "info",
              "name": "Final meal"
            },
            {
              "type": "info",
              "name": "Departure"
            }
          ]
        }
      ]
    }
  }
}