{
  "key": "spain",
  "name": "Spain Family Adventure",
  "subtitle": "Interactive Trip Map",
  "flag": "🇪🇸",
  "defaultCenter": [
    40.0,
    -3.7
  ],
  "defaultZoom": 6,
  "hotels": [
    {
      "name": "Four Seasons Hotel Madrid",
      "coord": [
        40.417272,
        -3.700392
      ],
      "desc": "Landmark Puerta del Sol luxury, world-class spa, Michelin dining",
      "longDesc": "Perfectly positioned near Puerta del Sol with world-class spa and stellar restaurants—ideal for families seeking refined comfort in Madrid's heart."
    },
    {
      "name": "Mandarin Oriental Ritz, Madrid",
      "coord": [
        40.41555,
        -3.692726
      ],
      "desc": "Contemporary luxury with warmth",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting."
    },
    {
      "name": "Rosewood Villa Magna",
      "coord": [
        40.429937,
        -3.688165
      ],
      "desc": "Salamanca boutique, Michelin F&B, upscale shopping nearby",
      "longDesc": "Sophisticated Salamanca sanctuary featuring Michelin-starred dining and excellent spa, steps from designer shopping district."
    },
    {
      "name": "Gran Hotel Inglés",
      "coord": [
        40.415942,
        -3.699808
      ],
      "desc": "Art Deco boutique, Barrio de las Letras, warm service",
      "longDesc": "Charming Art Deco boutique in Madrid's literary neighborhood, celebrated for excellent breakfasts and literary atmosphere."
    },
    {
      "name": "The Madrid EDITION",
      "coord": [
        40.417777,
        -3.70631
      ],
      "desc": "Contemporary buzz, stellar restaurants, style-conscious scene",
      "longDesc": "Modern contemporary hotel with vibrant restaurants and bars, perfect for style-conscious families seeking Madrid's energy."
    },
    {
      "name": "Hotel Palacio de los Duques Gran Meliá",
      "coord": [
        38.424055,
        -6.416659
      ],
      "desc": "Near Royal Palace, modern-historic blend, rooftop pool",
      "longDesc": "Historic palace near the Royal Palace combining belle-époque grandeur with contemporary amenities and panoramic rooftop pool."
    },
    {
      "name": "Santo Mauro, a Luxury Collection Hotel",
      "coord": [
        40.431003,
        -3.693055
      ],
      "desc": "Former palace sanctuary with gardens, serene escape",
      "longDesc": "Peaceful former palace retreat with manicured gardens, ideal for families wanting tranquility without sacrificing luxury."
    },
    {
      "name": "Hotel Único Madrid",
      "coord": [
        40.428559,
        -3.686205
      ],
      "desc": "Elegant boutique, Michelin restaurant, Retiro walkable",
      "longDesc": "Intimate boutique with acclaimed dining, perfectly positioned for exploring Retiro Park and designer shopping district."
    },
    {
      "name": "Thompson Madrid",
      "coord": [
        40.418458,
        -3.702483
      ],
      "desc": "Rooftop pool hotspot on Gran Vía, vibrant nightlife",
      "longDesc": "Lively rooftop bar and contemporary rooms on Gran Vía, great for families enjoying proximity to Madrid's shopping and entertainment."
    },
    {
      "name": "JW Marriott Hotel Madrid",
      "coord": [
        40.416834,
        -3.700137
      ],
      "desc": "Polished contemporary, excellent locations, trusted service",
      "longDesc": "Dependable luxury base with excellent locations and polished service, ideal for business and leisure travelers."
    },
    {
      "name": "BLESS Hotel Madrid",
      "coord": [
        40.428201,
        -3.683682
      ],
      "desc": "Comfortable base with reliable service",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience."
    },
    {
      "name": "URSO Hotel & Spa",
      "coord": [
        40.427015,
        -3.698051
      ],
      "desc": "Notable landmark in Spain: URSO Hotel & Spa with regional charm",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Mandarin Oriental, Barcelona",
      "coord": [
        41.391381,
        2.166914
      ],
      "desc": "Passeig de Gràcia sophistication, spa excellence, fine dining",
      "longDesc": "Sophisticated Passeig de Gràcia address with world-class spa and Michelin-starred dining in Belle Époque setting."
    },
    {
      "name": "Hotel Arts Barcelona",
      "coord": [
        41.3904,
        2.1706
      ],
      "desc": "Starck-designed Olympic Port luxury, Michelin dining, spa",
      "longDesc": "Philippe Starck masterpiece overlooking Olympic Port, renowned for cutting-edge design and Michelin-starred restaurant."
    },
    {
      "name": "Majestic Hotel & Spa Barcelona",
      "coord": [
        41.393681,
        2.16414
      ],
      "desc": "Passeig de Gràcia landmark, rooftop pool, Michelin dining",
      "longDesc": "Belle Époque landmark on Passeig de Gràcia featuring exceptional spa, Michelin-starred restaurant, and rooftop garden."
    },
    {
      "name": "W Barcelona",
      "coord": [
        41.38258,
        2.177073
      ],
      "desc": "Beachfront W design, trendy bars, contemporary Barcelona",
      "longDesc": "Contemporary beachfront W hotel with modern design, lively bars, and access to Barceloneta beach life."
    },
    {
      "name": "The Barcelona EDITION",
      "coord": [
        41.38601,
        2.177838
      ],
      "desc": "Historic property with character",
      "longDesc": "Charming neighborhood hotel providing authentic local experience with personalized service and character."
    },
    {
      "name": "Hotel Casa Fuster",
      "coord": [
        41.398176,
        2.15811
      ],
      "desc": "Notable landmark in Spain: Hotel Casa Fuster with regional charm",
      "longDesc": "Well-appointed property offering sophisticated comfort and convenient access to local attractions."
    },
    {
      "name": "Cotton House Hotel",
      "coord": [
        41.391668,
        2.171908
      ],
      "desc": "Well-located neighborhood hotel",
      "longDesc": "Contemporary property designed for comfort with thoughtful amenities and welcoming hospitality."
    },
    {
      "name": "Almanac Barcelona",
      "coord": [
        41.390753,
        2.169413
      ],
      "desc": "Boutique retreat with local charm",
      "longDesc": "Historic gem offering traditional Spanish charm paired with modern conveniences."
    },
    {
      "name": "The Serras Barcelona",
      "coord": [
        41.380322,
        2.180597
      ],
      "desc": "Traditional Spanish tapas and pintxos in Barcelona, featuring local wines and...",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Hotel Neri Relais & Châteaux",
      "coord": [
        41.383172,
        2.175393
      ],
      "desc": "Notable landmark in Spain: Hotel Neri Relais & Châteaux with regional charm",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting Ideal retreat for cultural explorers."
    },
    {
      "name": "Kimpton Vividora Hotel",
      "coord": [
        41.384674,
        2.172873
      ],
      "desc": "Modern design with welcoming service",
      "longDesc": "Historic property preserving local character while offering contemporary comforts and personalized service."
    },
    {
      "name": "Hotel Seventy Barcelona",
      "coord": [
        41.3854,
        2.1656
      ],
      "desc": "Eixample contemporary boutique, rooftop views, design focus",
      "longDesc": "Contemporary boutique in the Eixample district with rooftop terraces overlooking Barcelona and design-forward aesthetic."
    },
    {
      "name": "Only YOU Hotel Valencia",
      "coord": [
        39.471361,
        -0.374926
      ],
      "desc": "Historic elegance and tradition",
      "longDesc": "Modern comfort-focused hotel ideal for families seeking practical amenities without sacrificing style."
    },
    {
      "name": "Caro Hotel Valencia",
      "coord": [
        39.47596,
        -0.372167
      ],
      "desc": "Family-friendly accommodations",
      "longDesc": "Elegantly designed property blending contemporary features with traditional Spanish architectural influences."
    },
    {
      "name": "Hotel Alfonso XIII, a Luxury Collection Hotel",
      "coord": [
        37.3882,
        -5.9847
      ],
      "desc": "Notable landmark in Spain: Hotel Alfonso XIII, a Luxury Collection  with regi...",
      "longDesc": "Charming neighborhood hotel providing authentic local experience with personalized service and character Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Mercer Hotel Sevilla",
      "coord": [
        37.388232,
        -5.993662
      ],
      "desc": "Notable landmark in Spain: Mercer Hotel Sevilla with regional charm",
      "longDesc": "Well-appointed property offering sophisticated comfort and convenient access to local attractions Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Corral del Rey",
      "coord": [
        39.796343,
        -2.389902
      ],
      "desc": "Notable landmark in Spain: Corral del Rey with regional charm",
      "longDesc": "Contemporary property designed for comfort with thoughtful amenities and welcoming hospitality Perfect sanctuary for vacation seekers."
    },
    {
      "name": "CoolRooms Palacio de Villapanés",
      "coord": [
        37.39159,
        -5.9865
      ],
      "desc": "Notable landmark in Spain: CoolRooms Palacio de Villapanés with regional charm",
      "longDesc": "Historic gem offering traditional Spanish charm paired with modern conveniences Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Hotel Colón Gran Meliá",
      "coord": [
        37.390851,
        -5.998708
      ],
      "desc": "Notable landmark in Spain: Hotel Colón Gran Meliá with regional charm",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience Ideal retreat for cultural explorers."
    },
    {
      "name": "Hotel Alhambra Palace",
      "coord": [
        37.173961,
        -3.590129
      ],
      "desc": "Hillside position, Moorish architecture, Granada overlook",
      "longDesc": "Grandeur hillside hotel with Moorish-inspired architecture overlooking Granada city and Alhambra complex."
    },
    {
      "name": "Parador de Granada",
      "coord": [
        37.17579,
        -3.58723
      ],
      "desc": "Within Alhambra complex, Islamic heritage, sunset views",
      "longDesc": "Uniquely positioned within Alhambra grounds offering unmatched sunset views and authentic Moorish atmosphere."
    },
    {
      "name": "Gran Hotel Miramar GL",
      "coord": [
        37.601475,
        -0.986416
      ],
      "desc": "Contemporary rooms and amenities",
      "longDesc": "Intimate boutique hotel celebrating regional traditions through architecture, design, and culinary offerings."
    },
    {
      "name": "Marbella Club Hotel",
      "coord": [
        36.50652,
        -4.919216
      ],
      "desc": "Notable landmark in Spain: Marbella Club Hotel with regional charm",
      "longDesc": "Modern comfort-focused hotel ideal for families seeking practical amenities without sacrificing style Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Puente Romano Beach Resort",
      "coord": [
        36.50384,
        -4.92493
      ],
      "desc": "Beautiful Mediterranean beach in Spain with golden sand and crystal waters",
      "longDesc": "Elegantly designed property blending contemporary features with traditional Spanish architectural influences Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Finca Cortesin Hotel Golf & Spa",
      "coord": [
        36.39747,
        -5.22399
      ],
      "desc": "Notable landmark in Spain: Finca Cortesin Hotel Golf & Spa with regional charm",
      "longDesc": "Charming neighborhood hotel providing authentic local experience with personalized service and character Ideal retreat for cultural explorers."
    },
    {
      "name": "OKU Andalusia",
      "coord": [
        37.417442,
        -5.825373
      ],
      "desc": "Notable landmark in Spain: OKU Andalusia with regional charm",
      "longDesc": "Well-appointed property offering sophisticated comfort and convenient access to local attractions Ideal retreat for cultural explorers."
    },
    {
      "name": "Hotel María Cristina",
      "coord": [
        37.083659,
        -6.138393
      ],
      "desc": "Notable landmark in Spain: Hotel María Cristina with regional charm",
      "longDesc": "Contemporary property designed for comfort with thoughtful amenities and welcoming hospitality Ideal retreat for cultural explorers."
    },
    {
      "name": "Lasala Plaza Hotel",
      "coord": [
        43.319,
        -1.9825
      ],
      "desc": "Notable landmark in Spain: Lasala Plaza Hotel with regional charm",
      "longDesc": "Historic gem offering traditional Spanish charm paired with modern conveniences Ideal retreat for cultural explorers."
    },
    {
      "name": "Gran Hotel Domine Bilbao",
      "coord": [
        43.264122,
        -2.942004
      ],
      "desc": "Notable landmark in Bilbao: Gran Hotel Domine Bilbao with regional charm",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience Outstanding base for city exploration."
    },
    {
      "name": "Hotel Marqués de Riscal",
      "coord": [
        42.511681,
        -2.6177
      ],
      "desc": "Notable landmark in Spain: Hotel Marqués de Riscal with regional charm",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting Outstanding base for city exploration."
    },
    {
      "name": "Abadía Retuerta LeDomaine",
      "coord": [
        36.163686,
        -5.341683
      ],
      "desc": "Notable landmark in Spain: Abadía Retuerta LeDomaine with regional charm",
      "longDesc": "Historic property preserving local character while offering contemporary comforts and personalized service Perfect sanctuary for vacation seekers."
    },
    {
      "name": "Parador Hostal dos Reis Católicos",
      "coord": [
        42.881457,
        -8.54592
      ],
      "desc": "Historic parador in Spain with stunning regional views and traditional Spanis...",
      "longDesc": "Intimate boutique hotel celebrating regional traditions through architecture, design, and culinary offerings Perfect sanctuary for vacation seekers."
    },
    {
      "name": "La Residencia, A Belmond Hotel, Mallorca",
      "coord": [
        39.757,
        2.737
      ],
      "desc": "Notable landmark in Spain: La Residencia, A Belmond Hotel, Mallorca with regi...",
      "longDesc": "Modern comfort-focused hotel ideal for families seeking practical amenities without sacrificing style Ideal retreat for cultural explorers."
    },
    {
      "name": "Cap Rocat",
      "coord": [
        39.475622,
        2.724705
      ],
      "desc": "Notable landmark in Spain: Cap Rocat with regional charm",
      "longDesc": "Elegantly designed property blending contemporary features with traditional Spanish architectural influences Ideal retreat for cultural explorers."
    },
    {
      "name": "Four Seasons Resort Mallorca at Formentor",
      "coord": [
        39.9689,
        3.2231
      ],
      "desc": "Notable landmark in Spain: Four Seasons Resort Mallorca at Formento with regi...",
      "longDesc": "Charming neighborhood hotel providing authentic local experience with personalized service and character Outstanding base for city exploration."
    },
    {
      "name": "Castell Son Claret",
      "coord": [
        41.647999,
        2.740193
      ],
      "desc": "Notable landmark in Spain: Castell Son Claret with regional charm",
      "longDesc": "Well-appointed property offering sophisticated comfort and convenient access to local attractions Outstanding base for city exploration."
    },
    {
      "name": "Nobu Hotel Ibiza Bay",
      "coord": [
        38.918239,
        1.456625
      ],
      "desc": "Notable landmark in Spain: Nobu Hotel Ibiza Bay with regional charm",
      "longDesc": "Contemporary property designed for comfort with thoughtful amenities and welcoming hospitality Outstanding base for city exploration."
    },
    {
      "name": "Six Senses Ibiza",
      "coord": [
        39.110834,
        1.507821
      ],
      "desc": "Notable landmark in Spain: Six Senses Ibiza with regional charm",
      "longDesc": "Historic gem offering traditional Spanish charm paired with modern conveniences Outstanding base for city exploration."
    },
    {
      "name": "Son Blanc Farmhouse Menorca",
      "coord": [
        39.9512,
        4.1104
      ],
      "desc": "Notable landmark in Spain: Son Blanc Farmhouse Menorca with regional charm",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience Excellent choice for discerning travelers."
    },
    {
      "name": "Faustino Gran Relais & Chateaux",
      "coord": [
        39.952,
        4.1114
      ],
      "desc": "Notable landmark in Spain: Faustino Gran Relais & Chateaux with regional charm",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting Excellent choice for discerning travelers."
    },
    {
      "name": "Meliá Cala Galdana",
      "coord": [
        39.9472,
        4.1124
      ],
      "desc": "Notable landmark in Spain: Meliá Cala Galdana with regional charm",
      "longDesc": "Historic property preserving local character while offering contemporary comforts and personalized service Ideal retreat for cultural explorers."
    },
    {
      "name": "Cristine Bedfor Guest Houses Mahón",
      "coord": [
        39.948,
        4.1084
      ],
      "desc": "Notable landmark in Spain: Cristine Bedfor Guest Houses Mahón with regional c...",
      "longDesc": "Intimate boutique hotel celebrating regional traditions through architecture, design, and culinary offerings Ideal retreat for cultural explorers."
    },
    {
      "name": "Casa Palacio María Luisa",
      "coord": [
        39.9984,
        -3.702
      ],
      "desc": "Notable landmark in Spain: Casa Palacio María Luisa with regional charm",
      "longDesc": "Modern comfort-focused hotel ideal for families seeking practical amenities without sacrificing style Outstanding base for city exploration."
    },
    {
      "name": "Hotel Unuk",
      "coord": [
        39.9992,
        -3.701
      ],
      "desc": "Notable landmark in Spain: Hotel Unuk with regional charm",
      "longDesc": "Elegantly designed property blending contemporary features with traditional Spanish architectural influences Outstanding base for city exploration."
    },
    {
      "name": "Villa Le Blanc, a Gran Meliá Hotel - The Leading Hotels of the World",
      "coord": [
        40.0,
        -3.7
      ],
      "desc": "Notable landmark in Spain: Villa Le Blanc, a Gran Meliá Hotel - The with regi...",
      "longDesc": "Charming neighborhood hotel providing authentic local experience with personalized service and character Excellent choice for discerning travelers."
    },
    {
      "name": "Can Tres Formentera",
      "coord": [
        40.0008,
        -3.699
      ],
      "desc": "Notable landmark in Spain: Can Tres Formentera with regional charm",
      "longDesc": "Well-appointed property offering sophisticated comfort and convenient access to local attractions Excellent choice for discerning travelers."
    },
    {
      "name": "Hotel Plaza 18",
      "coord": [
        40.0016,
        -3.698
      ],
      "desc": "Notable landmark in Spain: Hotel Plaza 18 with regional charm",
      "longDesc": "Contemporary property designed for comfort with thoughtful amenities and welcoming hospitality Excellent choice for discerning travelers."
    },
    {
      "name": "Palacio Solecio",
      "coord": [
        40.0024,
        -3.702
      ],
      "desc": "Notable landmark in Spain: Palacio Solecio with regional charm",
      "longDesc": "Historic gem offering traditional Spanish charm paired with modern conveniences Excellent choice for discerning travelers."
    },
    {
      "name": "La Zambra Resort - The Unbound Collection by Hyatt",
      "coord": [
        39.9976,
        -3.701
      ],
      "desc": "Notable landmark in Spain: La Zambra Resort - The Unbound Collectio with regi...",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience Perfect sanctuary for vacation seekers A perfect choice for discerning travelers seeking comfort."
    },
    {
      "name": "Hotel Hospes Palau de la Mar | Valencia",
      "coord": [
        39.4675,
        -0.3773
      ],
      "desc": "Notable landmark in Valencia: Hotel Hospes Palau de la Mar | Valencia with re...",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting Perfect sanctuary for vacation seekers Offers exceptional comfort in an excellent location."
    },
    {
      "name": "Hospes Palacio de los Patos",
      "coord": [
        39.9992,
        -3.699
      ],
      "desc": "Palace hotel, Moorish patio, historic transformation",
      "longDesc": "Converted Renaissance palace with stunning Moorish courtyard, blending historical grandeur with contemporary luxury."
    },
    {
      "name": "Hotel Claude Marbella",
      "coord": [
        40.0,
        -3.698
      ],
      "desc": "Notable landmark in Spain: Hotel Claude Marbella with regional charm",
      "longDesc": "Intimate boutique hotel celebrating regional traditions through architecture, design, and culinary offerings Outstanding base for city exploration."
    },
    {
      "name": "Finca Cortesin",
      "coord": [
        40.0008,
        -3.702
      ],
      "desc": "Notable landmark in Spain: Finca Cortesin with regional charm",
      "longDesc": "Modern comfort-focused hotel ideal for families seeking practical amenities without sacrificing style Excellent choice for discerning travelers."
    },
    {
      "name": "Balcon De Cordoba",
      "coord": [
        37.889,
        -4.7814
      ],
      "desc": "Notable landmark in Spain: Balcon De Cordoba with regional charm",
      "longDesc": "Elegantly designed property blending contemporary features with traditional Spanish architectural influences Excellent choice for discerning travelers."
    },
    {
      "name": "Casa La Siesta",
      "coord": [
        40.0024,
        -3.7
      ],
      "desc": "Notable landmark in Spain: Casa La Siesta with regional charm",
      "longDesc": "Charming neighborhood hotel providing authentic local experience with personalized service and character Perfect sanctuary for vacation seekers A perfect choice for discerning travelers seeking comfort."
    },
    {
      "name": "Finca la Bobadilla",
      "coord": [
        39.9976,
        -3.699
      ],
      "desc": "Notable landmark in Spain: Finca la Bobadilla with regional charm",
      "longDesc": "Well-appointed property offering sophisticated comfort and convenient access to local attractions Perfect sanctuary for vacation seekers Offers exceptional comfort in an excellent location."
    },
    {
      "name": "Hotel Finca el Cerrillo",
      "coord": [
        39.9984,
        -3.698
      ],
      "desc": "Notable landmark in Spain: Hotel Finca el Cerrillo with regional charm",
      "longDesc": "Contemporary property designed for comfort with thoughtful amenities and welcoming hospitality Perfect sanctuary for vacation seekers Highly recommended for families seeking refined service."
    },
    {
      "name": "Hotel La Casa del Califa de Vejer",
      "coord": [
        39.9992,
        -3.702
      ],
      "desc": "Notable landmark in Spain: Hotel La Casa del Califa de Vejer with regional charm",
      "longDesc": "Historic gem offering traditional Spanish charm paired with modern conveniences Perfect sanctuary for vacation seekers A top choice for luxury and personalized hospitality."
    },
    {
      "name": "Hotel Hospes Palacio del Bailío",
      "coord": [
        40.0,
        -3.701
      ],
      "desc": "Notable landmark in Spain: Hotel Hospes Palacio del Bailío with regional charm",
      "longDesc": "Well-maintained property offering comfortable accommodations and reliable service for travelers seeking convenience Ideal retreat for cultural explorers Ideal for those valuing style and comfort equally."
    },
    {
      "name": "Hotel Mercer Sevilla",
      "coord": [
        40.0008,
        -3.7
      ],
      "desc": "Notable landmark in Spain: Hotel Mercer Sevilla with regional charm",
      "longDesc": "Contemporary hotel combining modern design with welcoming hospitality in a vibrant neighborhood setting Ideal retreat for cultural explorers A wonderful base for exploring the surrounding region."
    },
    {
      "name": "Finca La Donaira",
      "coord": [
        40.0016,
        -3.699
      ],
      "desc": "Notable landmark in Spain: Finca La Donaira with regional charm",
      "longDesc": "Historic property preserving local character while offering contemporary comforts and personalized service Outstanding base for city exploration."
    }
  ],
  "restaurants": [
    {
      "name": "Disfrutar",
      "coord": [
        41.387762,
        2.153172
      ],
      "desc": "Spanish cuisine, local favorite spot",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients."
    },
    {
      "name": "Lasarte",
      "coord": [
        42.809054,
        -2.69166
      ],
      "desc": "Market-to-table seasonal cooking",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars."
    },
    {
      "name": "ABaC",
      "coord": [
        41.41078,
        2.13654
      ],
      "desc": "Notable landmark in Spain: ABaC with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors."
    },
    {
      "name": "Cocina Hermanos Torres",
      "coord": [
        41.386514,
        2.140145
      ],
      "desc": "Traditional flavors, family recipes",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution."
    },
    {
      "name": "Enigma",
      "coord": [
        42.563944,
        -1.45887
      ],
      "desc": "Wine-focused restaurant, pairing menu",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy."
    },
    {
      "name": "Alkimia",
      "coord": [
        38.538469,
        -0.134337
      ],
      "desc": "Local institution, neighborhood favorite",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking."
    },
    {
      "name": "Cinc Sentits",
      "coord": [
        41.388481,
        2.159362
      ],
      "desc": "Two Michelin stars, seasonal Catalan, intimate",
      "longDesc": "Two-star restaurant showcasing seasonal Catalan cuisine with refined technique and attentive service."
    },
    {
      "name": "Via Veneto",
      "coord": [
        43.094453,
        -3.388797
      ],
      "desc": "Street food culture, casual dining",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy."
    },
    {
      "name": "Besta",
      "coord": [
        43.550325,
        -7.852237
      ],
      "desc": "Contemporary Spanish, skilled execution",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine."
    },
    {
      "name": "Gresca",
      "coord": [
        41.39132,
        2.157217
      ],
      "desc": "Michelin-starred, seasonal ingredients, modern",
      "longDesc": "Michelin-starred restaurant celebrating seasonal ingredients with contemporary cooking techniques."
    },
    {
      "name": "Can Solé",
      "coord": [
        39.528943,
        2.735142
      ],
      "desc": "Notable landmark in Spain: Can Solé with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Beloved spot worth seeking out."
    },
    {
      "name": "7 Portes",
      "coord": [
        41.382172,
        2.183247
      ],
      "desc": "Historic 1836 establishment, Catalan classics, bustling",
      "longDesc": "Historic belle-époque restaurant serving Catalan classics in atmosphere bustling with local energy."
    },
    {
      "name": "Bar del Pla",
      "coord": [
        41.385604,
        2.180022
      ],
      "desc": "Intimate Spanish tapas, minimalist, wine-focused",
      "longDesc": "Minimalist tapas bar emphasizing wine pairings and carefully selected Spanish small plates."
    },
    {
      "name": "Cal Pep",
      "coord": [
        41.444337,
        2.237943
      ],
      "desc": "Counter-seating seafood institution, fried perfection",
      "longDesc": "Beloved seafood bar where perfectly fried fish and shellfish attract locals and visitors alike."
    },
    {
      "name": "Els Quatre Gats",
      "coord": [
        41.385738,
        2.173639
      ],
      "desc": "Notable landmark in Spain: Els Quatre Gats with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Beloved spot worth seeking out."
    },
    {
      "name": "Bodega 1900 (vermut & tapas)",
      "coord": [
        41.385663,
        2.154167
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam...",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Beloved spot worth seeking out."
    },
    {
      "name": "Tickets-style innovation: Suculent",
      "coord": [
        41.3818,
        2.1646
      ],
      "desc": "Seafood specialties, market-fresh",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients."
    },
    {
      "name": "La Paradeta Born",
      "coord": [
        41.386252,
        2.183926
      ],
      "desc": "Notable landmark in Spain: La Paradeta Born with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Beloved spot worth seeking out."
    },
    {
      "name": "Sips",
      "coord": [
        41.388873,
        2.156716
      ],
      "desc": "Notable landmark in Spain: Sips with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Beloved spot worth seeking out."
    },
    {
      "name": "Paradiso",
      "coord": [
        40.317211,
        -4.982257
      ],
      "desc": "Regional traditions, authentic cooking",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere."
    },
    {
      "name": "Two Schmucks",
      "coord": [
        41.381248,
        2.166843
      ],
      "desc": "Notable landmark in Spain: Two Schmucks with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Essential dining experience."
    },
    {
      "name": "Dr. Stravinsky",
      "coord": [
        38.732673,
        0.219886
      ],
      "desc": "Notable landmark in Spain: Dr. Stravinsky with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Beloved spot worth seeking out."
    },
    {
      "name": "Boadas Cocktails",
      "coord": [
        41.973708,
        2.625057
      ],
      "desc": "Notable landmark in Spain: Boadas Cocktails with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Beloved spot worth seeking out."
    },
    {
      "name": "Monk",
      "coord": [
        42.235959,
        -8.717057
      ],
      "desc": "Notable landmark in Spain: Monk with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Beloved spot worth seeking out."
    },
    {
      "name": "DiverXO",
      "coord": [
        40.457795,
        -3.685949
      ],
      "desc": "Notable landmark in Spain: DiverXO with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Essential dining experience."
    },
    {
      "name": "Coque",
      "coord": [
        37.042337,
        -2.238993
      ],
      "desc": "Madrid innovative temple, playful technique, seasonal",
      "longDesc": "Celebrated for playful technique and seasonal ingredients, offering Madrid's most adventurous fine dining."
    },
    {
      "name": "DSTAgE",
      "coord": [
        40.424594,
        -3.696332
      ],
      "desc": "Two Michelin stars, artistic plating, contemporary",
      "longDesc": "Two-star Michelin showcase of contemporary Spanish cuisine with artistic presentation and seasonal focus."
    },
    {
      "name": "Botín",
      "coord": [
        42.6181,
        -4.58891
      ],
      "desc": "Notable landmark in Spain: Botín with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Essential dining experience."
    },
    {
      "name": "Casa Lucio",
      "coord": [
        37.868329,
        -1.504386
      ],
      "desc": "Authentic Castilian classics, family-run tradition",
      "longDesc": "Beloved Madrid classic serving authentic Castilian fare with family recipes spanning generations."
    },
    {
      "name": "La Tasquería",
      "coord": [
        40.422227,
        -3.673511
      ],
      "desc": "Notable landmark in Spain: La Tasquería with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Beloved spot worth seeking out."
    },
    {
      "name": "StreetXO",
      "coord": [
        40.42995,
        -3.687745
      ],
      "desc": "Notable landmark in Spain: StreetXO with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Truly memorable meal experience."
    },
    {
      "name": "Sala de Despiece",
      "coord": [
        42.917903,
        -3.576555
      ],
      "desc": "Notable landmark in Spain: Sala de Despiece with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Essential dining experience."
    },
    {
      "name": "Sacha",
      "coord": [
        41.155668,
        1.107599
      ],
      "desc": "Notable landmark in Spain: Sacha with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Essential dining experience."
    },
    {
      "name": "La Bola",
      "coord": [
        42.276846,
        -2.672553
      ],
      "desc": "Notable landmark in Spain: La Bola with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Essential dining experience."
    },
    {
      "name": "Casa Dani (tortilla)",
      "coord": [
        41.361047,
        2.097279
      ],
      "desc": "Notable landmark in Spain: Casa Dani (tortilla) with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Truly memorable meal experience."
    },
    {
      "name": "Lhardy",
      "coord": [
        40.416608,
        -3.701378
      ],
      "desc": "Notable landmark in Spain: Lhardy with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Essential dining experience."
    },
    {
      "name": "Taberna El Sur",
      "coord": [
        43.473212,
        -5.440147
      ],
      "desc": "Notable landmark in Spain: Taberna El Sur with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Beloved spot worth seeking out."
    },
    {
      "name": "Bodega de la Ardosa",
      "coord": [
        40.423769,
        -3.701775
      ],
      "desc": "Notable landmark in Spain: Bodega de la Ardosa with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Truly memorable meal experience."
    },
    {
      "name": "Angelita Madrid",
      "coord": [
        40.420352,
        -3.700373
      ],
      "desc": "Notable landmark in Madrid: Angelita Madrid with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Essential dining experience."
    },
    {
      "name": "Sala Alcalá 39 (cocktail)",
      "coord": [
        40.484746,
        -3.36734
      ],
      "desc": "Notable landmark in Spain: Sala Alcalá 39 (cocktail) with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Essential dining experience."
    },
    {
      "name": "Chocolatería San Ginés",
      "coord": [
        40.444335,
        -3.67415
      ],
      "desc": "Notable landmark in Spain: Chocolatería San Ginés with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Highly recommended for food lovers."
    },
    {
      "name": "Tostado Café Club",
      "coord": [
        40.415913,
        -3.705746
      ],
      "desc": "Notable landmark in Spain: Tostado Café Club with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Truly memorable meal experience."
    },
    {
      "name": "Salmon Guru",
      "coord": [
        40.414902,
        -3.699534
      ],
      "desc": "Notable landmark in Spain: Salmon Guru with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Truly memorable meal experience."
    },
    {
      "name": "1862 Dry Bar",
      "coord": [
        42.358611,
        1.639361
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #2",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Truly memorable meal experience."
    },
    {
      "name": "Del Diego",
      "coord": [
        40.6706,
        -5.344617
      ],
      "desc": "Notable landmark in Spain: Del Diego with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Highly recommended for food lovers."
    },
    {
      "name": "Bad Company 1920",
      "coord": [
        40.4256,
        -3.7085
      ],
      "desc": "Notable landmark in Spain: Bad Company 1920 with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Truly memorable meal experience."
    },
    {
      "name": "La Venencia",
      "coord": [
        36.688545,
        -6.127635
      ],
      "desc": "Notable landmark in Spain: La Venencia with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Essential dining experience."
    },
    {
      "name": "Pensión Mimosas",
      "coord": [
        43.31815,
        -1.980713
      ],
      "desc": "Notable landmark in Spain: Pensión Mimosas with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Highly recommended for food lovers."
    },
    {
      "name": "Asador Etxebarri",
      "coord": [
        43.244772,
        -2.895382
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #3",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Truly memorable meal experience."
    },
    {
      "name": "El Celler de Can Roca",
      "coord": [
        41.993401,
        2.807767
      ],
      "desc": "Notable landmark in Spain: El Celler de Can Roca with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Truly memorable meal experience."
    },
    {
      "name": "Martín Berasategui",
      "coord": [
        43.266773,
        -2.015453
      ],
      "desc": "Notable landmark in Spain: Martín Berasategui with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Beloved spot worth seeking out Consistently delivers memorable dining experiences."
    },
    {
      "name": "Arzak",
      "coord": [
        43.284265,
        -2.000988
      ],
      "desc": "Notable landmark in Spain: Arzak with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Highly recommended for food lovers."
    },
    {
      "name": "Akelarre",
      "coord": [
        43.186611,
        -1.960416
      ],
      "desc": "Notable landmark in Spain: Akelarre with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Highly recommended for food lovers."
    },
    {
      "name": "Mugaritz",
      "coord": [
        43.272362,
        -1.917226
      ],
      "desc": "Notable landmark in Spain: Mugaritz with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Highly recommended for food lovers."
    },
    {
      "name": "Elkano",
      "coord": [
        42.831201,
        -1.546444
      ],
      "desc": "Notable landmark in Spain: Elkano with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Beloved spot worth seeking out A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Borda Berri",
      "coord": [
        43.19351,
        -1.895681
      ],
      "desc": "Notable landmark in Spain: Borda Berri with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Highly recommended for food lovers."
    },
    {
      "name": "La Viña",
      "coord": [
        36.743497,
        -4.101068
      ],
      "desc": "Notable landmark in Spain: La Viña with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Truly memorable meal experience."
    },
    {
      "name": "Ganbara",
      "coord": [
        43.288125,
        -1.836838
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #4",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Beloved spot worth seeking out Highly recommended by food critics and locals alike."
    },
    {
      "name": "Bar Néstor",
      "coord": [
        39.444293,
        -0.344029
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #5",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Highly recommended for food lovers."
    },
    {
      "name": "Casa Urola",
      "coord": [
        40.41955,
        -3.70555
      ],
      "desc": "Notable landmark in Spain: Casa Urola with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Highly recommended for food lovers."
    },
    {
      "name": "Atari Gastroteka",
      "coord": [
        43.323676,
        -1.986478
      ],
      "desc": "Notable landmark in Spain: Atari Gastroteka with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Essential dining experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Azurmendi",
      "coord": [
        42.920615,
        -1.96875
      ],
      "desc": "Notable landmark in Spain: Azurmendi with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Beloved spot worth seeking out Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Nerua Guggenheim Bilbao",
      "coord": [
        43.268861,
        -2.932549
      ],
      "desc": "Notable landmark in Bilbao: Nerua Guggenheim Bilbao with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Beloved spot worth seeking out Consistently delivers memorable dining experiences."
    },
    {
      "name": "La Graine",
      "coord": [
        43.262,
        -2.929
      ],
      "desc": "Notable landmark in Spain: La Graine with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Beloved spot worth seeking out Highly recommended by food critics and locals alike."
    },
    {
      "name": "Cañabota",
      "coord": [
        37.393433,
        -5.993629
      ],
      "desc": "Notable landmark in Spain: Cañabota with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Essential dining experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Abantal",
      "coord": [
        37.387929,
        -5.983714
      ],
      "desc": "Notable landmark in Spain: Abantal with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Beloved spot worth seeking out Worth seeking out for authentic regional flavors."
    },
    {
      "name": "El Rinconcillo",
      "coord": [
        36.155856,
        -5.446565
      ],
      "desc": "Notable landmark in Spain: El Rinconcillo with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Highly recommended for food lovers."
    },
    {
      "name": "La Brunilda Tapas",
      "coord": [
        37.388319,
        -5.999398
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #6",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Essential dining experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Eslava",
      "coord": [
        42.564361,
        -1.45947
      ],
      "desc": "Notable landmark in Spain: Eslava with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Beloved spot worth seeking out Consistently delivers memorable dining experiences."
    },
    {
      "name": "Aponiente",
      "coord": [
        36.603344,
        -6.216692
      ],
      "desc": "Notable landmark in Spain: Aponiente with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Beloved spot worth seeking out Highly recommended by food critics and locals alike."
    },
    {
      "name": "Ricard Camarena Restaurant",
      "coord": [
        39.485224,
        -0.385116
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastronomy",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Truly memorable meal experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Quique Dacosta",
      "coord": [
        38.853737,
        0.085103
      ],
      "desc": "Notable landmark in Spain: Quique Dacosta with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Essential dining experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Marc Fosh",
      "coord": [
        39.573644,
        2.651318
      ],
      "desc": "Notable landmark in Spain: Marc Fosh with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Essential dining experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Casa Jondal",
      "coord": [
        38.868477,
        1.316037
      ],
      "desc": "Notable landmark in Spain: Casa Jondal with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Essential dining experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Ofelia Bakery",
      "coord": [
        37.390193,
        -5.991766
      ],
      "desc": "Notable landmark in Spain: Ofelia Bakery with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Truly memorable meal experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "La Cacharrería",
      "coord": [
        37.3946828,
        -5.991436
      ],
      "desc": "Notable landmark in Spain: La Cacharrería with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Essential dining experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Irrintz",
      "coord": [
        43.3238342,
        -1.9836383
      ],
      "desc": "Notable landmark in Spain: Irrintz with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Beloved spot worth seeking out A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "KAÑABIKAÑA Craft Beer Shop",
      "coord": [
        43.325378,
        -1.9744458
      ],
      "desc": "Notable landmark in Spain: KAÑABIKAÑA Craft Beer Shop with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Truly memorable meal experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Bodegon Alejandro",
      "coord": [
        43.3236037,
        -1.9834505
      ],
      "desc": "Notable landmark in Spain: Bodegon Alejandro with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Essential dining experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Oiartzun",
      "coord": [
        43.3221239,
        -1.9854938
      ],
      "desc": "Notable landmark in Spain: Oiartzun with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Essential dining experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Parrilla Txuleta",
      "coord": [
        43.3241418,
        -1.9859155
      ],
      "desc": "Notable landmark in Spain: Parrilla Txuleta with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Highly recommended for food lovers Consistently delivers memorable dining experiences."
    },
    {
      "name": "Goiz-Argi",
      "coord": [
        43.3236111,
        -1.9833333
      ],
      "desc": "Notable landmark in Spain: Goiz-Argi with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Truly memorable meal experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Cervecerías La Mejillonera San Sebastian",
      "coord": [
        43.3232572,
        -1.9865099
      ],
      "desc": "Notable landmark in Spain: Cervecerías La Mejillonera San Sebastian with regi...",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Truly memorable meal experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Zabaleta taberna",
      "coord": [
        43.3251612,
        -1.9734932
      ],
      "desc": "Notable landmark in Spain: Zabaleta taberna with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Truly memorable meal experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Antonio taberna",
      "coord": [
        43.3197231,
        -1.9806282
      ],
      "desc": "Notable landmark in Spain: Antonio taberna with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Highly recommended for food lovers A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "La Cepa de Bernardo",
      "coord": [
        43.3243034,
        -1.9850321
      ],
      "desc": "Notable landmark in Spain: La Cepa de Bernardo with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Truly memorable meal experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Agorregi Jatetxea",
      "coord": [
        43.3024065,
        -2.0118801
      ],
      "desc": "Notable landmark in Spain: Agorregi Jatetxea with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Essential dining experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Txoko Jatetxea",
      "coord": [
        43.3233275,
        -1.9872798
      ],
      "desc": "Notable landmark in Spain: Txoko Jatetxea with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Highly recommended for food lovers Highly recommended by food critics and locals alike."
    },
    {
      "name": "Kokotxa Jatetxea",
      "coord": [
        43.3236308,
        -1.9871135
      ],
      "desc": "Notable landmark in Spain: Kokotxa Jatetxea with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Truly memorable meal experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "BAR SPORT",
      "coord": [
        43.323493,
        -1.9837105
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #7",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Truly memorable meal experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Casa Senra Donostia",
      "coord": [
        43.3245353,
        -1.9728287
      ],
      "desc": "Notable landmark in Spain: Casa Senra Donostia with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Beloved spot worth seeking out A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Astelena",
      "coord": [
        43.3242241,
        -1.9824202
      ],
      "desc": "Notable landmark in Spain: Astelena with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Highly recommended for food lovers Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Iturrioz",
      "coord": [
        43.3173727,
        -1.9824629
      ],
      "desc": "Notable landmark in Spain: Iturrioz with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Highly recommended for food lovers Consistently delivers memorable dining experiences."
    },
    {
      "name": "Bar Zeruko",
      "coord": [
        43.3238,
        -1.983708
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #8",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Highly recommended for food lovers Highly recommended by food critics and locals alike."
    },
    {
      "name": "La Cuchara de San Telmo",
      "coord": [
        43.3245016,
        -1.9853227
      ],
      "desc": "Notable landmark in Spain: La Cuchara de San Telmo with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Beloved spot worth seeking out A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Bar Txepetxa",
      "coord": [
        43.3237381,
        -1.9840577
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #9",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Highly recommended for food lovers Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Saisha",
      "coord": [
        43.3250272,
        -1.9745637
      ],
      "desc": "Notable landmark in Spain: Saisha with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Truly memorable meal experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Mercado de la Corredera. Plaza de las Cañas.",
      "coord": [
        39.9984,
        -3.701
      ],
      "desc": "Vibrant local market in Spain with fresh produce and regional specialties",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Beloved spot worth seeking out Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Mercat D'Olivar",
      "coord": [
        39.9992,
        -3.7
      ],
      "desc": "Notable landmark in Spain: Mercat D'Olivar with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Highly recommended for food lovers Consistently delivers memorable dining experiences."
    },
    {
      "name": "Mercado de Sanlúcar de Barrameda",
      "coord": [
        40.0,
        -3.699
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #10",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Highly recommended for food lovers Highly recommended by food critics and locals alike."
    },
    {
      "name": "Mercado Abastos Barbate",
      "coord": [
        40.0008,
        -3.698
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #11",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Essential dining experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Mercado central a domicilio",
      "coord": [
        40.0016,
        -3.702
      ],
      "desc": "Vibrant local market in Spain with fresh produce and regional specialt #2",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Beloved spot worth seeking out Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Mercado Central de Abastos de Cádiz",
      "coord": [
        40.0024,
        -3.701
      ],
      "desc": "Vibrant local market in Spain with fresh produce and regional specialt #3",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Beloved spot worth seeking out A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Central Market of Valencia",
      "coord": [
        39.4723,
        -0.3773
      ],
      "desc": "Vibrant local market in Valencia with fresh produce and regional specialties",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Beloved spot worth seeking out Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Ca's Patró March",
      "coord": [
        39.5672,
        2.6502
      ],
      "desc": "Notable landmark in Spain: Ca's Patró March with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Essential dining experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Hauser & Wirth Menorca",
      "coord": [
        39.9488,
        4.1094
      ],
      "desc": "Notable landmark in Spain: Hauser & Wirth Menorca with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Beloved spot worth seeking out Highly recommended by food critics and locals alike."
    },
    {
      "name": "Fontenille Menorca Torre Vella",
      "coord": [
        39.9496,
        4.1104
      ],
      "desc": "Notable landmark in Spain: Fontenille Menorca Torre Vella with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Highly recommended for food lovers A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "La Calita",
      "coord": [
        39.9504,
        4.1114
      ],
      "desc": "Notable landmark in Spain: La Calita with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Essential dining experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Alcaufar Vell",
      "coord": [
        39.9512,
        4.1124
      ],
      "desc": "Notable landmark in Spain: Alcaufar Vell with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Beloved spot worth seeking out A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Cap Roig",
      "coord": [
        39.952,
        4.1084
      ],
      "desc": "Notable landmark in Spain: Cap Roig with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Beloved spot worth seeking out Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "La Casa del Abuelo",
      "coord": [
        39.9984,
        -3.7
      ],
      "desc": "Notable landmark in Spain: La Casa del Abuelo with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Truly memorable meal experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Ozik : 카페 오직",
      "coord": [
        37.3883,
        -5.9845
      ],
      "desc": "Notable landmark in Spain: Ozik : 카페 오직 with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Essential dining experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Pura Vida Café",
      "coord": [
        37.3891,
        -5.9835
      ],
      "desc": "Notable landmark in Spain: Pura Vida Café with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Essential dining experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Utopía Café",
      "coord": [
        37.3899,
        -5.9825
      ],
      "desc": "Notable landmark in Spain: Utopía Café with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Essential dining experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Alfonsito",
      "coord": [
        37.3907,
        -5.9865
      ],
      "desc": "Notable landmark in Spain: Alfonsito with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Truly memorable meal experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Borbotea Coffee Lab",
      "coord": [
        37.3915,
        -5.9855
      ],
      "desc": "Notable landmark in Spain: Borbotea Coffee Lab with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Essential dining experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Delatribu Specialty Coffee",
      "coord": [
        37.3867,
        -5.9845
      ],
      "desc": "Notable landmark in Spain: Delatribu Specialty Coffee with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Beloved spot worth seeking out Consistently delivers memorable dining experiences."
    },
    {
      "name": "Syra Coffee - Tetuan",
      "coord": [
        37.3875,
        -5.9835
      ],
      "desc": "Notable landmark in Spain: Syra Coffee - Tetuan with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Truly memorable meal experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Syra Coffee- Alvarez Quintero",
      "coord": [
        37.3883,
        -5.9825
      ],
      "desc": "Notable landmark in Spain: Syra Coffee- Alvarez Quintero with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Essential dining experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "JESTER Specialty Coffee & Juice",
      "coord": [
        37.3891,
        -5.9865
      ],
      "desc": "Notable landmark in Spain: JESTER Specialty Coffee & Juice with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Essential dining experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Parcería Café",
      "coord": [
        37.3899,
        -5.9855
      ],
      "desc": "Notable landmark in Spain: Parcería Café with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Highly recommended for food lovers A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Virgen Coffee",
      "coord": [
        37.3907,
        -5.9845
      ],
      "desc": "Notable landmark in Spain: Virgen Coffee with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Truly memorable meal experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "MUY Coffee",
      "coord": [
        37.3915,
        -5.9835
      ],
      "desc": "Notable landmark in Spain: MUY Coffee with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Truly memorable meal experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Casa Matías",
      "coord": [
        40.0024,
        -3.698
      ],
      "desc": "Notable landmark in Spain: Casa Matías with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Truly memorable meal experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "La Macetilla - Taberna Andaluza y Restaurante en Granada",
      "coord": [
        37.1797,
        -3.5966
      ],
      "desc": "Fine dining restaurant in Granada specializing in innovative Spanish gastronomy",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Highly recommended for food lovers A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Bar Patio Braserito",
      "coord": [
        40.42005,
        -3.70505
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #12",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Truly memorable meal experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Casa Castañeda",
      "coord": [
        40.41955,
        -3.70255
      ],
      "desc": "Notable landmark in Spain: Casa Castañeda with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Essential dining experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "La Botillería",
      "coord": [
        40.42005,
        -3.70055
      ],
      "desc": "Notable landmark in Spain: La Botillería with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Highly recommended for food lovers Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Puerta del Carmen",
      "coord": [
        40.41732,
        -3.70394
      ],
      "desc": "Notable landmark in Spain: Puerta del Carmen with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Truly memorable meal experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Los Diamantes",
      "coord": [
        40.41659,
        -3.70387
      ],
      "desc": "Notable landmark in Spain: Los Diamantes with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Truly memorable meal experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Casa Pasteles Albayzin",
      "coord": [
        40.41641,
        -3.7028
      ],
      "desc": "Notable landmark in Spain: Casa Pasteles Albayzin with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Beloved spot worth seeking out A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Bar Aliatar Los Caracoles",
      "coord": [
        39.9976,
        -3.7
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #13",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Highly recommended for food lovers Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Bar Gallardo",
      "coord": [
        39.9984,
        -3.699
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #14",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Highly recommended for food lovers A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Restaurante Oliver",
      "coord": [
        39.9992,
        -3.698
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #2",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Highly recommended for food lovers Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Taberna La Tana",
      "coord": [
        40.0,
        -3.702
      ],
      "desc": "Notable landmark in Spain: Taberna La Tana with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Beloved spot worth seeking out Consistently delivers memorable dining experiences."
    },
    {
      "name": "Sal Gorda Halo",
      "coord": [
        40.0008,
        -3.701
      ],
      "desc": "Notable landmark in Spain: Sal Gorda Halo with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Highly recommended for food lovers Highly recommended by food critics and locals alike."
    },
    {
      "name": "Bar La Almadraba Sevilla",
      "coord": [
        40.0016,
        -3.7
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #15",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Truly memorable meal experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Las Banderillas",
      "coord": [
        40.0024,
        -3.699
      ],
      "desc": "Notable landmark in Spain: Las Banderillas with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Beloved spot worth seeking out Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Domi Vélez Bakery",
      "coord": [
        39.9976,
        -3.698
      ],
      "desc": "Notable landmark in Spain: Domi Vélez Bakery with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Highly recommended for food lovers A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "La Casa Fundida",
      "coord": [
        40.41355,
        -3.70705
      ],
      "desc": "Notable landmark in Spain: La Casa Fundida with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Highly recommended for food lovers Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Casa Ricardo antigua Casa Ovidio",
      "coord": [
        40.41405,
        -3.70505
      ],
      "desc": "Notable landmark in Spain: Casa Ricardo antigua Casa Ovidio with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Essential dining experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Bodeguita Romero",
      "coord": [
        37.259,
        -3.599
      ],
      "desc": "Notable landmark in Spain: Bodeguita Romero with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Beloved spot worth seeking out Highly recommended by food critics and locals alike."
    },
    {
      "name": "Convento de Madre de Dios",
      "coord": [
        40.41355,
        -3.70105
      ],
      "desc": "Notable landmark in Spain: Convento de Madre de Dios with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Beloved spot worth seeking out A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Paella e Hijos. Casa de Arroces Valencianos",
      "coord": [
        39.4707,
        -0.3753
      ],
      "desc": "Notable landmark in Valencia: Paella e Hijos. Casa de Arroces Valencia with r...",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Beloved spot worth seeking out Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Casa Eme",
      "coord": [
        40.41555,
        -3.70505
      ],
      "desc": "Notable landmark in Spain: Casa Eme with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Essential dining experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Bar Paco Góngora",
      "coord": [
        40.41505,
        -3.70255
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #16",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Beloved spot worth seeking out Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Bodeguita Antonio Romero",
      "coord": [
        37.261,
        -3.601
      ],
      "desc": "Notable landmark in Spain: Bodeguita Antonio Romero with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Highly recommended for food lovers Consistently delivers memorable dining experiences."
    },
    {
      "name": "Mesones del Serranito Arenal",
      "coord": [
        40.41555,
        -3.70055
      ],
      "desc": "Notable landmark in Spain: Mesones del Serranito Arenal with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Essential dining experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "LA ANTIGUA ABACERÍA. TRIANA",
      "coord": [
        40.41655,
        -3.70555
      ],
      "desc": "Notable landmark in Spain: LA ANTIGUA ABACERÍA. TRIANA with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Beloved spot worth seeking out A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Restaurante Casa Cuesta",
      "coord": [
        40.41705,
        -3.70355
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #3",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Beloved spot worth seeking out Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Las Golondrinas - Pagés del Corro",
      "coord": [
        40.0016,
        -3.701
      ],
      "desc": "Notable landmark in Spain: Las Golondrinas - Pagés del Corro with regional charm",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Truly memorable meal experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Cervecería La Grande - López de Gomara",
      "coord": [
        40.41655,
        -3.70105
      ],
      "desc": "Notable landmark in Spain: Cervecería La Grande - López de Gomara with region...",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Essential dining experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Bar Santa Ana",
      "coord": [
        40.41805,
        -3.70705
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #17",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Essential dining experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Bodega Mateo Ruiz",
      "coord": [
        40.41805,
        -3.70555
      ],
      "desc": "Notable landmark in Spain: Bodega Mateo Ruiz with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Essential dining experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Bodega El Picadero",
      "coord": [
        40.41805,
        -3.70405
      ],
      "desc": "Notable landmark in Spain: Bodega El Picadero with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Truly memorable meal experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Repostería Portuguesa Lisboa",
      "coord": [
        40.41805,
        -3.70255
      ],
      "desc": "Notable landmark in Spain: Repostería Portuguesa Lisboa with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Essential dining experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "La Quinta Brasería",
      "coord": [
        40.41805,
        -3.70105
      ],
      "desc": "Notable landmark in Spain: La Quinta Brasería with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Beloved spot worth seeking out A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Catalina Casa de Comidas",
      "coord": [
        40.41955,
        -3.70705
      ],
      "desc": "Notable landmark in Spain: Catalina Casa de Comidas with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Truly memorable meal experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Arte y Sabor Tapas",
      "coord": [
        40.41671,
        -3.7046
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #18",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Essential dining experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "La Sra Pop",
      "coord": [
        39.9976,
        -3.702
      ],
      "desc": "Notable landmark in Spain: La Sra Pop with regional charm",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Essential dining experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "La Azotea, La Tienda Tapas",
      "coord": [
        40.41955,
        -3.70405
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #19",
      "longDesc": "Traditional Spanish restaurant celebrating regional flavors through carefully prepared dishes using quality seasonal ingredients Highly recommended for food lovers A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Vega 10",
      "coord": [
        40.42005,
        -3.70205
      ],
      "desc": "Notable landmark in Spain: Vega 10 with regional charm",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Truly memorable meal experience Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Taberna Coloniales",
      "coord": [
        40.4167,
        -3.70477
      ],
      "desc": "Notable landmark in Spain: Taberna Coloniales with regional charm",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Truly memorable meal experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Bar Santa Cruz “Las Columnas”",
      "coord": [
        40.41599,
        -3.70454
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #20",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Truly memorable meal experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "VINERIA SAN TELMO",
      "coord": [
        40.41591,
        -3.70476
      ],
      "desc": "Notable landmark in Spain: VINERIA SAN TELMO with regional charm",
      "longDesc": "Lively tapas and pintxo bar capturing the social spirit of Spanish dining with small plates and social energy Highly recommended for food lovers Consistently delivers memorable dining experiences."
    },
    {
      "name": "Arrocería Criaito Triana",
      "coord": [
        40.41711,
        -3.70381
      ],
      "desc": "Notable landmark in Spain: Arrocería Criaito Triana with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Truly memorable meal experience Highly recommended by food critics and locals alike."
    },
    {
      "name": "Restaurante De La O",
      "coord": [
        40.41688,
        -3.70358
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #4",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Essential dining experience A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "El Disparate",
      "coord": [
        40.41661,
        -3.70339
      ],
      "desc": "Notable landmark in Spain: El Disparate with regional charm",
      "longDesc": "Farm-to-table restaurant emphasizing seasonal ingredients, local sourcing, and responsive cooking philosophy Highly recommended for food lovers Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Mano De Santo",
      "coord": [
        40.41723,
        -3.7038
      ],
      "desc": "Notable landmark in Spain: Mano De Santo with regional charm",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Truly memorable meal experience A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Bar Dos de Mayo",
      "coord": [
        40.41643,
        -3.70414
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #21",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Truly memorable meal experience Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Gelateria Mito",
      "coord": [
        40.41608,
        -3.70327
      ],
      "desc": "Notable landmark in Spain: Gelateria Mito with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences."
    },
    {
      "name": "Pelayo Bar",
      "coord": [
        40.41771,
        -3.70468
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #22",
      "longDesc": "Local favorite known for authentic cooking, family recipes, and welcoming atmosphere that draws neighborhood regulars Highly recommended for food lovers Highly recommended by food critics and locals alike."
    },
    {
      "name": "Restaurante El Pintón | Restaurante en el centro de Sevilla",
      "coord": [
        40.41638,
        -3.7043
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #5",
      "longDesc": "Seafood-focused establishment featuring market-fresh catches prepared simply to highlight natural flavors Highly recommended for food lovers A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "Mechela Arenal",
      "coord": [
        40.41778,
        -3.70443
      ],
      "desc": "Notable landmark in Spain: Mechela Arenal with regional charm",
      "longDesc": "Restaurant dedicated to regional Spanish traditions, honoring time-tested recipes with contemporary execution Highly recommended for food lovers Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Bar El Comercio",
      "coord": [
        40.41405,
        -3.70655
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #23",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere."
    },
    {
      "name": "Filo",
      "coord": [
        40.41355,
        -3.70405
      ],
      "desc": "Notable landmark in Spain: Filo with regional charm",
      "longDesc": "Neighborhood institution cherished by locals for consistent quality, warm service, and authentic regional cooking Highly recommended for food lovers Essential for anyone serious about Spanish cuisine."
    },
    {
      "name": "Container",
      "coord": [
        40.41355,
        -3.70255
      ],
      "desc": "Notable landmark in Spain: Container with regional charm",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Truly memorable meal experience Consistently delivers memorable dining experiences."
    },
    {
      "name": "Lalola de Javi Abascal",
      "coord": [
        40.41405,
        -3.70055
      ],
      "desc": "Notable landmark in Spain: Lalola de Javi Abascal with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 2)"
    },
    {
      "name": "Restaurante Arabesca",
      "coord": [
        40.41555,
        -3.70655
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #6",
      "longDesc": "Wine-centric establishment pairing carefully selected wines with thoughtfully prepared Spanish cuisine Highly recommended for food lovers A must-visit for savoring traditional Spanish cooking."
    },
    {
      "name": "LA BARRA DE CAÑABOTA",
      "coord": [
        40.41505,
        -3.70405
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #24",
      "longDesc": "Casual dining spot celebrating Spanish street food traditions in relaxed, friendly atmosphere Highly recommended for food lovers Worth seeking out for authentic regional flavors."
    },
    {
      "name": "Casa Manolo León",
      "coord": [
        40.41555,
        -3.70205
      ],
      "desc": "Notable landmark in Spain: Casa Manolo León with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 3)"
    },
    {
      "name": "Barra Baja Restaurante",
      "coord": [
        40.41762,
        -3.70421
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #25",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 2)"
    },
    {
      "name": "Café da Garagem",
      "coord": [
        40.41655,
        -3.70705
      ],
      "desc": "Notable landmark in Spain: Café da Garagem with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 4)"
    },
    {
      "name": "Bar Típico barra de tapas",
      "coord": [
        40.41705,
        -3.70505
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #26",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 3)"
    },
    {
      "name": "Patio San Eloy",
      "coord": [
        40.41655,
        -3.70255
      ],
      "desc": "Notable landmark in Spain: Patio San Eloy with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 5)"
    },
    {
      "name": "Lola por Dios Alameda",
      "coord": [
        40.41698,
        -3.70335
      ],
      "desc": "Notable landmark in Spain: Lola por Dios Alameda with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 6)"
    },
    {
      "name": "Bar Casa Morales",
      "coord": [
        40.41705,
        -3.70055
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #27",
      "longDesc": "Contemporary Spanish restaurant with skilled kitchen applying modern technique to traditional ingredients Highly recommended for food lovers A beloved local favorite drawing food enthusiasts."
    },
    {
      "name": "Bar Alfalfa",
      "coord": [
        40.41855,
        -3.70655
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #28",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 4)"
    },
    {
      "name": "Casa Balbino",
      "coord": [
        40.41855,
        -3.70505
      ],
      "desc": "Notable landmark in Spain: Casa Balbino with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 7)"
    },
    {
      "name": "Casa Pepe de La Judería",
      "coord": [
        40.41855,
        -3.70355
      ],
      "desc": "Notable landmark in Spain: Casa Pepe de La Judería with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 8)"
    },
    {
      "name": "Horno y Pastelería Alfonso Martínez",
      "coord": [
        40.41855,
        -3.70205
      ],
      "desc": "Notable landmark in Spain: Horno y Pastelería Alfonso Martínez with regional ...",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 9)"
    },
    {
      "name": "Casa Centduros",
      "coord": [
        40.41855,
        -3.70055
      ],
      "desc": "Notable landmark in Spain: Casa Centduros with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 10)"
    },
    {
      "name": "Casa Carmela",
      "coord": [
        40.42005,
        -3.70655
      ],
      "desc": "Notable landmark in Spain: Casa Carmela with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 11)"
    },
    {
      "name": "Monastery of Corpus Christi las Carboneras",
      "coord": [
        40.41766,
        -3.70296
      ],
      "desc": "Notable landmark in Spain: Monastery of Corpus Christi las Carboner with regi...",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 12)"
    },
    {
      "name": "Plaça d'Ibanyes",
      "coord": [
        40.41764,
        -3.70451
      ],
      "desc": "Notable landmark in Spain: Plaça d'Ibanyes with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 13)"
    },
    {
      "name": "Avancher Hôtel & Lodge - Restaurant & Bar - Massage & Coaching sportif",
      "coord": [
        40.42005,
        -3.70355
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #29",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 5)"
    },
    {
      "name": "Mesón Mariano",
      "coord": [
        40.41955,
        -3.70105
      ],
      "desc": "Notable landmark in Spain: Mesón Mariano with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 14)"
    },
    {
      "name": "Alqueria de L'horta",
      "coord": [
        40.41705,
        -3.70464
      ],
      "desc": "Notable landmark in Spain: Alqueria de L'horta with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 15)"
    },
    {
      "name": "SeBE",
      "coord": [
        40.41732,
        -3.70337
      ],
      "desc": "Notable landmark in Spain: SeBE with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 16)"
    },
    {
      "name": "La Curiosa",
      "coord": [
        40.41642,
        -3.70396
      ],
      "desc": "Notable landmark in Spain: La Curiosa with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 17)"
    },
    {
      "name": "Taberna El tío de La Tiza",
      "coord": [
        40.41612,
        -3.70311
      ],
      "desc": "Notable landmark in Spain: Taberna El tío de La Tiza with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 18)"
    },
    {
      "name": "Taberna Arrantzale",
      "coord": [
        40.41591,
        -3.70454
      ],
      "desc": "Notable landmark in Spain: Taberna Arrantzale with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 19)"
    },
    {
      "name": "Catalina La Barra",
      "coord": [
        40.41757,
        -3.70357
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #30",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 6)"
    },
    {
      "name": "Restaurante Casa Domingo",
      "coord": [
        40.41682,
        -3.70324
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #7",
      "longDesc": "Culinary destination in Spain presenting inventive Spanish dishes prepared by acclaimed chefs, earning recognition for gastronomic excellence. A must-see destination for travelers seeking authentic cultural experiences."
    },
    {
      "name": "Restaurante El Faro de Cádiz",
      "coord": [
        40.41691,
        -3.70359
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #8",
      "longDesc": "Culinary destination in Spain presenting inventive Spanish dishes prepared by acclaimed chefs, earning recognition for gastronomic excellence. A must-see destination for travelers seeking authentic cultural experiences. (variant 2)"
    },
    {
      "name": "Habanero Taquería",
      "coord": [
        40.41664,
        -3.70445
      ],
      "desc": "Notable landmark in Spain: Habanero Taquería with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 20)"
    },
    {
      "name": "La Trastienda",
      "coord": [
        40.41765,
        -3.70319
      ],
      "desc": "Notable landmark in Spain: La Trastienda with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 21)"
    },
    {
      "name": "Rincón de Rodri",
      "coord": [
        40.41619,
        -3.70326
      ],
      "desc": "Notable landmark in Spain: Rincón de Rodri with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 22)"
    },
    {
      "name": "Taberna Andaluza",
      "coord": [
        40.4162,
        -3.70395
      ],
      "desc": "Notable landmark in Spain: Taberna Andaluza with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 23)"
    },
    {
      "name": "SENTO",
      "coord": [
        40.41355,
        -3.70555
      ],
      "desc": "Notable landmark in Spain: SENTO with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 24)"
    },
    {
      "name": "Parking Pizza MARIMÓN / Parking Sótano",
      "coord": [
        40.41405,
        -3.70355
      ],
      "desc": "Scenic urban park in Spain perfect for families and leisurely strolls",
      "longDesc": "Beautiful urban park in Spain offering green spaces, walking paths, playgrounds, and peaceful escapes from city bustle for all ages."
    },
    {
      "name": "Amateur",
      "coord": [
        40.41405,
        -3.70205
      ],
      "desc": "Notable landmark in Spain: Amateur with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 25)"
    },
    {
      "name": "Espacio Eslava",
      "coord": [
        40.41505,
        -3.70705
      ],
      "desc": "Notable landmark in Spain: Espacio Eslava with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 26)"
    },
    {
      "name": "La Finca",
      "coord": [
        40.41505,
        -3.70555
      ],
      "desc": "Notable landmark in Spain: La Finca with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 27)"
    },
    {
      "name": "La Gran Taberna",
      "coord": [
        40.41555,
        -3.70355
      ],
      "desc": "Notable landmark in Spain: La Gran Taberna with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 28)"
    },
    {
      "name": "Mesón Sabor Andaluz",
      "coord": [
        40.41505,
        -3.70105
      ],
      "desc": "Notable landmark in Spain: Mesón Sabor Andaluz with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 29)"
    },
    {
      "name": "Confitería La Campana",
      "coord": [
        40.41772,
        -3.70372
      ],
      "desc": "Notable landmark in Spain: Confitería La Campana with regional charm",
      "longDesc": "Remarkable Spain landmark offering unique insights into regional culture, history, and traditions with memorable experiences for all visitors. A must-see destination for travelers seeking authentic cultural experiences. (variant 30)"
    },
    {
      "name": "Bar Picantón Sevilla",
      "coord": [
        40.41705,
        -3.70655
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #31",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 7)"
    },
    {
      "name": "Restaurante Antonio",
      "coord": [
        40.41655,
        -3.70405
      ],
      "desc": "Fine dining restaurant in Spain specializing in innovative Spanish gastron #9",
      "longDesc": "Culinary destination in Spain presenting inventive Spanish dishes prepared by acclaimed chefs, earning recognition for gastronomic excellence. A must-see destination for travelers seeking authentic cultural experiences. (variant 3)"
    },
    {
      "name": "Venta Bar El Toro",
      "coord": [
        40.41705,
        -3.70205
      ],
      "desc": "Traditional Spanish tapas and pintxos in Spain, featuring local wines and jam #32",
      "longDesc": "Authentic Spanish tapas experience in Spain Old Town, where locals gather for pintxos, jamón, and regional wines in a vibrant, convivial atmosphere. (variant 8)"
    }
  ],
  "experiences": [
    {
      "name": "Visit La Sagrada Família",
      "coord": [
        41.4036,
        2.1744
      ],
      "desc": "Gaudí's soaring basilica masterpiece, organic spires, Barcelona",
      "longDesc": "Gaudí's unfinished architectural marvel features organic forms, towering spires, and intricate stone carvings. Still under construction, it remains Barcelona's most iconic symbol."
    },
    {
      "name": "Stroll Park Güell",
      "coord": [
        38.763922,
        -0.060967
      ],
      "desc": "Gaudí's mosaic wonderland, terraces, Barcelona city views",
      "longDesc": "Gaudí's whimsical park features colorful mosaic-tiled terraces, winding pathways, and breathtaking views of Barcelona from its hilltop location."
    },
    {
      "name": "Casa Batlló (Gaudí)",
      "coord": [
        41.361047,
        2.097279
      ],
      "desc": "Modernist masterpiece, undulating facades, mosaic-covered balconies",
      "longDesc": "Gaudí's most ornamental residential building features wavy stone facade, colorful mosaic tiles, and organic window designs inspired by nature."
    },
    {
      "name": "La Pedrera (Casa Milà)",
      "coord": [
        41.3954,
        2.161762
      ],
      "desc": "Gaudí's undulating apartment building, wrought-iron balconies, Barcelona",
      "longDesc": "Gaudí's residential masterpiece features organic stone facade with undulating waves, sculptural chimney-stacks, and innovative interior design."
    },
    {
      "name": "Gothic Quarter wander + tapas stop",
      "coord": [
        41.3851,
        2.1776
      ],
      "desc": "Barcelona's medieval quarter, narrow streets, tapas bars, historic atmosphere",
      "longDesc": "Explore Barcelona's ancient Roman-era Gothic Quarter with narrow medieval streets, plazas, and tapas bars in historic buildings."
    },
    {
      "name": "Picasso Museum",
      "coord": [
        41.385104,
        2.181202
      ],
      "desc": "Picasso's works from youth to maturity, Barcelona's art gem",
      "longDesc": "Barcelona's premier Picasso collection shows the artist's evolution from blue period through cubism with paintings, drawings, and engravings."
    },
    {
      "name": "Montjuïc: cable car + castle views",
      "coord": [
        36.40884,
        -5.189873
      ],
      "desc": "Montjuïc hilltop, cable car rides, fortress with panoramic views",
      "longDesc": "Hilltop fortress with funicular access offers 360-degree Barcelona views, museums, gardens, and cable car rides over the city."
    },
    {
      "name": "Barceloneta promenade + beach time",
      "coord": [
        41.3872,
        2.1932
      ],
      "desc": "Mediterranean beach, seafood restaurants, Barcelona seaside",
      "longDesc": "Barcelona's iconic beach neighborhood offers sandy shores, beachfront promenade with bars and restaurants, and authentic fishing village charm."
    },
    {
      "name": "Food market browsing at La Boqueria",
      "coord": [
        41.3819,
        2.1701
      ],
      "desc": "Barcelona's historic produce market, fresh goods, local vendors",
      "longDesc": "Barcelona's most famous market since 1840 offers fresh produce, seafood, jamón, and local specialties in a vibrant covered market setting."
    },
    {
      "name": "Tibidabo amusement park",
      "coord": [
        41.4222,
        2.1138
      ],
      "desc": "Barcelona's hilltop amusement park, views, vintage rides, fun",
      "longDesc": "Barcelona's historic amusement park atop Tibidabo mountain offers rides, restaurants, and 360-degree city and sea views."
    },
    {
      "name": "CosmoCaixa science museum",
      "coord": [
        41.3851,
        2.1764
      ],
      "desc": "Interactive science exhibits, planetarium, hands-on discovery",
      "longDesc": "Barcelona's premier science museum with planetarium, immersive exhibits, and interactive displays covering space, nature, and technology for all ages."
    },
    {
      "name": "Barcelona Aquarium",
      "coord": [
        41.37799,
        2.18329
      ],
      "desc": "Mediterranean marine life, underwater tunnel, 500+ species",
      "longDesc": "One of Europe's largest aquariums features Mediterranean species, a dramatic underwater tunnel, interactive touchpools, and marine education exhibits."
    },
    {
      "name": "Museo del Prado",
      "coord": [
        40.276096,
        -4.305703
      ],
      "desc": "Spain's premier art museum, Velázquez and Goya masterworks, Madrid",
      "longDesc": "World-renowned museum housing Spain's greatest paintings including Velázquez's Las Meninas and Goya's Black Paintings, spanning from 12th to 19th centuries."
    },
    {
      "name": "Reina Sofía Museum",
      "coord": [
        40.4082,
        -3.6943
      ],
      "desc": "Modern Spanish art, Picasso's Guernica, Madrid's contemporary",
      "longDesc": "Dedicated to 20th-century Spanish art, featuring Picasso's powerful Guernica, works by Dalí, Miró, and contemporary Spanish artists."
    },
    {
      "name": "Thyssen-Bornemisza Museum",
      "coord": [
        40.416216,
        -3.694932
      ],
      "desc": "European art spanning centuries, Impressionists to modern, Madrid",
      "longDesc": "Madrid's third major museum completes the art circuit with works from medieval to contemporary periods including Impressionists and modern masters."
    },
    {
      "name": "Royal Palace of Madrid",
      "coord": [
        40.41674,
        -3.713622
      ],
      "desc": "Europe's largest palace, royal rooms, throne halls, Madrid",
      "longDesc": "Spain's largest palace features opulent throne rooms, crystal chandeliers, frescoed ceilings, and royal apartments spanning centuries of monarchy."
    },
    {
      "name": "Retiro Park rowboats + playgrounds",
      "coord": [
        38.851485,
        0.08751
      ],
      "desc": "Madrid's central park, boating lake, gardens, family activities",
      "longDesc": "Madrid's largest park features a scenic lake for rowing, manicured gardens, statues, cafés, and playgrounds perfect for families."
    },
    {
      "name": "Gran Vía evening stroll",
      "coord": [
        39.673535,
        -1.607406
      ],
      "desc": "Madrid's grand boulevard, art deco architecture, evening lights",
      "longDesc": "Madrid's most famous avenue features belle-époque buildings, flagship stores, and vibrant evening energy with rooftop bars and dining."
    },
    {
      "name": "Mercado de San Miguel tapas sampling",
      "coord": [
        40.415374,
        -3.709015
      ],
      "desc": "Madrid's historic market, gourmet tapas, wine, jamón ibérico",
      "longDesc": "Upscale market in Madrid's heart offering jamón ibérico, fresh seafood, cheeses, and wines with standing-room tapas bars throughout."
    },
    {
      "name": "Churros at San Ginés",
      "coord": [
        40.4163,
        -3.7052
      ],
      "desc": "Madrid's iconic churro shop, crispy churros, thick hot chocolate",
      "longDesc": "Madrid institution since 1894 serving freshly fried churros with thick hot chocolate, perfect for breakfast or late-night indulgence."
    },
    {
      "name": "Santiago Bernabéu tour",
      "coord": [
        40.452367,
        -3.690725
      ],
      "desc": "Real Madrid's legendary stadium, trophies, stadium history",
      "longDesc": "Tour the home of Real Madrid with museum displays of trophies, medals, and memorabilia spanning over a century of European football dominance."
    },
    {
      "name": "Rooftop sunset drinks (Gran Vía area)",
      "coord": [
        40.416,
        -3.7042
      ],
      "desc": "Madrid's rooftop bars, sunset views, Gran Vía ambiance, cocktails",
      "longDesc": "Experience Madrid's skyline from chic rooftop venues offering craft cocktails, tapas, and golden-hour views over the city's iconic avenue."
    },
    {
      "name": "Flamenco show (Madrid)",
      "coord": [
        40.415748,
        -3.702404
      ],
      "desc": "Live flamenco performance, passionate dancers, Madrid tablao",
      "longDesc": "Madrid's finest flamenco venues offer live performances by master dancers and guitarists in intimate settings with dinner and drinks."
    },
    {
      "name": "Day trip by AVE: Toledo or Segovia",
      "coord": [
        40.4078,
        -3.7128
      ],
      "desc": "Medieval walled cities, hilltop castles, narrow cobbled streets",
      "longDesc": "High-speed AVE trains connect Madrid to UNESCO medieval towns featuring dramatic castles, gothic cathedrals, and preserved old quarters."
    },
    {
      "name": "Real Alcázar of Seville",
      "coord": [
        37.38584,
        -5.992476
      ],
      "desc": "Moorish palace, intricate tile work, lush gardens, Seville",
      "longDesc": "Spain's most stunning royal palace blends Islamic and Christian architecture with intricate azulejo tiles, fountains, and serene courtyards."
    },
    {
      "name": "Seville Cathedral + Giralda",
      "coord": [
        37.387264,
        -5.99333
      ],
      "desc": "Gothic cathedral, Moorish minaret tower, climbing bell tower",
      "longDesc": "Spain's largest cathedral features soaring gothic architecture with the iconic Giralda tower, originally a Moorish minaret, climbable for city views."
    },
    {
      "name": "Plaza de España (sunset)",
      "coord": [
        40.423449,
        -3.710881
      ],
      "desc": "Seville's iconic semicircular plaza, tile work, bridges, sunset magic",
      "longDesc": "Seville's most photogenic plaza features a dramatic semicircular design with azulejo tile alcoves, reflecting pools, and romantic bridges."
    },
    {
      "name": "Maria Luisa Park stroll",
      "coord": [
        37.3736,
        -5.9823
      ],
      "desc": "Seville's lush gardens, fountains, pavilions, Plaza de España",
      "longDesc": "Seville's grandest park features manicured gardens, ornate fountains, ceramic-tiled pavilions, and views of the iconic Plaza de España."
    },
    {
      "name": "Metropol Parasol (Las Setas) viewpoint",
      "coord": [
        37.3882,
        -5.9825
      ],
      "desc": "Seville's modern wood structure, rooftop views, architectural icon",
      "longDesc": "Modern wooden parasol structure offers rooftop views of Seville from this contemporary architectural landmark with market and museum below."
    },
    {
      "name": "Triana neighborhood walk",
      "coord": [
        37.38271,
        -6.00257
      ],
      "desc": "Seville's riverside quarter, artisan workshops, flamenco heritage",
      "longDesc": "Seville's historic neighborhood along the Guadalquivir features ceramic studios, flamenco bars, and traditional Andalusian architecture."
    },
    {
      "name": "Flamenco at a traditional tablao",
      "coord": [
        37.3892,
        -5.9812
      ],
      "desc": "Authentic flamenco dancing, raw duende emotion, intimate venue",
      "longDesc": "Experience passionate flamenco in an intimate tablao setting with traditional guitar, rhythmic handclaps, and dancers embodying centuries of Andalusian tradition."
    },
    {
      "name": "Tapas crawl: Santa Cruz to Centro",
      "coord": [
        37.386501,
        -5.987723
      ],
      "desc": "Seville's historic quarter, tapas bars, sherry wine, local flavor",
      "longDesc": "Explore Seville's charming Santa Cruz district with its maze of alleys leading to traditional taverns serving sherry, jamón, and authentic tapas."
    },
    {
      "name": "Day trip to Córdoba (Mezquita)",
      "coord": [
        37.8782,
        -4.7795
      ],
      "desc": "Moorish mosque-cathedral, red-white arches, Islamic-Christian fusion",
      "longDesc": "UNESCO-listed Mezquita features stunning arched corridors of red and white stone, blending Islamic architecture with Christian cathedral elements."
    },
    {
      "name": "White villages + Ronda viewpoints",
      "coord": [
        36.7416,
        -5.3324
      ],
      "desc": "Andalusian pueblos blancos, dramatic clifftop villages, mountain vistas",
      "longDesc": "Whitewashed villages perched on hillsides with stunning views of Andalusian mountains, winding streets, and traditional Spanish architecture."
    },
    {
      "name": "Explore the Alhambra complex",
      "coord": [
        37.1762,
        -3.5883
      ],
      "desc": "Granada's Moorish fortress-palace, stucco carvings, geometric patterns",
      "longDesc": "UNESCO masterpiece features exquisite Islamic architecture with intricate carved stucco, geometric tile work, and palatial courtyards overlooking Granada."
    },
    {
      "name": "Generalife gardens",
      "coord": [
        37.163479,
        -3.596881
      ],
      "desc": "Alhambra palace gardens, fountains, cypress trees, Granada",
      "longDesc": "Serene Islamic gardens adjoining the Alhambra with cascading fountains, cypress-lined pathways, and views of the Darío River valley."
    },
    {
      "name": "Albaicín neighborhood wander",
      "coord": [
        37.178314,
        -3.597709
      ],
      "desc": "Granada's old Moorish quarter, narrow streets, whitewashed houses",
      "longDesc": "Granada's historic Moorish neighborhood features labyrinthine cobbled streets, whitewashed houses, and sweeping views of the Alhambra."
    },
    {
      "name": "Mirador de San Nicolás at sunset",
      "coord": [
        37.1879,
        -3.5964
      ],
      "desc": "Granada's viewpoint, Alhambra sunset views, mountain backdrop",
      "longDesc": "Granada's most romantic viewpoint offers magical sunset views of the Alhambra with Sierra Nevada mountains as backdrop, perfect for photography."
    },
    {
      "name": "Hammam Al Ándalus baths",
      "coord": [
        37.1889,
        -3.5936
      ],
      "desc": "Moorish-style baths, thermal pools, Granada's spa retreat",
      "longDesc": "Authentic hammam experience in Granada with hot springs, massage rooms, and traditional Moorish bathing ritual in candlelit underground chambers."
    },
    {
      "name": "Sacromonte cave flamenco",
      "coord": [
        40.48879,
        -3.349187
      ],
      "desc": "Granada's cave flamenco venue, gypsy history, authentic dancing",
      "longDesc": "Granada's Sacromonte caves offer authentic flamenco performances in traditional gypsy cave dwellings with passionate musicians and dancers."
    },
    {
      "name": "Pintxos bar-hopping in Parte Vieja",
      "coord": [
        43.3186,
        -1.9833
      ],
      "desc": "San Sebastián's old town, pintxos crawl, culinary excellence, Basque tradition",
      "longDesc": "San Sebastián's Parte Vieja features narrow streets lined with pintxo bars where locals gather for exquisite small plates and local txakoli wine."
    },
    {
      "name": "La Concha Beach promenade",
      "coord": [
        43.528819,
        -7.030301
      ],
      "desc": "San Sebastián's iconic crescent beach, golden sand, bay views, perfect seaside",
      "longDesc": "Spain's most elegant beach offers calm golden sand, the elegant promenade, and views of the Concha islet and surrounding mountains."
    },
    {
      "name": "Monte Urgull hike",
      "coord": [
        40.433449,
        -3.895024
      ],
      "desc": "San Sebastián's hilltop fortress, city views, coastal panoramas",
      "longDesc": "Historic hillside offering walking trails to castle ruins with panoramic views of La Concha beach, the city, and the Basque coast."
    },
    {
      "name": "San Telmo Museum",
      "coord": [
        36.673839,
        -6.132269
      ],
      "desc": "San Sebastián's Basque culture museum, crafts, historical exhibits, heritage",
      "longDesc": "Museum dedicated to Basque culture featuring traditional crafts, art, historical exhibits, and views of the old town and harbor."
    },
    {
      "name": "Surf lesson at Zurriola Beach",
      "coord": [
        43.3218,
        -1.9747
      ],
      "desc": "Zurriola Beach lessons, Atlantic waves, beginner-friendly, adventure",
      "longDesc": "Popular beach for learning to surf with steady Atlantic swells, local instructors, and a vibrant beach culture perfect for families."
    },
    {
      "name": "Guggenheim Museum Bilbao",
      "coord": [
        43.268428,
        -2.934061
      ],
      "desc": "Bilbao's iconic titanium building, contemporary art, architectural marvel",
      "longDesc": "Frank Gehry's striking titanium-clad museum is both an artwork and cultural venue, showcasing contemporary art and modern architecture."
    },
    {
      "name": "Old Town Bilbao pintxos crawl",
      "coord": [
        43.2544,
        -2.9231
      ],
      "desc": "Bilbao's Casco Viejo, pintxos bars, Basque food scene, local atmosphere",
      "longDesc": "Historic medieval quarter with narrow cobbled streets, traditional pintxo bars, and authentic Basque dining culture."
    },
    {
      "name": "Getaria seafood + coastal views",
      "coord": [
        36.40884,
        -5.189873
      ],
      "desc": "Basque coast village, fresh grilled fish, harbor views, traditional dining",
      "longDesc": "Picturesque fishing village famous for txuleta grilled fish, charming harbor, and beach views along the dramatic Basque coastline."
    },
    {
      "name": "City of Arts and Sciences complex",
      "coord": [
        39.45662,
        -0.35285
      ],
      "desc": "Valencia's futuristic architecture, white buildings, world's fair venue, modern design",
      "longDesc": "Stunning modern complex featuring futuristic white buildings, IMAX cinema, ocean world aquarium, and science museum in sculptural architecture."
    },
    {
      "name": "Oceanogràfic (aquarium)",
      "coord": [
        39.45305,
        -0.347181
      ],
      "desc": "Valencia's marine aquarium, marine life exhibits, ocean conservation, family entertainment",
      "longDesc": "One of Europe's largest aquariums featuring diverse marine environments, underwater restaurant, and interactive marine life experiences."
    },
    {
      "name": "Turia Gardens bike ride",
      "coord": [
        39.4679,
        -0.3595
      ],
      "desc": "Valencia's converted river park, cycling path, green space, urban oasis",
      "longDesc": "Beautiful park created from converted river bed offering long cycling and walking path through city with themed sections and recreation."
    },
    {
      "name": "Central Market browse + snack",
      "coord": [
        39.4749,
        -0.3821
      ],
      "desc": "Valencia's historic produce market, local cuisine, market snacking, regional specialty",
      "longDesc": "Historic market with fresh regional produce, jamón, seafood, and casual food stalls where locals gather for breakfast and snacks."
    },
    {
      "name": "Albufera lagoon sunset boat ride",
      "coord": [
        39.3411,
        -0.3211
      ],
      "desc": "Valencia's coastal lagoon, traditional boats, sunset views, rice paddy landscape",
      "longDesc": "Scenic lagoon separated from sea by sandbar, accessible by traditional rowing boat, famous for paella culture and sunset views."
    },
    {
      "name": "Paella Valenciana lunch by the beach",
      "coord": [
        39.4594,
        -0.3236
      ],
      "desc": "Authentic paella, beachfront dining, traditional coastal cuisine, regional dish",
      "longDesc": "Taste Valencia's signature dish—paella—prepared with traditional saffron, seafood, and rice, best enjoyed waterside in authentic restaurants."
    },
    {
      "name": "Malvarrosa beach day",
      "coord": [
        37.16291,
        -3.595788
      ],
      "desc": "Valencia's main urban beach, golden sand, beach promenade, family beach",
      "longDesc": "City's principal beach offering safe swimming, long sandy shore, restaurants, and proximity to City of Arts and Sciences complex."
    },
    {
      "name": "Drive the Serra de Tramuntana (scenic)",
      "coord": [
        39.7639,
        2.7304
      ],
      "desc": "Mallorca's mountain drive, coastal curves, village stops, scenic route",
      "longDesc": "Dramatic mountain drive offering hairpin turns, village stops, and panoramic views of rocky coastline and Mediterranean sea."
    },
    {
      "name": "Deià village wander",
      "coord": [
        41.434297,
        2.17475
      ],
      "desc": "Mallorca's artistic village, hillside charm, artist community, quiet luxury",
      "longDesc": "Picturesque artist village perched on mountainside with narrow streets, artist galleries, cafés, and views of the rocky coast."
    },
    {
      "name": "Palma Cathedral (La Seu)",
      "coord": [
        39.567473,
        2.648168
      ],
      "desc": "Mallorca's gothic cathedral, waterfront location, architectural gem, historic",
      "longDesc": "Stunning gothic cathedral overlooking the harbor with intricate facades, soaring arches, and panoramic views of Palma Bay."
    },
    {
      "name": "Boat to calas (coves)",
      "coord": [
        36.723398,
        -4.420595
      ],
      "desc": "Mallorca's hidden coves, turquoise waters, swimming, beach exploration",
      "longDesc": "Day boat excursion to secluded Mediterranean coves with crystalline turquoise waters perfect for swimming and snorkeling."
    },
    {
      "name": "Beach day at Formentor",
      "coord": [
        39.8693,
        3.216
      ],
      "desc": "Mallorca's dramatic beach, pine-lined coves, mountain backdrop, scenic beauty",
      "longDesc": "Stunning northern beach nestled between dramatic cliffs covered in pine trees, offering calm turquoise waters and spectacular scenery."
    },
    {
      "name": "Dalt Vila (Ibiza Old Town)",
      "coord": [
        40.648837,
        -3.97693
      ],
      "desc": "Ibiza's walled old town, narrow streets, sunset views, historic quarter",
      "longDesc": "UNESCO-listed fortified old town features narrow cobbled streets, historic walls, and iconic sunset views over the harbor."
    },
    {
      "name": "Cala Comte sunset",
      "coord": [
        38.958885,
        1.233211
      ],
      "desc": "Ibiza's sunset beach, golden cliffs, turquoise waters, evening spectacle",
      "longDesc": "Popular beach on Ibiza's western coast famous for stunning sunset views with golden cliffs, turquoise waters, and beach clubs."
    },
    {
      "name": "Ses Salines beach + nature park",
      "coord": [
        38.7435,
        1.2064
      ],
      "desc": "Ibiza's protected beach, salt marshes, nature reserve, wildlife",
      "longDesc": "Beach adjacent to protected salt marsh nature reserve featuring diverse birdlife, natural salt ponds, and less-crowded swimming."
    },
    {
      "name": "Family-friendly beach morning (Cala Llonga / Talamanca)",
      "coord": [
        41.738178,
        1.977254
      ],
      "desc": "Ibiza's family beaches, calm waters, beach amenities, family-friendly fun",
      "longDesc": "Calm, shallow beaches ideal for families with lifeguards, beach clubs serving food, and close proximity to town amenities."
    },
    {
      "name": "Boat to Formentera (day trip)",
      "coord": [
        38.7365,
        1.4198
      ],
      "desc": "Formentera day trip, neighboring island, pristine beaches, island hopping",
      "longDesc": "Ferry to nearby Formentera island offering pristine beaches, smaller crowds, and slower Mediterranean island pace than Ibiza."
    },
    {
      "name": "Whale and dolphin watching",
      "coord": [
        36.7201,
        -4.2794
      ],
      "desc": "Ibiza's marine wildlife tours, dolphin sightings, Atlantic boat trips, nature",
      "longDesc": "Boat excursions into deeper waters offering chances to spot whales, dolphins, and other marine life in their natural habitat."
    },
    {
      "name": "Camino de Santiago (family-friendly stages)",
      "coord": [
        38.125077,
        -0.860885
      ],
      "desc": "Pilgrimage route, countryside walks, spiritual journey, multi-day hiking",
      "longDesc": "Famous pilgrimage path offering scenic walking stages through Spanish countryside, small towns, and opportunities for reflection."
    },
    {
      "name": "Santiago de Compostela Cathedral",
      "coord": [
        42.880422,
        -8.545861
      ],
      "desc": "Galicia's cathedral, pilgrimage endpoint, romanesque-gothic architecture, spiritual",
      "longDesc": "Stunning cathedral at pilgrimage destination featuring intricate sculptured facade, soaring architecture, and deep spiritual significance."
    },
    {
      "name": "Rioja winery day (Marqués de Riscal area)",
      "coord": [
        42.6034,
        -2.8213
      ],
      "desc": "Wine region tours, famous bodegas, tasting menus, vineyard landscape",
      "longDesc": "Spain's premier wine region with prestigious bodegas offering vineyard tours, wine tastings, and meals paired with local wines."
    },
    {
      "name": "Penedès cava tasting",
      "coord": [
        41.2704,
        1.56095
      ],
      "desc": "Catalonian wine region, cava sparkling wine, vineyard tours, tastings",
      "longDesc": "Catalonia's premier wine region offers guided tours through family-run wineries, cava tastings, and beautiful vineyard landscapes."
    },
    {
      "name": "Toledo old town wander",
      "coord": [
        39.862563,
        -4.010827
      ],
      "desc": "Medieval hilltop town, El Greco connection, winding streets, historic architecture",
      "longDesc": "Dramatic medieval town perched on a hillside features El Greco's paintings, ancient synagogues, mosques, and sweeping historic architecture."
    },
    {
      "name": "Segovia aqueduct + Alcázar",
      "coord": [
        40.942096,
        -4.109677
      ],
      "desc": "Roman aqueduct marvel, medieval castle fortress, ancient engineering, iconic views",
      "longDesc": "UNESCO town features a perfectly preserved Roman aqueduct and fairy-tale Alcázar castle overlooking valleys and surrounding mountains."
    },
    {
      "name": "Córdoba Mezquita-Catedral",
      "coord": [
        37.879026,
        -4.779453
      ],
      "desc": "Great Mosque, arched corridors, Islamic-Christian architecture, UNESCO heritage",
      "longDesc": "Stunning Islamic mosque-cathedral with iconic red-and-white striped arches, intricate mihrab, and fusion of cultures in architecture."
    },
    {
      "name": "Ronda Puente Nuevo gorge views",
      "coord": [
        40.066771,
        -6.664086
      ],
      "desc": "Dramatic gorge bridge, white village, clifftop views, Andalusian icon",
      "longDesc": "Spectacular bridge spans a dramatic gorge connecting old and new towns, offering breathtaking views of the rocky chasm below."
    },
    {
      "name": "Flamenco in Andalusia (Seville/Granada)",
      "coord": [
        37.183234,
        -3.598031
      ],
      "desc": "Authentic flamenco passion, guitar mastery, duende spirit, Andalusian tradition",
      "longDesc": "Witness raw flamenco passion in intimate tablao settings where master guitarists and dancers embody centuries of Andalusian tradition."
    },
    {
      "name": "Contemporary art + architecture in Málaga",
      "coord": [
        36.7213,
        -4.4185
      ],
      "desc": "Málaga's modern museums, Picasso Museum, contemporary scene, coastal city",
      "longDesc": "Costa del Sol city with revitalized cultural scene featuring Picasso Museum, contemporary galleries, and waterfront dining."
    },
    {
      "name": "Cala Llombards",
      "coord": [
        39.568,
        2.6512
      ],
      "desc": "Mallorca's turquoise cove, golden sand, family beach, scenic swimming",
      "longDesc": "Beautiful sheltered cove with fine golden sand, calm turquoise waters, and dramatic rocky cliffs providing scenic backdrop."
    },
    {
      "name": "Mirador de Es Colomer",
      "coord": [
        39.5688,
        2.6522
      ],
      "desc": "Mallorca's viewpoint, clifftop views, dramatic landscape, photography",
      "longDesc": "Dramatic clifftop viewpoint offering sweeping panoramas of jagged cliffs, azure sea, and nearby Conill and Penjats rock formations."
    },
    {
      "name": "Santanyí Market",
      "coord": [
        39.5696,
        2.6482
      ],
      "desc": "Mallorca's traditional market, local produce, street culture, community gathering",
      "longDesc": "Wednesday and Saturday market in charming hilltop town featuring local produce, crafts, and traditional Mallorcan atmosphere."
    },
    {
      "name": "Caló del Moro",
      "coord": [
        39.5704,
        2.6492
      ],
      "desc": "Mallorca's secret cove, tiny beach, turquoise waters, hidden gem",
      "longDesc": "Hidden cove reachable by short hike offering pristine turquoise waters, rocky cliffs, and peaceful isolation from crowds."
    },
    {
      "name": "La Alcaicería (antiguo mercado de la seda)",
      "coord": [
        39.9992,
        -3.699
      ],
      "desc": "Granada's old silk market, narrow alleys, jewelry shops, historic bazaar",
      "longDesc": "Historic marketplace in Granada's Albaicín featuring narrow alleys lined with jewelry shops, textiles, and traditional crafts."
    },
    {
      "name": "Parque Infantil",
      "coord": [
        40.0,
        -3.698
      ],
      "desc": "Children's playground, climbing equipment, play structures, family fun",
      "longDesc": "Well-maintained children's park with modern climbing structures, slides, swings, and safe play areas for young children."
    },
    {
      "name": "Parque infantil Cristina",
      "coord": [
        40.0008,
        -3.702
      ],
      "desc": "Cristina Park, playground equipment, family recreation, outdoor fun",
      "longDesc": "Popular neighborhood playground featuring various play equipment, shaded areas, and family-friendly recreation space."
    },
    {
      "name": "Playground",
      "coord": [
        40.0016,
        -3.701
      ],
      "desc": "Park with play equipment, swings, slides, children's recreation",
      "longDesc": "Public playground with standard play equipment including swings, slides, climbing frames, and sandbox areas."
    },
    {
      "name": "Mercadillo histórico \"El Jueves\"",
      "coord": [
        40.0024,
        -3.7
      ],
      "desc": "Seville's Thursday flea market, antiques, vintage items, historic treasures",
      "longDesc": "Weekly Thursday market in Seville's Triana featuring antiques, vintage goods, collectibles, and secondhand treasures."
    },
    {
      "name": "Alameda de Hércules",
      "coord": [
        39.9976,
        -3.699
      ],
      "desc": "Seville's public plaza, historic squares, tree-lined avenue, local gathering",
      "longDesc": "Historic plaza and tree-lined avenue in Seville's historic quarter serving as popular gathering place with bars and restaurants."
    },
    {
      "name": "El Corte Ingles",
      "coord": [
        39.9984,
        -3.698
      ],
      "desc": "Spain's department store, shopping destination, retail, fashion",
      "longDesc": "Spain's largest and most prestigious department store chain offering fashion, home goods, and dining options."
    },
    {
      "name": "Pl. de la Concordia",
      "coord": [
        39.9992,
        -3.702
      ],
      "desc": "Granada's plaza, public square, historic gathering place, local ambiance",
      "longDesc": "Public plaza in Granada serving as community gathering space with cafés, shops, and traditional Andalusian atmosphere."
    },
    {
      "name": "Parque de María Luisa",
      "coord": [
        40.0,
        -3.701
      ],
      "desc": "Seville's historic park, gardens, water features, green space",
      "longDesc": "Seville's famous park featuring manicured gardens, fountains, botanical displays, and peaceful walking paths."
    },
    {
      "name": "Murillo Gardens",
      "coord": [
        40.0008,
        -3.7
      ],
      "desc": "Seville's waterfront gardens, riverside promenade, scenic views",
      "longDesc": "Serene gardens along Seville's Guadalquivir riverfront offering walking paths, benches, and river views."
    },
    {
      "name": "Catedral de Sevilla",
      "coord": [
        40.0016,
        -3.699
      ],
      "desc": "Seville's gothic cathedral, architectural grandeur, historic significance",
      "longDesc": "Spain's largest cathedral featuring soaring gothic architecture and the iconic Giralda tower, towering over Seville's skyline."
    },
    {
      "name": "Pl. de la Alfalfa",
      "coord": [
        40.0024,
        -3.698
      ],
      "desc": "Seville's historic plaza, narrow streets, traditional bars, old quarter",
      "longDesc": "Historic plaza in Seville's Santa Cruz district with traditional bars, tapas restaurants, and medieval atmosphere."
    },
    {
      "name": "Setas de Sevilla",
      "coord": [
        39.9976,
        -3.702
      ],
      "desc": "Seville's modern structure, rooftop views, contemporary landmark",
      "longDesc": "Modern wooden parasol structure offering rooftop views and cultural facilities in central Seville plaza."
    },
    {
      "name": "Sevilla Aquarium",
      "coord": [
        39.9984,
        -3.701
      ],
      "desc": "Seville's aquarium, marine life exhibits, family entertainment",
      "longDesc": "Marine aquarium featuring Mediterranean and Atlantic species, interactive exhibits, and educational programming."
    },
    {
      "name": "Santana Photo Material",
      "coord": [
        39.9992,
        -3.7
      ],
      "desc": "Seville photography shop, camera supplies, professional equipment",
      "longDesc": "Specialized camera and photography equipment store serving professional and amateur photographers."
    },
    {
      "name": "AIRE Ancient Baths Sevilla",
      "coord": [
        40.0016,
        -3.701
      ],
      "desc": "Seville's hammam spa, thermal baths, wellness center, relaxation",
      "longDesc": "Ancient-style hammam baths in Seville offering traditional Moorish bathing experience with hot springs and massage services."
    },
    {
      "name": "Torre del Oro",
      "coord": [
        40.0024,
        -3.7
      ],
      "desc": "Seville's historic tower, riverside location, museum, naval history",
      "longDesc": "Historic 13th-century tower along Seville's waterfront originally built as fortress, now housing naval museum and panoramic views."
    }
  ],
  "kidFriendly": [
    {
      "name": "Barcelona Aquarium",
      "coord": [
        41.37799,
        2.18329
      ],
      "desc": "Mediterranean marine life, underwater tunnel, 500+ species",
      "longDesc": "One of Europe's largest aquariums features Mediterranean species, a dramatic underwater tunnel, interactive touchpools, and marine education exhibits."
    },
    {
      "name": "CosmoCaixa (science museum)",
      "coord": [
        41.4063,
        2.1319
      ],
      "desc": "Barcelona's interactive science center, planetarium, wet laboratories",
      "longDesc": "State-of-the-art science museum features planetarium shows, interactive exhibits, 3D films, and hands-on demonstrations for curious young minds."
    },
    {
      "name": "Parc de la Ciutadella playground + boat lake",
      "coord": [
        41.388416,
        2.186255
      ],
      "desc": "Barcelona's central park, playground, rowboats, peaceful paths",
      "longDesc": "Barcelona's most accessible park features spacious playground, scenic lake for rowing, green lawns, and cafés perfect for families."
    },
    {
      "name": "Park Güell (short route)",
      "coord": [
        41.40858,
        2.15004
      ],
      "desc": "Gaudí's park shortened route, main terraces, manageable hike",
      "longDesc": "Family-friendly Park Güell route focusing on iconic terraces and main areas, avoiding exhausting pathways for younger children."
    },
    {
      "name": "Montjuïc cable car (views without walking)",
      "coord": [
        41.3729,
        2.1628
      ],
      "desc": "Barcelona's cable car to Montjuïc fortress, accessible mountain views",
      "longDesc": "Aerial cable car provides effortless access to Montjuïc mountain fortress with panoramic Barcelona views, accessible for all ages."
    },
    {
      "name": "Tibidabo amusement park",
      "coord": [
        41.4222,
        2.1138
      ],
      "desc": "Barcelona's hilltop amusement park, views, vintage rides, fun",
      "longDesc": "Barcelona's historic amusement park atop Tibidabo mountain offers rides, restaurants, and 360-degree city and sea views."
    },
    {
      "name": "Beach morning at Barceloneta / Nova Icaria",
      "coord": [
        41.387,
        2.193
      ],
      "desc": "Barcelona's family beaches, calm waters, beach bars, morning swims",
      "longDesc": "Barcelona's most popular beach areas offer calm Mediterranean waters, lifeguards, beach clubs with food service, and nearby amenities."
    },
    {
      "name": "Poble Espanyol (open-air ‘village’)",
      "coord": [
        41.3879,
        2.1587
      ],
      "desc": "Climbing and exploration, active fun",
      "longDesc": "Educational venue transforming learning into enjoyable experiences through interactive displays and activities."
    },
    {
      "name": "Retiro Park (playgrounds + pond boats)",
      "coord": [
        38.851485,
        0.08751
      ],
      "desc": "Madrid's iconic park, playgrounds, rowboat rentals, green space",
      "longDesc": "Madrid's most beloved park offers expansive lawns, multiple playgrounds, scenic lake with rowboat rentals, and perfect family gathering space."
    },
    {
      "name": "Madrid Río park + playgrounds",
      "coord": [
        40.400597,
        -3.720755
      ],
      "desc": "Madrid's riverside park, multiple playgrounds, family activities, green space",
      "longDesc": "Modern riverside park with extensive playgrounds, sports areas, cycling paths, and family activities along the Manzanares River."
    },
    {
      "name": "Royal Palace (short highlights tour)",
      "coord": [
        40.4268,
        -3.7148
      ],
      "desc": "Madrid's official palace, throne room, royal apartments highlights",
      "longDesc": "Skip-the-line palace tour emphasizing throne room, royal bedchambers, and ornate halls without overwhelming details for families."
    },
    {
      "name": "Prado ‘highlights’ visit (30–60 min)",
      "coord": [
        40.4168,
        -3.7038
      ],
      "desc": "Prado's essential masterpieces, focused tour, major paintings, family-paced",
      "longDesc": "Guided tour focusing on Prado's greatest hits—Velázquez, Goya, Bosch—without museum fatigue for families with limited time."
    },
    {
      "name": "Santiago Bernabéu tour",
      "coord": [
        40.452367,
        -3.690725
      ],
      "desc": "Real Madrid's legendary stadium, trophies, stadium history",
      "longDesc": "Tour the home of Real Madrid with museum displays of trophies, medals, and memorabilia spanning over a century of European football dominance."
    },
    {
      "name": "Churros at San Ginés",
      "coord": [
        40.4165,
        -3.7054
      ],
      "desc": "Madrid's iconic churro shop, crispy churros, thick hot chocolate",
      "longDesc": "Madrid institution since 1894 serving freshly fried churros with thick hot chocolate, perfect for breakfast or late-night indulgence."
    },
    {
      "name": "City of Arts and Sciences (science museum + IMAX)",
      "coord": [
        39.4596,
        -0.3568
      ],
      "desc": "Valencia's futuristic complex, IMAX theater, science museum, wow",
      "longDesc": "Valencia's stunning futuristic architecture houses IMAX cinema, ocean world aquarium, and interactive science museum in iconic white buildings."
    },
    {
      "name": "Oceanogràfic (aquarium)",
      "coord": [
        39.45305,
        -0.347181
      ],
      "desc": "Valencia's marine aquarium, marine life exhibits, ocean conservation, family entertainment",
      "longDesc": "One of Europe's largest aquariums featuring diverse marine environments, underwater restaurant, and interactive marine life experiences."
    },
    {
      "name": "Turia Gardens (Gulliver Park area)",
      "coord": [
        37.187661,
        -3.60027
      ],
      "desc": "Valencia's green river park, Gulliver playground, cycling path",
      "longDesc": "Valencia's converted river bed features a long cycling and walking path, themed park sections including Gulliver playground for kids."
    },
    {
      "name": "Central Market snack crawl",
      "coord": [
        36.5304,
        -6.2982
      ],
      "desc": "Valencia's market food tour, regional snacks, tasting experience, family fun",
      "longDesc": "Guided food tour through Central Market sampling regional tapas, horchata, jamón, and local specialties with market stories."
    },
    {
      "name": "Plaza de España + Maria Luisa Park",
      "coord": [
        37.3763,
        -5.9874
      ],
      "desc": "Seville's grand plaza and gardens, iconic architecture, water features",
      "longDesc": "Seville's most famous complex combines the Plaza de España's dramatic semicircular design with adjacent Maria Luisa Park's fountains and gardens."
    },
    {
      "name": "Metropol Parasol (Las Setas) walkway",
      "coord": [
        37.3885,
        -5.9829
      ],
      "desc": "Seville's wooden structure, rooftop walk, city views, family activities",
      "longDesc": "Modern wooden parasol structure offers rooftop walkway with Seville views, market, museum, and lower-level plaza for families."
    },
    {
      "name": "Flamenco Museum (short films)",
      "coord": [
        37.3929,
        -5.9825
      ],
      "desc": "Seville's flamenco history, documentary films, dance exhibits",
      "longDesc": "Seville's museum dedicated to flamenco art features documentary films, costume displays, and history of this passionate Andalusian tradition."
    },
    {
      "name": "Alhambra gardens (kid-paced route)",
      "coord": [
        37.176,
        -3.5881
      ],
      "desc": "Alhambra gardens with slower pace, rest areas, kid-friendly stops",
      "longDesc": "Family-friendly Alhambra route prioritizing gardens and courtyards with built-in rest spots and activities for children."
    },
    {
      "name": "Hammam-style baths (adults; swap-in babysitting)",
      "coord": [
        37.187,
        -3.592
      ],
      "desc": "Moorish baths, thermal pools, adult relaxation, babysitting option",
      "longDesc": "Spa experience in Granada's traditional hammam with hot springs, while babysitting can be arranged for children."
    },
    {
      "name": "Palma old town + Cathedral",
      "coord": [
        37.386465,
        -6.55352
      ],
      "desc": "Mallorca's old town, gothic cathedral, Mediterranean charm",
      "longDesc": "Palma's historic quarter features narrow streets, gothic cathedral overlooking the sea, and traditional Mallorcan architecture."
    },
    {
      "name": "Boat to calm coves (short cruise)",
      "coord": [
        38.8102,
        1.4502
      ],
      "desc": "Short boat tour to hidden coves, swimming, coastal scenery",
      "longDesc": "Half-day boat excursion to secluded Mediterranean coves with swimming stops, snorkeling, and scenic coastal views perfect for families."
    },
    {
      "name": "Whale-watching boat trip",
      "coord": [
        36.7203,
        -4.2796
      ],
      "desc": "Southern coast boat tour, marine wildlife, ocean adventure",
      "longDesc": "Coastal boat expeditions offer chances to spot whales, dolphins, and other marine life in their natural Mediterranean and Atlantic habitats."
    }
  ],
  "markets": [
    {
      "name": "Mercado de San Miguel",
      "coord": [
        40.415374,
        -3.709015
      ],
      "desc": "Madrid's gourmet market, standing-room tapas, jamón ibérico, wine",
      "longDesc": "Elegant 19th-century market offers upscale tapas at stand-up bars featuring jamón ibérico, seafood, cheeses, and Spanish wines."
    },
    {
      "name": "Mercado de San Antón",
      "coord": [
        38.348155,
        -0.484826
      ],
      "desc": "Madrid's neighborhood market, specialty items, gourmet foods",
      "longDesc": "Madrid neighborhood market specializing in fine meats, seafood, cheeses, and prepared foods popular with local chefs and food enthusiasts."
    },
    {
      "name": "Mercado de la Paz",
      "coord": [
        43.28086,
        -2.986383
      ],
      "desc": "Madrid's Sunday market tradition, local shopping, community gathering",
      "longDesc": "Neighborhood market popular on Sundays with produce, meats, flowers, and prepared foods attracting locals and food lovers."
    },
    {
      "name": "Mercado de Antón Martín",
      "coord": [
        37.106318,
        -4.961062
      ],
      "desc": "Madrid's modern market hall, prepared foods, specialty shops",
      "longDesc": "Contemporary market with prepared food vendors, restaurants, and specialty shops creating a modern food experience in a traditional venue."
    },
    {
      "name": "La Boqueria",
      "coord": [
        41.3817,
        2.1687
      ],
      "desc": "Barcelona's legendary market, produce stalls, fresh seafood, bustling energy",
      "longDesc": "Barcelona's most iconic market since 1840 features vibrant stalls of fresh produce, seafood, jamón, and local Catalan specialties."
    },
    {
      "name": "Mercat de Santa Caterina",
      "coord": [
        41.386136,
        2.178505
      ],
      "desc": "Barcelona's wavy-roofed market, fresh goods, modern design, covered market",
      "longDesc": "Modern covered market with distinctive undulating wooden roof, fresh produce, and nearby tapas restaurants."
    },
    {
      "name": "Mercat de Sant Antoni",
      "coord": [
        41.378625,
        2.162049
      ],
      "desc": "Barcelona's historic market, fresh goods, modern-classic vibe",
      "longDesc": "Barcelona's iconic market dating from 1882 features fresh produce, vintage items on weekends, and casual local shopping atmosphere."
    },
    {
      "name": "Mercat del Ninot",
      "coord": [
        41.388155,
        2.154247
      ],
      "desc": "Barcelona's neighborhood market, street market atmosphere, local gathering",
      "longDesc": "Charming neighborhood market with casual street market feel, local shoppers, and traditional Barcelona market culture."
    },
    {
      "name": "Mercado Central",
      "coord": [
        39.473492,
        -0.378905
      ],
      "desc": "Barcelona's produce market, neighborhood hub, local vegetables, regional goods",
      "longDesc": "Traditional neighborhood market serving local community with fresh vegetables, meats, and prepared foods."
    },
    {
      "name": "Mercado de Colón",
      "coord": [
        39.468951,
        -0.368355
      ],
      "desc": "Barcelona's regional market, culinary delights, specialty ingredients",
      "longDesc": "Specialized market featuring regional Spanish products, artisanal ingredients, and prepared food sections."
    },
    {
      "name": "Mercado de Triana",
      "coord": [
        37.38575,
        -6.00355
      ],
      "desc": "Seville's historic market, fresh produce, local character, tapas",
      "longDesc": "Charming Seville market with produce stalls, flower vendors, and casual tapas bars reflecting traditional Andalusian market culture."
    },
    {
      "name": "Mercado de la Encarnación (Las Setas area)",
      "coord": [
        37.3888,
        -5.9833
      ],
      "desc": "Seville's market under Las Setas, local produce, atmosphere",
      "longDesc": "Traditional market operating beneath Seville's modern Metropol Parasol with fresh produce, meats, fish, and local food culture."
    },
    {
      "name": "Mercado Central de Atarazanas",
      "coord": [
        39.4725,
        -0.3749
      ],
      "desc": "Barcelona's historic produce market, fresh seafood, local vendors",
      "longDesc": "Barcelona's 19th-century market near the waterfront features fresh produce, seafood, and meats from local vendors."
    },
    {
      "name": "Mercado de la Bretxa",
      "coord": [
        43.3208,
        -1.9859
      ],
      "desc": "Valencia's market, fresh produce, regional specialties, local life",
      "longDesc": "Valencia's principal market offers fresh produce, seafood, and regional specialties reflecting the local food culture and traditions."
    },
    {
      "name": "La Bretxa (seafood level)",
      "coord": [
        39.917998,
        3.084315
      ],
      "desc": "Valencia's seafood market, fresh catches, pescado daily, maritime tradition",
      "longDesc": "Dedicated seafood section of Valencia market featuring daily fresh fish and shellfish catches from Mediterranean and Atlantic."
    },
    {
      "name": "Mercado de la Ribera",
      "coord": [
        43.255551,
        -2.924343
      ],
      "desc": "Valencia's covered market, gourmet destination, regional produce",
      "longDesc": "Large covered market with diverse produce, meats, seafood, and prepared foods serving regional cuisine and local shopping."
    },
    {
      "name": "Mercado de San Martín",
      "coord": [
        43.318106,
        -1.983048
      ],
      "desc": "Seville's waterfront market, fresh seafood, daily catches, vibrancy",
      "longDesc": "Seville's bustling waterfront market specializes in fresh seafood and fish, reflecting the city's river traditions and coastal proximity."
    }
  ],
  "cityCenters": {
    "Madrid": [
      40.4168,
      -3.7038,
      0.08
    ],
    "Barcelona": [
      41.3874,
      2.1686,
      0.08
    ],
    "Seville": [
      37.3886,
      -5.9823,
      0.07
    ],
    "Valencia": [
      39.4699,
      -0.3763,
      0.07
    ],
    "Bilbao": [
      43.2627,
      -2.9253,
      0.07
    ],
    "Granada": [
      37.1769,
      -3.5979,
      0.06
    ],
    "Córdoba": [
      37.8882,
      -4.7794,
      0.06
    ],
    "Málaga": [
      36.7213,
      -4.4214,
      0.06
    ],
    "San Sebastián": [
      43.3183,
      -1.9759,
      0.06
    ],
    "Salamanca": [
      40.9701,
      -5.6634,
      0.06
    ],
    "Burgos": [
      42.3438,
      -3.7034,
      0.06
    ],
    "Toledo": [
      39.8581,
      -4.0201,
      0.06
    ],
    "Segovia": [
      40.9429,
      -4.1084,
      0.05
    ],
    "Ronda": [
      36.7417,
      -5.3329,
      0.05
    ],
    "Girona": [
      41.9886,
      2.826,
      0.05
    ],
    "Tarragona": [
      41.1172,
      1.2458,
      0.05
    ],
    "Cuenca": [
      40.4738,
      -2.1375,
      0.05
    ],
    "Almería": [
      36.8365,
      -2.3672,
      0.05
    ],
    "Alicante": [
      38.3452,
      -0.481,
      0.06
    ],
    "Pamplona": [
      42.8125,
      -1.6457,
      0.05
    ],
    "Zaragoza": [
      41.6488,
      -0.8891,
      0.06
    ],
    "Badajoz": [
      38.8794,
      -6.9707,
      0.06
    ],
    "Jaén": [
      37.7726,
      -3.7848,
      0.05
    ],
    "Cádiz": [
      36.5362,
      -6.2905,
      0.05
    ],
    "Huelva": [
      37.2605,
      -6.9447,
      0.05
    ],
    "Balearic Islands - Mallorca": [
      39.5696,
      2.9499,
      0.08
    ],
    "Balearic Islands - Ibiza": [
      38.9067,
      1.4205,
      0.06
    ],
    "Balearic Islands - Menorca": [
      39.8644,
      4.2639,
      0.06
    ],
    "Balearic Islands - Formentera": [
      38.6667,
      1.4167,
      0.05
    ],
    "Canary Islands - Tenerife": [
      28.4595,
      -16.2538,
      0.12
    ],
    "Canary Islands - Gran Canaria": [
      27.9369,
      -15.5898,
      0.1
    ],
    "Canary Islands - Lanzarote": [
      29.0469,
      -13.5897,
      0.08
    ],
    "Rioja Wine Region": [
      42.4623,
      -2.4426,
      0.1
    ],
    "La Rioja": [
      42.4623,
      -2.4426,
      0.06
    ]
  },
  "itineraryData": {
    "a": {
      "name": "Greatest Hits",
      "color": "#2563EB",
      "days": [
        {
          "day": 1,
          "title": "Madrid: Royal Welcome",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Royal Palace",
              "coord": [
                40.4178,
                -3.7142
              ]
            },
            {
              "type": "lunch",
              "name": "Casa Botín",
              "coord": [
                40.4156,
                -3.6984
              ]
            },
            {
              "type": "sightseeing",
              "name": "Prado Museum",
              "coord": [
                40.4145,
                -3.6929
              ]
            },
            {
              "type": "dinner",
              "name": "El Club Allard",
              "coord": [
                40.4532,
                -3.6876
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Madrid: Art & Culture",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Café near Plaza Mayor",
              "coord": [
                40.4155,
                -3.7081
              ]
            },
            {
              "type": "sightseeing",
              "name": "Reina Sofía Museum",
              "coord": [
                40.4051,
                -3.6934
              ]
            },
            {
              "type": "sightseeing",
              "name": "Retiro Park",
              "coord": [
                40.4116,
                -3.6853
              ]
            },
            {
              "type": "lunch",
              "name": "Casa Lucio",
              "coord": [
                40.4111,
                -3.7109
              ]
            },
            {
              "type": "dinner",
              "name": "Punto MX",
              "coord": [
                40.4385,
                -3.6921
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Toledo: Medieval Time",
          "items": [
            {
              "type": "breakfast",
              "name": "Madrid hotel",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Toledo Cathedral",
              "coord": [
                39.8581,
                -4.0201
              ]
            },
            {
              "type": "sightseeing",
              "name": "El Greco Museum",
              "coord": [
                39.8537,
                -4.0276
              ]
            },
            {
              "type": "lunch",
              "name": "Adolfo",
              "coord": [
                39.8634,
                -4.0238
              ]
            },
            {
              "type": "sightseeing",
              "name": "Alcázar",
              "coord": [
                39.8626,
                -4.0126
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Toledo",
              "coord": [
                39.8581,
                -4.0201
              ]
            },
            {
              "type": "dinner",
              "name": "Local Toledo restaurant",
              "coord": [
                39.8581,
                -4.0201
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Barcelona: Gaudí Marvel",
          "items": [
            {
              "type": "breakfast",
              "name": "Toledo café",
              "coord": [
                39.8581,
                -4.0201
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sagrada Familia",
              "coord": [
                41.4036,
                2.1744
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "lunch",
              "name": "Botafumeiro",
              "coord": [
                41.3868,
                2.1672
              ]
            },
            {
              "type": "sightseeing",
              "name": "Park Güell",
              "coord": [
                41.4145,
                2.1527
              ]
            },
            {
              "type": "dinner",
              "name": "Tickets Bar",
              "coord": [
                41.3807,
                2.165
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Barcelona: Culture & Markets",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "La Boqueria",
              "coord": [
                41.3817,
                2.1687
              ]
            },
            {
              "type": "sightseeing",
              "name": "Gothic Quarter",
              "coord": [
                41.3835,
                2.1749
              ]
            },
            {
              "type": "lunch",
              "name": "Cal Pep",
              "coord": [
                41.386,
                2.1815
              ]
            },
            {
              "type": "sightseeing",
              "name": "MNAC",
              "coord": [
                41.3694,
                2.1627
              ]
            },
            {
              "type": "dinner",
              "name": "Cinc Sentits",
              "coord": [
                41.39,
                2.1697
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Seville: Moorish Charm",
          "items": [
            {
              "type": "breakfast",
              "name": "Barcelona café",
              "coord": [
                41.3874,
                2.1686
              ]
            },
            {
              "type": "hotel",
              "name": "Casa Imperial",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cathedral of Seville",
              "coord": [
                37.386,
                -5.9845
              ]
            },
            {
              "type": "lunch",
              "name": "Enrique Becerra",
              "coord": [
                37.3898,
                -5.9876
              ]
            },
            {
              "type": "sightseeing",
              "name": "Alcázar",
              "coord": [
                37.3858,
                -5.9924
              ]
            },
            {
              "type": "sightseeing",
              "name": "Plaza de España",
              "coord": [
                37.3736,
                -5.9899
              ]
            },
            {
              "type": "dinner",
              "name": "Casa Morales",
              "coord": [
                37.3896,
                -5.9814
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Granada: Alhambra Legend",
          "items": [
            {
              "type": "breakfast",
              "name": "Seville café",
              "coord": [
                37.3886,
                -5.9823
              ]
            },
            {
              "type": "hotel",
              "name": "Parador de Granada",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "sightseeing",
              "name": "Alhambra",
              "coord": [
                37.1761,
                -3.5881
              ]
            },
            {
              "type": "lunch",
              "name": "Los Diamantes",
              "coord": [
                37.1769,
                -3.5979
              ]
            },
            {
              "type": "sightseeing",
              "name": "Generalife Gardens",
              "coord": [
                37.1839,
                -3.5846
              ]
            },
            {
              "type": "dinner",
              "name": "Ruta del Azafrán",
              "coord": [
                37.1823,
                -3.5937
              ]
            }
          ]
        }
      ]
    },
    "b": {
      "name": "Hidden Gems & Deep Culture",
      "color": "#059669",
      "days": [
        {
          "day": 1,
          "title": "Salamanca: University Historic",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Salamanca",
              "coord": [
                40.9701,
                -5.6634
              ]
            },
            {
              "type": "breakfast",
              "name": "Local café",
              "coord": [
                40.9701,
                -5.6634
              ]
            },
            {
              "type": "sightseeing",
              "name": "University of Salamanca",
              "coord": [
                40.9667,
                -5.6637
              ]
            },
            {
              "type": "sightseeing",
              "name": "Plaza Mayor",
              "coord": [
                40.9629,
                -5.662
              ]
            },
            {
              "type": "lunch",
              "name": "Local restaurant",
              "coord": [
                40.9701,
                -5.6634
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cathedral",
              "coord": [
                40.9708,
                -5.6676
              ]
            },
            {
              "type": "dinner",
              "name": "Regional cuisine",
              "coord": [
                40.9701,
                -5.6634
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Segovia: Aqueduct & Castles",
          "items": [
            {
              "type": "breakfast",
              "name": "Salamanca café",
              "coord": [
                40.9701,
                -5.6634
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Segovia",
              "coord": [
                40.9429,
                -4.1084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Roman Aqueduct",
              "coord": [
                40.9433,
                -4.1189
              ]
            },
            {
              "type": "sightseeing",
              "name": "Alcázar Castle",
              "coord": [
                40.951,
                -4.1118
              ]
            },
            {
              "type": "lunch",
              "name": "Cochinillo (roasted pig)",
              "coord": [
                40.9429,
                -4.1084
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cathedral",
              "coord": [
                40.9461,
                -4.1177
              ]
            },
            {
              "type": "dinner",
              "name": "Local restaurant",
              "coord": [
                40.9429,
                -4.1084
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Ronda: Cliff Village Drama",
          "items": [
            {
              "type": "breakfast",
              "name": "Segovia hotel",
              "coord": [
                40.9429,
                -4.1084
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Ronda",
              "coord": [
                36.7417,
                -5.3329
              ]
            },
            {
              "type": "sightseeing",
              "name": "Puente Nuevo",
              "coord": [
                36.7424,
                -5.3356
              ]
            },
            {
              "type": "sightseeing",
              "name": "Old Town",
              "coord": [
                36.7399,
                -5.3295
              ]
            },
            {
              "type": "lunch",
              "name": "Mountain views restaurant",
              "coord": [
                36.7417,
                -5.3329
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bullring",
              "coord": [
                36.7466,
                -5.3289
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner with views",
              "coord": [
                36.7417,
                -5.3329
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Córdoba: Caliphate Legacy",
          "items": [
            {
              "type": "breakfast",
              "name": "Ronda café",
              "coord": [
                36.7417,
                -5.3329
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Cordoba",
              "coord": [
                37.8882,
                -4.7794
              ]
            },
            {
              "type": "sightseeing",
              "name": "Mosque-Cathedral",
              "coord": [
                37.8777,
                -4.7797
              ]
            },
            {
              "type": "sightseeing",
              "name": "Jewish Quarter",
              "coord": [
                37.8844,
                -4.7829
              ]
            },
            {
              "type": "lunch",
              "name": "Local Córdoba cuisine",
              "coord": [
                37.8882,
                -4.7794
              ]
            },
            {
              "type": "sightseeing",
              "name": "Roman Bridge",
              "coord": [
                37.8825,
                -4.7907
              ]
            },
            {
              "type": "dinner",
              "name": "Evening restaurant",
              "coord": [
                37.8882,
                -4.7794
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Bilbao: Art & Modernity",
          "items": [
            {
              "type": "breakfast",
              "name": "Cordoba hotel",
              "coord": [
                37.8882,
                -4.7794
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Bilbao",
              "coord": [
                43.2627,
                -2.9253
              ]
            },
            {
              "type": "sightseeing",
              "name": "Guggenheim",
              "coord": [
                43.2183,
                -2.9357
              ]
            },
            {
              "type": "lunch",
              "name": "Nerua",
              "coord": [
                43.2183,
                -2.9357
              ]
            },
            {
              "type": "sightseeing",
              "name": "Old Town",
              "coord": [
                43.2556,
                -2.9217
              ]
            },
            {
              "type": "dinner",
              "name": "Guria Etxea",
              "coord": [
                43.2556,
                -2.9217
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "San Sebastián: Culinary Capital",
          "items": [
            {
              "type": "breakfast",
              "name": "Bilbao café",
              "coord": [
                43.2627,
                -2.9253
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel de Inglaterra",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "sightseeing",
              "name": "La Concha Beach",
              "coord": [
                43.3195,
                -1.9838
              ]
            },
            {
              "type": "lunch",
              "name": "Arzak",
              "coord": [
                43.3244,
                -1.9893
              ]
            },
            {
              "type": "sightseeing",
              "name": "Parte Vieja (Old Town)",
              "coord": [
                43.3167,
                -1.9815
              ]
            },
            {
              "type": "dinner",
              "name": "Akelarre",
              "coord": [
                43.2906,
                -1.9859
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Barcelona: Gothic Beauty",
          "items": [
            {
              "type": "breakfast",
              "name": "San Sebastián café",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "hotel",
              "name": "Mercer Hotel Barcelona",
              "coord": [
                41.3835,
                2.1749
              ]
            },
            {
              "type": "sightseeing",
              "name": "Gothic Quarter Walking",
              "coord": [
                41.3835,
                2.1749
              ]
            },
            {
              "type": "lunch",
              "name": "7 Portes",
              "coord": [
                41.3781,
                2.1743
              ]
            },
            {
              "type": "sightseeing",
              "name": "Santa Maria del Pi",
              "coord": [
                41.381,
                2.1614
              ]
            },
            {
              "type": "dinner",
              "name": "Dos Palillos",
              "coord": [
                41.3886,
                2.1729
              ]
            }
          ]
        }
      ]
    },
    "c": {
      "name": "Family Comfort",
      "color": "#D97706",
      "days": [
        {
          "day": 1,
          "title": "Madrid: Easy Start",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Retiro Park",
              "coord": [
                40.4116,
                -3.6853
              ]
            },
            {
              "type": "lunch",
              "name": "Park café",
              "coord": [
                40.4116,
                -3.6853
              ]
            },
            {
              "type": "nap",
              "name": "Rest at hotel",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "dinner",
              "name": "Casa Lucio",
              "coord": [
                40.4111,
                -3.7109
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Madrid: Culture (Kid Paced)",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Zoo",
              "coord": [
                40.4293,
                -3.6742
              ]
            },
            {
              "type": "lunch",
              "name": "Zoo restaurant",
              "coord": [
                40.4293,
                -3.6742
              ]
            },
            {
              "type": "nap",
              "name": "Hotel nap",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Interactive museum",
              "coord": [
                40.4051,
                -3.6934
              ]
            },
            {
              "type": "dinner",
              "name": "Family dinner",
              "coord": [
                40.417272,
                -3.700392
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Barcelona: Beach & Park",
          "items": [
            {
              "type": "breakfast",
              "name": "Travel breakfast",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "lunch",
              "name": "Beachfront restaurant",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "nap",
              "name": "Rest",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "sightseeing",
              "name": "Barceloneta Beach",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "dinner",
              "name": "Family restaurant",
              "coord": [
                41.3865,
                2.1929
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Barcelona: Kid Fun",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "sightseeing",
              "name": "Park Güell",
              "coord": [
                41.4145,
                2.1527
              ]
            },
            {
              "type": "lunch",
              "name": "Park café",
              "coord": [
                41.4145,
                2.1527
              ]
            },
            {
              "type": "nap",
              "name": "Hotel rest",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "sightseeing",
              "name": "Zoo",
              "coord": [
                41.3851,
                2.2077
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                41.3865,
                2.1929
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Barcelona: Gaudí Easy",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sagrada Familia",
              "coord": [
                41.4036,
                2.1744
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch",
              "coord": [
                41.4036,
                2.1744
              ]
            },
            {
              "type": "nap",
              "name": "Rest",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "sightseeing",
              "name": "Casa Batlló",
              "coord": [
                41.3915,
                2.1654
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                41.3865,
                2.1929
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Seville: Relaxed Pace",
          "items": [
            {
              "type": "breakfast",
              "name": "Barcelona breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "hotel",
              "name": "Casa Imperial",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "nap",
              "name": "Afternoon rest",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "sightseeing",
              "name": "Plaza de España",
              "coord": [
                37.3736,
                -5.9899
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                37.3927,
                -5.9842
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Seville: Easy Exploration",
          "items": [
            {
              "type": "hotel",
              "name": "Casa Imperial",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cathedral",
              "coord": [
                37.386,
                -5.9845
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "nap",
              "name": "Rest",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "sightseeing",
              "name": "River walk",
              "coord": [
                37.3886,
                -5.9823
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                37.3927,
                -5.9842
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Granada: Alhambra Wonder",
          "items": [
            {
              "type": "breakfast",
              "name": "Seville breakfast",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "hotel",
              "name": "Parador de Granada",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "nap",
              "name": "Rest",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "sightseeing",
              "name": "Alhambra",
              "coord": [
                37.1761,
                -3.5881
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                37.1763,
                -3.5883
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Granada: Rest Day",
          "items": [
            {
              "type": "hotel",
              "name": "Parador de Granada",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "sightseeing",
              "name": "Albaicín neighborhood walk",
              "coord": [
                37.1823,
                -3.5937
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch",
              "coord": [
                37.1769,
                -3.5979
              ]
            },
            {
              "type": "nap",
              "name": "Afternoon rest",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "sightseeing",
              "name": "Viewpoints",
              "coord": [
                37.1823,
                -3.5937
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                37.1763,
                -3.5883
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Return Madrid",
          "items": [
            {
              "type": "breakfast",
              "name": "Granada breakfast",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "sightseeing",
              "name": "Morning Generalife Gardens",
              "coord": [
                37.1839,
                -3.5846
              ]
            },
            {
              "type": "lunch",
              "name": "Granada lunch",
              "coord": [
                37.1769,
                -3.5979
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel in Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "optional",
              "name": "Evening walk",
              "coord": [
                40.4155,
                -3.7081
              ]
            },
            {
              "type": "dinner",
              "name": "Farewell dinner",
              "coord": [
                40.417272,
                -3.700392
              ]
            }
          ]
        }
      ]
    },
    "d": {
      "name": "Foodie Deep-Dive",
      "color": "#DC2626",
      "days": [
        {
          "day": 1,
          "title": "San Sebastián: Culinary Begin",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel de Inglaterra",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "breakfast",
              "name": "Coastal breakfast",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "sightseeing",
              "name": "Pintxo Bar Crawl",
              "coord": [
                43.3167,
                -1.9815
              ]
            },
            {
              "type": "lunch",
              "name": "Arzak",
              "coord": [
                43.3244,
                -1.9893
              ]
            },
            {
              "type": "sightseeing",
              "name": "Local market tour",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "dinner",
              "name": "Akelarre",
              "coord": [
                43.2906,
                -1.9859
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "San Sebastián: Michelin Deep",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel de Inglaterra",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast with views",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "lunch",
              "name": "Martín Berasategui",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "sightseeing",
              "name": "Fish market visit",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cider house tour",
              "coord": [
                43.2906,
                -1.9859
              ]
            },
            {
              "type": "dinner",
              "name": "Local pintxo bars",
              "coord": [
                43.3167,
                -1.9815
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Basque Country: Gastro Trail",
          "items": [
            {
              "type": "breakfast",
              "name": "San Sebastián café",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Bilbao",
              "coord": [
                43.2627,
                -2.9253
              ]
            },
            {
              "type": "lunch",
              "name": "Txuleta restaurant",
              "coord": [
                43.2627,
                -2.9253
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bilbao market",
              "coord": [
                43.2627,
                -2.9253
              ]
            },
            {
              "type": "dinner",
              "name": "Nerua",
              "coord": [
                43.2183,
                -2.9357
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Rioja: Wine & Food",
          "items": [
            {
              "type": "breakfast",
              "name": "Bilbao breakfast",
              "coord": [
                43.2627,
                -2.9253
              ]
            },
            {
              "type": "hotel",
              "name": "Rioja hotel",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bodega tour and tasting",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "lunch",
              "name": "Winery lunch",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "sightseeing",
              "name": "Wine harvest tour",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "dinner",
              "name": "Wine pairing dinner",
              "coord": [
                42.4623,
                -2.4426
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Rioja: Wine Mastery",
          "items": [
            {
              "type": "hotel",
              "name": "Rioja hotel",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "breakfast",
              "name": "Bodega breakfast",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "sightseeing",
              "name": "Marqués de Murrieta",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "lunch",
              "name": "Producer's lunch",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "sightseeing",
              "name": "Second bodega tour",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "dinner",
              "name": "Gourmet dinner",
              "coord": [
                42.4623,
                -2.4426
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Barcelona: Gourmet Capital",
          "items": [
            {
              "type": "breakfast",
              "name": "Rioja café",
              "coord": [
                42.4623,
                -2.4426
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "lunch",
              "name": "Tickets Bar",
              "coord": [
                41.3807,
                2.165
              ]
            },
            {
              "type": "sightseeing",
              "name": "La Boqueria market deep dive",
              "coord": [
                41.3817,
                2.1687
              ]
            },
            {
              "type": "dinner",
              "name": "Cinc Sentits",
              "coord": [
                41.39,
                2.1697
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Barcelona: Michelin Tasting",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "Market breakfast",
              "coord": [
                41.3817,
                2.1687
              ]
            },
            {
              "type": "lunch",
              "name": "Caelis",
              "coord": [
                41.39,
                2.1697
              ]
            },
            {
              "type": "sightseeing",
              "name": "Mercat food walk",
              "coord": [
                41.3817,
                2.1687
              ]
            },
            {
              "type": "dinner",
              "name": "El Bulli experience",
              "coord": [
                41.3874,
                2.1686
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Barcelona: Tapas Mastery",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "lunch",
              "name": "Cal Pep counter",
              "coord": [
                41.386,
                2.1815
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tapas bar tour",
              "coord": [
                41.3835,
                2.1749
              ]
            },
            {
              "type": "dinner",
              "name": "7 Portes traditions",
              "coord": [
                41.3781,
                2.1743
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Madrid: Culinary Grand Tour",
          "items": [
            {
              "type": "breakfast",
              "name": "Barcelona breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "lunch",
              "name": "Casa Botín",
              "coord": [
                40.4156,
                -3.6984
              ]
            },
            {
              "type": "sightseeing",
              "name": "Mercado San Miguel tour",
              "coord": [
                40.4161,
                -3.707
              ]
            },
            {
              "type": "dinner",
              "name": "El Club Allard",
              "coord": [
                40.4532,
                -3.6876
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Madrid: Foodie Finale",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Mercado sampling",
              "coord": [
                40.4161,
                -3.707
              ]
            },
            {
              "type": "lunch",
              "name": "Punto MX",
              "coord": [
                40.4385,
                -3.6921
              ]
            },
            {
              "type": "sightseeing",
              "name": "Market exploration",
              "coord": [
                40.4161,
                -3.707
              ]
            },
            {
              "type": "dinner",
              "name": "DSTAgE",
              "coord": [
                40.4262,
                -3.6825
              ]
            }
          ]
        }
      ]
    },
    "e": {
      "name": "Grand Tour",
      "color": "#7C3AED",
      "days": [
        {
          "day": 1,
          "title": "Madrid: Royal Welcome",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Royal Palace",
              "coord": [
                40.4178,
                -3.7142
              ]
            },
            {
              "type": "lunch",
              "name": "Casa Botín",
              "coord": [
                40.4156,
                -3.6984
              ]
            },
            {
              "type": "sightseeing",
              "name": "Prado Museum",
              "coord": [
                40.4145,
                -3.6929
              ]
            },
            {
              "type": "dinner",
              "name": "El Club Allard",
              "coord": [
                40.4532,
                -3.6876
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Madrid: Art & Museums",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Hotel Madrid",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Reina Sofía",
              "coord": [
                40.4051,
                -3.6934
              ]
            },
            {
              "type": "lunch",
              "name": "Casa Lucio",
              "coord": [
                40.4111,
                -3.7109
              ]
            },
            {
              "type": "sightseeing",
              "name": "Thyssen",
              "coord": [
                40.4181,
                -3.6948
              ]
            },
            {
              "type": "dinner",
              "name": "Punto MX",
              "coord": [
                40.4385,
                -3.6921
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Toledo: Medieval Time Warp",
          "items": [
            {
              "type": "breakfast",
              "name": "Madrid café",
              "coord": [
                40.417272,
                -3.700392
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Toledo",
              "coord": [
                39.8581,
                -4.0201
              ]
            },
            {
              "type": "lunch",
              "name": "Adolfo",
              "coord": [
                39.8634,
                -4.0238
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cathedral & Alcázar",
              "coord": [
                39.8581,
                -4.0201
              ]
            },
            {
              "type": "dinner",
              "name": "Local restaurant",
              "coord": [
                39.8581,
                -4.0201
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Córdoba: Caliphate Heritage",
          "items": [
            {
              "type": "breakfast",
              "name": "Toledo café",
              "coord": [
                39.8581,
                -4.0201
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Cordoba",
              "coord": [
                37.8882,
                -4.7794
              ]
            },
            {
              "type": "lunch",
              "name": "Local Córdoba",
              "coord": [
                37.8882,
                -4.7794
              ]
            },
            {
              "type": "sightseeing",
              "name": "Mosque-Cathedral",
              "coord": [
                37.8777,
                -4.7797
              ]
            },
            {
              "type": "dinner",
              "name": "Evening meal",
              "coord": [
                37.8882,
                -4.7794
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Seville: Moorish Splendor",
          "items": [
            {
              "type": "breakfast",
              "name": "Cordoba breakfast",
              "coord": [
                37.8882,
                -4.7794
              ]
            },
            {
              "type": "hotel",
              "name": "Casa Imperial",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "lunch",
              "name": "Enrique Becerra",
              "coord": [
                37.3898,
                -5.9876
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cathedral & Alcázar",
              "coord": [
                37.386,
                -5.9845
              ]
            },
            {
              "type": "dinner",
              "name": "Casa Morales",
              "coord": [
                37.3896,
                -5.9814
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Seville: River & Culture",
          "items": [
            {
              "type": "hotel",
              "name": "Casa Imperial",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "sightseeing",
              "name": "Plaza de España",
              "coord": [
                37.3736,
                -5.9899
              ]
            },
            {
              "type": "lunch",
              "name": "Local restaurant",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "sightseeing",
              "name": "River walk & Torre",
              "coord": [
                37.3886,
                -5.9823
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner",
              "coord": [
                37.3927,
                -5.9842
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Málaga: Mediterranean Gateway",
          "items": [
            {
              "type": "breakfast",
              "name": "Seville café",
              "coord": [
                37.3927,
                -5.9842
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Málaga",
              "coord": [
                36.7213,
                -4.4214
              ]
            },
            {
              "type": "lunch",
              "name": "Beachfront restaurant",
              "coord": [
                36.7213,
                -4.4214
              ]
            },
            {
              "type": "sightseeing",
              "name": "Picasso Museum",
              "coord": [
                36.7209,
                -4.4182
              ]
            },
            {
              "type": "dinner",
              "name": "Seafood dinner",
              "coord": [
                36.7213,
                -4.4214
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Granada: Alhambra Splendor",
          "items": [
            {
              "type": "breakfast",
              "name": "Málaga breakfast",
              "coord": [
                36.7213,
                -4.4214
              ]
            },
            {
              "type": "hotel",
              "name": "Parador de Granada",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "lunch",
              "name": "Los Diamantes",
              "coord": [
                37.1769,
                -3.5979
              ]
            },
            {
              "type": "sightseeing",
              "name": "Alhambra & Generalife",
              "coord": [
                37.1761,
                -3.5881
              ]
            },
            {
              "type": "dinner",
              "name": "Ruta del Azafrán",
              "coord": [
                37.1823,
                -3.5937
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Valencia: Mediterranean Flavor",
          "items": [
            {
              "type": "breakfast",
              "name": "Granada breakfast",
              "coord": [
                37.1763,
                -3.5883
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Valencia",
              "coord": [
                39.4699,
                -0.3763
              ]
            },
            {
              "type": "lunch",
              "name": "Paella lunch",
              "coord": [
                39.4699,
                -0.3763
              ]
            },
            {
              "type": "sightseeing",
              "name": "City of Arts",
              "coord": [
                39.4611,
                -0.3566
              ]
            },
            {
              "type": "dinner",
              "name": "Evening meal",
              "coord": [
                39.4699,
                -0.3763
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Barcelona: Gaudí Gateway",
          "items": [
            {
              "type": "breakfast",
              "name": "Valencia breakfast",
              "coord": [
                39.4699,
                -0.3763
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "lunch",
              "name": "Botafumeiro",
              "coord": [
                41.3868,
                2.1672
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sagrada Familia",
              "coord": [
                41.4036,
                2.1744
              ]
            },
            {
              "type": "dinner",
              "name": "Tickets Bar",
              "coord": [
                41.3807,
                2.165
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "Barcelona: Modernisme Deep",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "La Boqueria",
              "coord": [
                41.3817,
                2.1687
              ]
            },
            {
              "type": "sightseeing",
              "name": "Park Güell",
              "coord": [
                41.4145,
                2.1527
              ]
            },
            {
              "type": "lunch",
              "name": "Cal Pep",
              "coord": [
                41.386,
                2.1815
              ]
            },
            {
              "type": "sightseeing",
              "name": "Casa Batlló & others",
              "coord": [
                41.3915,
                2.1654
              ]
            },
            {
              "type": "dinner",
              "name": "Cinc Sentits",
              "coord": [
                41.39,
                2.1697
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Barcelona: Culture & Coast",
          "items": [
            {
              "type": "hotel",
              "name": "Hotel Arts Barcelona",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "breakfast",
              "name": "Breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "sightseeing",
              "name": "Gothic Quarter",
              "coord": [
                41.3835,
                2.1749
              ]
            },
            {
              "type": "lunch",
              "name": "7 Portes",
              "coord": [
                41.3781,
                2.1743
              ]
            },
            {
              "type": "sightseeing",
              "name": "MNAC Museum",
              "coord": [
                41.3694,
                2.1627
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner with views",
              "coord": [
                41.3865,
                2.1929
              ]
            }
          ]
        },
        {
          "day": 13,
          "title": "Basque Country: Culinary Summit",
          "items": [
            {
              "type": "breakfast",
              "name": "Barcelona breakfast",
              "coord": [
                41.3865,
                2.1929
              ]
            },
            {
              "type": "hotel",
              "name": "Hotel de Inglaterra",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "lunch",
              "name": "Arzak",
              "coord": [
                43.3244,
                -1.9893
              ]
            },
            {
              "type": "sightseeing",
              "name": "Parte Vieja",
              "coord": [
                43.3167,
                -1.9815
              ]
            },
            {
              "type": "dinner",
              "name": "Akelarre",
              "coord": [
                43.2906,
                -1.9859
              ]
            }
          ]
        },
        {
          "day": 14,
          "title": "Grand Tour Finale",
          "items": [
            {
              "type": "breakfast",
              "name": "San Sebastián",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "sightseeing",
              "name": "Final coastal walk",
              "coord": [
                43.3195,
                -1.9838
              ]
            },
            {
              "type": "lunch",
              "name": "Pintxo bar crawl",
              "coord": [
                43.3167,
                -1.9815
              ]
            },
            {
              "type": "optional",
              "name": "Museum visit",
              "coord": [
                43.3183,
                -1.9759
              ]
            },
            {
              "type": "dinner",
              "name": "Farewell dinner",
              "coord": [
                43.3183,
                -1.9759
              ]
            }
          ]
        }
      ]
    }
  }
}