{
  "key": "thailand",
  "name": "Thailand Family Adventure",
  "subtitle": "Interactive Trip Map",
  "flag": "🇹🇭",
  "defaultCenter": [
    13.75,
    100.5
  ],
  "defaultZoom": 6,
  "hotels": [
    {
      "name": "Capella Bangkok",
      "coord": [
        13.722,
        100.512
      ],
      "desc": "Luxury Hotel; Business / couples; luxury Thai hospitality",
      "longDesc": "Capella Bangkok reimagines luxury with private riverside villas and world-class Thai hospitality This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Mandarin Oriental, Bangkok",
      "coord": [
        13.7235,
        100.5138
      ],
      "desc": "Luxury Hotel in Bangkok (River); luxury Thai hospitality",
      "longDesc": "Mandarin Oriental preserves Bangkok legend with impeccable service and storied riverside heritage This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Four Seasons Hotel Bangkok at Chao Phraya River",
      "coord": [
        13.719,
        100.509
      ],
      "desc": "Luxury Hotel; Design + nightlife; luxury Thai hospitality",
      "longDesc": "Four Seasons Chao Phraya combines contemporary design with traditional Thai cultural elegance This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "The Siam Hotel Bangkok",
      "coord": [
        13.725,
        100.505
      ],
      "desc": "Boutique Luxury; Romance / design lovers",
      "longDesc": "The Siam curates intimate luxury through art, personal service, and quiet Bangkok charm This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Sindhorn Kempinski Hotel Bangkok",
      "coord": [
        13.746,
        100.539
      ],
      "desc": "Luxury Hotel; Wellness + city base; luxury Thai hospitality",
      "longDesc": "Sindhorn Kempinski blends wellness traditions with lush gardens and serene urban escape This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Dusit Thani Bangkok",
      "coord": [
        13.732,
        100.538
      ],
      "desc": "Luxury Hotel; Iconic Thai hospitality; luxury Thai hospitality",
      "longDesc": "Dusit Thani revives Thai hospitality icon with cultural heritage and convenient city heart location This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Rosewood Bangkok",
      "coord": [
        13.737,
        100.548
      ],
      "desc": "Luxury Hotel in Bangkok (Ploenchit); luxury Thai hospitality",
      "longDesc": "Rosewood Bangkok delivers ultra-luxury towers, personalized service, and prestigious fine dining This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Park Hyatt Bangkok",
      "coord": [
        13.7243,
        100.557
      ],
      "desc": "Luxury Hotel; Groups / urban luxury; luxury Thai hospitality",
      "longDesc": "Park Hyatt offers riverfront grandeur with spacious accommodations and easy Bangkok access This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "The Ritz-Carlton, Bangkok",
      "coord": [
        13.75,
        100.564
      ],
      "desc": "Luxury Hotel; Luxury with easy access; luxury Thai hospitality",
      "longDesc": "The Ritz-Carlton Bangkok provides flagship luxury within modern One Bangkok development This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "137 Pillars Suites & Residences Bangkok",
      "coord": [
        13.7452,
        100.5597
      ],
      "desc": "Luxury Hotel; Service + long stays; luxury Thai hospitality",
      "longDesc": "137 Pillars Suites delivers butler-style service with rooftop infinity pools and long-stay comfort This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Siam Kempinski Hotel Bangkok",
      "coord": [
        13.752,
        100.522
      ],
      "desc": "Luxury Hotel; Families + shopping; luxury Thai hospitality",
      "longDesc": "Anantara Siam Bangkok celebrates heritage with Thai-colonial design and world-class facilities This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "The Peninsula Bangkok",
      "coord": [
        13.7248,
        100.5095
      ],
      "desc": "Luxury Hotel; Riverside classic; luxury Thai hospitality",
      "longDesc": "Peninsula Bangkok sits on Chao Phraya with five-star tradition and signature Thai elegance This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Anantara Siam Bangkok Hotel",
      "coord": [
        13.743,
        100.513
      ],
      "desc": "Luxury Hotel in Bangkok (Ratchadamri); luxury Thai hospitality",
      "longDesc": "Sofitel So Bangkok showcases contemporary luxury with meaningful sustainability practices This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Bangkok Publishing Residence",
      "coord": [
        13.753732050807569,
        100.52300000000001
      ],
      "desc": "Boutique Hotel; Boutique charm; luxury Thai hospitality",
      "longDesc": "St. Regis Bangkok combines Thai artistry with butler service and sophisticated city living This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Mustang Blu",
      "coord": [
        13.839,
        100.60900000000001
      ],
      "desc": "Boutique Hotel in Bangkok (Chinatown); luxury Thai hospitality",
      "longDesc": "W Bangkok delivers playful modern luxury with vibrant nightlife and creative dining This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "SALA Rattanakosin",
      "coord": [
        13.7467,
        100.4905
      ],
      "desc": "Boutique Hotel; Views + Old Town; luxury Thai hospitality",
      "longDesc": "Hilton Bangkok offers reliable comfort with excellent facilities and convenient central location This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Amdaeng Riverside Hotel",
      "coord": [
        13.758032050807568,
        100.50280000000001
      ],
      "desc": "Boutique Hotel; Quiet recharge; luxury Thai hospitality",
      "longDesc": "Centara Grand Phuket Beach provides beachfront luxury with water sports and family activities This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Kimpton Maa-Lai Bangkok",
      "coord": [
        13.797,
        100.56700000000001
      ],
      "desc": "Lifestyle Luxury; Families + parks; luxury Thai hospitality",
      "longDesc": "Twinpalms Bangtao Phuket features tented architecture and tropical resort authenticity This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "InterContinental Khao Yai Resort",
      "coord": [
        13.7583,
        100.50526410161514
      ],
      "desc": "Design Resort; Design + nature; luxury Thai hospitality",
      "longDesc": "Angsana Laguna Phuket nestles in lagoon setting with water activities and peaceful escape This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Four Seasons Resort Chiang Mai",
      "coord": [
        18.789,
        98.995
      ],
      "desc": "Luxury Resort in Chiang Mai; luxury Thai hospitality",
      "longDesc": "Renaissance Koh Samui combines cultural experiences with pristine beach island relaxation This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "137 Pillars House Chiang Mai",
      "coord": [
        18.786,
        98.982
      ],
      "desc": "Boutique Luxury; Boutique heritage; luxury Thai hospitality",
      "longDesc": "Four Seasons Koh Samui offers jungle villas, private spas, and island luxury sophistication This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Raya Heritage",
      "coord": [
        18.791,
        98.989
      ],
      "desc": "Boutique Luxury; Slow Chiang Mai; luxury Thai hospitality",
      "longDesc": "The Passage Samui Villas provides intimate bungalow sanctuary with personalized service This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Aleenta Retreat Chiang Mai",
      "coord": [
        18.805,
        98.975
      ],
      "desc": "Boutique Wellness; Wellness + city access",
      "longDesc": "Belmond Napasai sits on private island with Thai-inspired elegance and wellness focus This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Four Seasons Tented Camp Golden Triangle",
      "coord": [
        19.9099,
        99.854
      ],
      "desc": "Tented Camp; Once-in-a-lifetime; luxury Thai hospitality",
      "longDesc": "Soneva Jani Koh Samui delivers ultra-luxury tents with retractable roofs and technology This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Chiva-Som Hua Hin",
      "coord": [
        12.5692,
        99.9555
      ],
      "desc": "Wellness Resort in Hua Hin; luxury Thai hospitality",
      "longDesc": "Kimpton Kitalay Samui features sustainable luxury with beachfront villas and wellness This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Aleenta Hua Hin Resort & Spa",
      "coord": [
        12.571,
        99.958
      ],
      "desc": "Boutique Resort; Beach + wellness; luxury Thai hospitality",
      "longDesc": "Hyatt Regency Centara Railay provides beach access with adventurous activity integration This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Amanpuri",
      "coord": [
        8.168,
        98.338
      ],
      "desc": "Ultra-Luxury Resort; Bucket-list luxury; luxury Thai hospitality",
      "longDesc": "Rayavadee Krabi nestles between limestone cliffs offering dramatic scenic luxury This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Anantara Layan Phuket Resort",
      "coord": [
        8.217,
        98.267
      ],
      "desc": "Luxury Resort in Phuket (Thalang); luxury Thai hospitality",
      "longDesc": "Amanpuri Phuket exemplifies understated ultra-luxury with villa privacy and tailor-made experiences This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Keemala",
      "coord": [
        8.138,
        98.348
      ],
      "desc": "Design Resort in Phuket (Kathu); luxury Thai hospitality",
      "longDesc": "Banyan Tree Phuket combines jungle setting with spa excellence and intimate accommodation This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Trisara",
      "coord": [
        8.166,
        98.339
      ],
      "desc": "Ultra-Luxury Resort; Beach access + privacy",
      "longDesc": "Evason Phuket features beachfront cottages with yoga, spa, and wellness holistic approach This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Rosewood Phuket",
      "coord": [
        8.12,
        98.325
      ],
      "desc": "Luxury Resort in Phuket (near Patong); luxury Thai hospitality",
      "longDesc": "Rosewood Phuket delivers modern Thai design with beach access and culinary prestige This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Sri Panwa",
      "coord": [
        8.209,
        98.359
      ],
      "desc": "Luxury Resort in Phuket (Cape Panwa); luxury Thai hospitality",
      "longDesc": "Six Senses Koh Yao Noi offers remote island sanctuary with sustainability and adventure This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "The Surin",
      "coord": [
        7.534000000000001,
        98.1887
      ],
      "desc": "Luxury Resort; Classic beach stay; luxury Thai hospitality",
      "longDesc": "Four Seasons Tented Camp Golden Triangle provides luxury jungle immersion in elephant landscape This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Twinpalms Bangtao Phuket Tented Resort",
      "coord": [
        8.153,
        98.303
      ],
      "desc": "Luxury Tented Resort; Glamping; luxury Thai hospitality",
      "longDesc": "Anantara Golden Triangle provides riverside cultural experiences in hill tribe region This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Six Senses Koh Yao Noi",
      "coord": [
        8.168000000000001,
        98.318
      ],
      "desc": "Luxury Eco-Resort in Koh Yao Noi (near Phuket)",
      "longDesc": "Singha Park Chiang Rai combines vineyard resort with northern Thailand wine culture This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Anantara Mai Khao Phuket Villas",
      "coord": [
        8.196,
        98.346
      ],
      "desc": "Luxury Resort in Phuket (Mai Khao); luxury Thai hospitality",
      "longDesc": "Banyan Tree Spa Resort Mayakobba blends northern charm with wellness and cultural traditions This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "COMO Point Yamu",
      "coord": [
        8.651732050807569,
        98.40100000000001
      ],
      "desc": "Luxury Resort; Wellness + views; luxury Thai hospitality",
      "longDesc": "Ping Nakara Jim Thompson showcases designer boutique Chiang Mai with Thai antique elegance This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Banyan Tree Phuket",
      "coord": [
        8.207,
        98.357
      ],
      "desc": "Luxury Resort in Phuket (Bang Tao); luxury Thai hospitality",
      "longDesc": "Tamarind Village Chiang Mai offers intimate old-town charm with cultural integration This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "SALA Phuket Mai Khao Beach Resort",
      "coord": [
        8.217,
        98.36699999999999
      ],
      "desc": "Boutique Resort in Phuket (Mai Khao); luxury Thai hospitality",
      "longDesc": "Dhara Dhevi Chiang Mai recreates Lanna kingdom with palatial architecture and luxury This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Aleenta Phuket Resort & Spa",
      "coord": [
        8.228,
        98.378
      ],
      "desc": "Luxury Resort; Crowd-free beach; luxury Thai hospitality",
      "longDesc": "Riverside House Chiang Mai provides riverside comfort with cultural and artistic ambiance This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Four Seasons Resort Koh Samui",
      "coord": [
        9.12,
        100.015
      ],
      "desc": "Ultra-Luxury Resort; Beach luxury; luxury Thai hospitality",
      "longDesc": "Akyra Manor Chiang Mai combines contemporary design with artistic Thai cultural expression This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Six Senses Samui",
      "coord": [
        9.135,
        100.02
      ],
      "desc": "Luxury Eco-Resort; Sustainable luxury; luxury Thai hospitality",
      "longDesc": "Malee Samui Beach Boutique delivers budget-luxury beach experience with authentic Thailand This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "The Ritz-Carlton, Koh Samui",
      "coord": [
        9.14,
        100.025
      ],
      "desc": "Luxury Resort in Koh Samui; luxury Thai hospitality",
      "longDesc": "Beyond Resort Katu Phuket provides intimate resort escape with peaceful garden sanctuary This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Kamalaya Wellness Sanctuary & Holistic Spa",
      "coord": [
        9.145,
        100.03
      ],
      "desc": "Wellness Retreat in Koh Samui (South); luxury Thai hospitality",
      "longDesc": "Khaolak Laguna Resort Khao Lak nestles beachfront with natural limestone beauty This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Cape Fahn Hotel",
      "coord": [
        9.15,
        100.035
      ],
      "desc": "Luxury Resort; Romance / seclusion; luxury Thai hospitality",
      "longDesc": "Katathani Phuket Beach Resort spans beachfront with multiple pools and activity variety This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Kimpton Kitalay Samui",
      "coord": [
        9.233,
        100.123
      ],
      "desc": "Lifestyle Luxury in Koh Samui (Choeng Mon)",
      "longDesc": "Hilton Phuket Arcadia Resort offers comprehensive family resort amenities and beach access This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Anantara Lawana Koh Samui Resort",
      "coord": [
        9.157,
        100.047
      ],
      "desc": "Luxury Resort; Couples + families; luxury Thai hospitality",
      "longDesc": "Outrigger Laguna Phuket features water-based activities and family-friendly resort experience This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Garrya Tongsai Bay Samui",
      "coord": [
        9.17,
        100.06
      ],
      "desc": "Luxury Resort in Koh Samui (Tongsai Bay)",
      "longDesc": "Hua Hin Railway Hotel preserves historic coastal charm from Thai railway era This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Samujana Villas",
      "coord": [
        9.198,
        100.08800000000001
      ],
      "desc": "Luxury Villas in Koh Samui (NE); luxury Thai hospitality",
      "longDesc": "Centara Grand Hua Hin combines heritage beach town with modern resort comfort This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    },
    {
      "name": "Silavadee Pool Spa Resort",
      "coord": [
        9.145,
        100.0086
      ],
      "desc": "Boutique Resort; Honeymoon / quiet; luxury Thai hospitality",
      "longDesc": "Angsana Hua Hin provides oceanfront village setting with authentic Thailand beach culture This luxury sanctuary combines refined Thai design, personalized service, and exceptional facilities."
    }
  ],
  "restaurants": [
    {
      "name": "Sorn",
      "coord": [
        13.7095,
        100.592
      ],
      "desc": "Southern Thai (fine dining); Special occasion",
      "longDesc": "Sorn elevates southern Thai cuisine with artistic technique and ingredient authenticity The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Sühring",
      "coord": [
        13.744,
        100.51400000000001
      ],
      "desc": "Modern German in Bangkok (Sathorn) in Thailand; luxury and culture",
      "longDesc": "Gaggan pioneered molecular technique reshaping Thai gastronomy into global recognition The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Le Du",
      "coord": [
        13.7225,
        100.5288
      ],
      "desc": "Thai contemporary in Bangkok (Silom) in Thailand; luxury and culture",
      "longDesc": "Le Du explores seasonal Thai ingredients with contemporary culinary innovation and precision The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Nusara",
      "coord": [
        13.753,
        100.506
      ],
      "desc": "Thai (fine dining); Special occasion in Thailand; luxury and culture",
      "longDesc": "Issaya Siamese Club serves royal heritage recipes in intimate garden dining sanctuary The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Restaurant Potong",
      "coord": [
        13.7563,
        100.5078
      ],
      "desc": "Thai-Chinese (fine dining); Foodies in Thailand; luxury and culture",
      "longDesc": "Nahm presents historic Thai court cuisine with rigorous traditional technique and integrity The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "R-Haan",
      "coord": [
        13.7523,
        100.50872820323028
      ],
      "desc": "Royal Thai; Thai classics elevated in Thailand; luxury and culture",
      "longDesc": "Jay Fai perfected legendary street pad thai drawing pilgrimage lines worldwide The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Gaa",
      "coord": [
        13.747639745962156,
        100.5068
      ],
      "desc": "Indian-influenced contemporary; Foodies in Thailand; luxury and culture",
      "longDesc": "Sühring delivers refined German cuisine within Bangkok's cosmopolitan dining scene The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Baan Tepa",
      "coord": [
        13.771,
        100.54100000000001
      ],
      "desc": "Thai (farm-to-table) in Bangkok in Thailand; luxury and culture",
      "longDesc": "Coda Bangkok combines Italian traditions with Asian inspirations in creative fusion The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Blue by Alain Ducasse",
      "coord": [
        13.726,
        100.509
      ],
      "desc": "French (fine dining); Special occasion in Thailand; luxury and culture",
      "longDesc": "Indochine Bangkok celebrates Vietnamese-Thai-French colonial cuisine traditions The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Chef's Table (lebua)",
      "coord": [
        13.744299999999999,
        100.5018
      ],
      "desc": "French (fine dining); Celebrations in Thailand; luxury and culture",
      "longDesc": "Blue by Alain Ducasse brings Michelin-starred French mastery to Bangkok luxury The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Mezzaluna (lebua)",
      "coord": [
        13.744175644347017,
        100.4948
      ],
      "desc": "French/Japanese (fine dining); Celebrations",
      "longDesc": "Le Normandie presents classic French elegance within riverside heritage hotel walls The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Côte by Mauro Colagreco",
      "coord": [
        13.7483,
        100.48794359353946
      ],
      "desc": "French Riviera; Special occasion in Thailand; luxury and culture",
      "longDesc": "Hom celebrates forgotten Thai dishes revived through careful recipe archaeology The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Cadence by Dan Bark",
      "coord": [
        13.733732050807568,
        100.539
      ],
      "desc": "Contemporary in Bangkok in Thailand; luxury and culture",
      "longDesc": "Khao provides rustic northern Thai hillside cooking with regional authenticity The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Coda Bangkok",
      "coord": [
        13.734,
        100.54
      ],
      "desc": "Contemporary in Bangkok in Thailand; luxury and culture (1)",
      "longDesc": "Savelberg Amsterdam transports Dutch fine dining precision to Bangkok's cosmopolitan scene The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Cross",
      "coord": [
        13.73,
        100.542
      ],
      "desc": "Contemporary in Bangkok in Thailand; luxury and culture (2)",
      "longDesc": "Restaurant Potong mixes French classical technique with Thai ingredient innovation The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Inddee",
      "coord": [
        13.838000000000001,
        100.608
      ],
      "desc": "Indian (fine dining) in Bangkok in Thailand; luxury and culture",
      "longDesc": "Inddee expresses artistic Thai cuisine through visually stunning plate presentations The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Khaan",
      "coord": [
        13.7563,
        100.4838
      ],
      "desc": "Thai (fine dining); Thai-focused tasting",
      "longDesc": "Jampa delivers Assamese Indian traditions bringing spice mastery to Bangkok The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Sra Bua by Kiin Kiin",
      "coord": [
        13.759,
        100.52900000000001
      ],
      "desc": "Modern Thai in Bangkok (Siam Kempinski) in Thailand; luxury and culture",
      "longDesc": "Heh perfects street-level mango sticky rice and simple Thai sweet treats The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Gaggan at Louis Vuitton",
      "coord": [
        13.7663,
        100.48447949192432
      ],
      "desc": "Avant-garde; Once-in-a-lifetime in Thailand; luxury and culture",
      "longDesc": "Octave Rooftop Lounge elevates cocktails above Bangkok's glittering skyline The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Nahm",
      "coord": [
        13.726,
        100.536
      ],
      "desc": "Thai (fine dining); Classic Thai flavors",
      "longDesc": "Sky Bar sits atop Sirocco tower creating theatrical elevation above night Bangkok The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Issaya Siamese Club",
      "coord": [
        13.76,
        100.53
      ],
      "desc": "Thai (modern) in Bangkok in Thailand; luxury and culture",
      "longDesc": "Bar Sathorn offers craft cocktails with sophisticated mixology in Sathorn district The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Supanniga Eating Room",
      "coord": [
        13.775352558883258,
        100.49080000000001
      ],
      "desc": "Thai (regional); Casual but excellent in Thailand; luxury and culture",
      "longDesc": "Vesper serves artisanal cocktails within intimate speakeasy atmosphere The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Err",
      "coord": [
        13.753,
        100.504
      ],
      "desc": "Thai drinking food in Bangkok (Old Town)",
      "longDesc": "Dry Wave Cocktail Studio focuses pure technique, precision, and ingredient mastery The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Nai Mong Hoi Thod",
      "coord": [
        13.780299999999999,
        100.5018
      ],
      "desc": "Street food (oyster omelet); Street food lovers",
      "longDesc": "G.O.D. Restaurant blends Thai street food with hipster retro Bangkok aesthetic The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Guay Jub Ouan Pochana",
      "coord": [
        13.778816660498395,
        100.51480000000001
      ],
      "desc": "Street food (rolled noodle soup); Late-night eats",
      "longDesc": "Cross celebrates Western fine dining with wine focus in modern urban sanctuary The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Eat Me",
      "coord": [
        13.770299999999999,
        100.52604871130596
      ],
      "desc": "Modern international; Late dinner in Thailand; luxury and culture",
      "longDesc": "Err presents northeastern Thai isaan cuisine with fiery authentic preparation The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Le Normandie",
      "coord": [
        13.724,
        100.508
      ],
      "desc": "French (fine dining); Special occasion in Thailand; luxury and culture (1)",
      "longDesc": "Doy Kuay Teow Reua serves boat noodles from traditional rice barges on canals The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Prachak Pet Yang",
      "coord": [
        13.7563,
        100.5318
      ],
      "desc": "Cantonese roast duck; Local institution in Thailand; luxury and culture",
      "longDesc": "Cadence by Dan Bark delivers Nordic technique applied to Thai seasonal ingredients The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Raan Jay Fai",
      "coord": [
        13.7528,
        100.5048
      ],
      "desc": "Street food (crab omelet); Bucket-list street food",
      "longDesc": "Nusara brings provincial Thai cooking from Yasothon region with family recipes The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Thipsamai Pad Thai",
      "coord": [
        13.772,
        100.542
      ],
      "desc": "Street food (pad thai); Classic Bangkok bite",
      "longDesc": "Restaurant Sapai celebrates Isan tradition serving authentic Lao-Thai cuisine The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Som Tam Jay So",
      "coord": [
        13.7403,
        100.5295128129211
      ],
      "desc": "Isaan street food; Spice lovers in Thailand; luxury and culture",
      "longDesc": "Saneh Jaan teaches cooking classes sharing family techniques and flavor secrets The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Mae Varee Fruit Shop",
      "coord": [
        13.726855136271329,
        100.5188
      ],
      "desc": "Dessert (mango sticky rice); Dessert in Thailand; luxury and culture",
      "longDesc": "Krua Pla offers riverside fish restaurant serving fresh daily catch traditionally The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Jae Aun Bua Loy Nam Khing",
      "coord": [
        13.7203,
        100.5018
      ],
      "desc": "Dessert (ginger dumplings); Dessert in Thailand; luxury and culture",
      "longDesc": "Taling Pling showcases northern Thai khao soi mastery from family tradition The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Doy Kuay Teow Reua",
      "coord": [
        13.814,
        100.584
      ],
      "desc": "Boat noodles in Bangkok (Victory Monument)",
      "longDesc": "Methalee serves northeast Thai cuisine evoking countryside village authenticity The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Octave Rooftop Lounge & Bar",
      "coord": [
        13.749,
        100.519
      ],
      "desc": "Rooftop bar in Bangkok (Thong Lo) in Thailand; luxury and culture",
      "longDesc": "Somtum Der perfects spicy papaya salad recipes from various Thai regions The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Banthat Thong Road (street food stretch)",
      "coord": [
        13.72339103465619,
        100.4828
      ],
      "desc": "Street food hub; Casual grazing in Thailand; luxury and culture",
      "longDesc": "Bunroei celebrates Thai desserts and sweets from traditional royal kitchen heritage The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Bar Us",
      "coord": [
        13.745,
        100.52
      ],
      "desc": "Cocktail bar in Bangkok in Thailand; luxury and culture",
      "longDesc": "Hua Seng Hong preserves Hakka Chinese-Thai fusion traditions of old Bangkok The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Dry Wave Cocktail Studio",
      "coord": [
        13.747,
        100.522
      ],
      "desc": "Cocktail bar in Bangkok in Thailand; luxury and culture (1)",
      "longDesc": "Boat Noodle Alley features legendary canal-based boat noodle stall heritage The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "BKK Social Club",
      "coord": [
        13.7363,
        100.46715898384862
      ],
      "desc": "Hotel bar (cocktails); Classic cocktails",
      "longDesc": "Chinatown Chariot serves elevated dim sum within historic Bangkok Chinese neighborhood The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Vesper",
      "coord": [
        13.749,
        100.524
      ],
      "desc": "Cocktail bar in Bangkok in Thailand; luxury and culture (2)",
      "longDesc": "Thai Suki serves traditional hot pot dining with Thai ingredient selections The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "G.O.D",
      "coord": [
        13.763,
        100.533
      ],
      "desc": "Cocktail bar in Bangkok in Thailand; luxury and culture (3)",
      "longDesc": "Victory Monument Food Court gathers famous street vendors under air-conditioned comfort The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Opium",
      "coord": [
        13.811,
        100.581
      ],
      "desc": "Cocktail bar in Bangkok (Chinatown) in Thailand; luxury and culture",
      "longDesc": "Or Tor Kor Market Restaurant brings fresh market ingredients to simple preparation The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Bar Sathorn",
      "coord": [
        13.767,
        100.537
      ],
      "desc": "Cocktail bar in Bangkok in Thailand; luxury and culture (4)",
      "longDesc": "Yaowarat Road at Night transforms into legendary street food paradise weekly The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "PRU",
      "coord": [
        8.652000000000001,
        98.40346410161514
      ],
      "desc": "Contemporary (fine dining); Special occasion",
      "longDesc": "Patpong Street Night Market offers international street food within historical district The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Jampa",
      "coord": [
        8.65,
        98.406
      ],
      "desc": "Farm-to-table (fine dining); Foodies in Thailand; luxury and culture",
      "longDesc": "Pratunam Market Food Zone combines fresh produce with prepared street foods The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Hom",
      "coord": [
        13.75,
        100.529
      ],
      "desc": "Fine dining in Phuket in Thailand; luxury and culture",
      "longDesc": "Khlong Lat Mayom Floating Market preserves traditional commerce on water The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Heh",
      "coord": [
        8.165,
        98.298
      ],
      "desc": "Fine dining in Phuket in Thailand; luxury and culture (1)",
      "longDesc": "Sampran Riverside Market combines floating tradition with contemporary shopping The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Khao (Four Seasons Resort Chiang Mai)",
      "coord": [
        18.79073205080757,
        98.99600000000001
      ],
      "desc": "Northern Thai in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Amphawa Floating Market specializes in seafood and evening social atmosphere The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "North by Four Seasons (FS Chiang Mai)",
      "coord": [
        18.85,
        99.05199999999999
      ],
      "desc": "Wood-fired grill; Resort dinner in Thailand; luxury and culture",
      "longDesc": "Maeklong Railway Market transforms with arriving trains throughout market hours The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Meena Rice Based Cuisine",
      "coord": [
        18.7983,
        99.00529999999999
      ],
      "desc": "Thai (rice-centric); Lunch stop in Thailand; luxury and culture",
      "longDesc": "Banglamphu Market offers neighborhood local goods and prepared street foods The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Huen Jai Yong",
      "coord": [
        18.793,
        98.99
      ],
      "desc": "Northern Thai in Chiang Mai in Thailand; luxury and culture (1)",
      "longDesc": "Tha Chang Market sits near temples serving wholesale and retail shoppers daily The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Sky Bar",
      "coord": [
        13.746,
        100.515
      ],
      "desc": "Restaurant in  in Thailand; luxury and culture",
      "longDesc": "Yaowarat Seafood specializes in fresh catch with traditional Thai coastal preparations The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    },
    {
      "name": "Freebird",
      "coord": [
        13.748,
        100.517
      ],
      "desc": "Restaurant in  in Thailand; luxury and culture (1)",
      "longDesc": "Jok Prince serves traditional rice porridge breakfast with century egg variations The dining experience showcases authentic flavors and culinary excellence for discerning food lovers."
    }
  ],
  "experiences": [
    {
      "name": "Grand Palace & Wat Phra Kaew (Emerald Buddha)",
      "coord": [
        13.75,
        100.4914
      ],
      "desc": "Temple/Palace in Bangkok (Old Town) in Thailand; luxury and culture",
      "longDesc": "Grand Palace glitters in gold leaf presenting Thailand's spiritual governmental majesty This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Wat Pho (Reclining Buddha + massage school)",
      "coord": [
        13.7465,
        100.493
      ],
      "desc": "Temple in Bangkok (Old Town) in Thailand; luxury and culture",
      "longDesc": "Wat Phra Kaew houses emerald Buddha and symbolizes Thailand's deepest devotion This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Wat Arun (Temple of Dawn) via sunset boat view",
      "coord": [
        13.7437,
        100.4888
      ],
      "desc": "Temple / viewpoint in Bangkok (River) in Thailand; luxury and culture",
      "longDesc": "Wat Pho contains massive reclining Buddha and legendary Thai massage training school This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Chao Phraya River ferry hop",
      "coord": [
        13.7568,
        100.50280000000001
      ],
      "desc": "Transport / sightseeing; Budget-friendly sightseeing",
      "longDesc": "Wat Arun rises across river displaying prang architecture along Chao Phraya This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Canal (khlong) tour",
      "coord": [
        13.7326,
        100.4883
      ],
      "desc": "Boat tour in Bangkok (Thonburi) in Thailand; luxury and culture",
      "longDesc": "Jim Thompson House preserves American Thai silk baron's art and teak home collections This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Jim Thompson House Museum",
      "coord": [
        13.7494,
        100.5286
      ],
      "desc": "Historic teakwood Thai mansion & museum",
      "longDesc": "Benjakitti Park Green Mile creates elevated tree canopy walking path through urban Bangkok This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Chinatown (Yaowarat) food crawl",
      "coord": [
        13.74,
        100.51
      ],
      "desc": "Neighborhood in Bangkok in Thailand; luxury and culture",
      "longDesc": "Lumphini Park offers lakeside sanctuary with tai chi, wildlife, and evening coolness This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Tingly Thai Cooking School",
      "coord": [
        13.735,
        100.541
      ],
      "desc": "Hands-on Bangkok cooking classes for groups",
      "longDesc": "Ancient City Muang Boran replicates Thailand's major landmarks in outdoor museum setting This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Blue Elephant Cooking School",
      "coord": [
        13.742,
        100.5305
      ],
      "desc": "Professional Thai culinary school in Bangkok",
      "longDesc": "Erawan National Park features seven-tiered waterfall hiking through jungle canopy This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Benjakitti Park skywalk (Green Mile)",
      "coord": [
        13.7598,
        100.5098
      ],
      "desc": "Park in Bangkok in Thailand; luxury and culture",
      "longDesc": "Phang Nga Bay showcases dramatic limestone formations rising from turquoise waters This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Pak Khlong Talat flower market",
      "coord": [
        13.757299999999999,
        100.49680000000001
      ],
      "desc": "Bangkok flower wholesale market with 6-color sections",
      "longDesc": "Railay Beach isolates between vertical limestone cliffs accessible only by longtail boat This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Chatuchak Weekend Market",
      "coord": [
        13.7999,
        100.55
      ],
      "desc": "Worlds largest weekend market with 15000+ stalls",
      "longDesc": "Koh Phi Phi provides turquoise lagoons and snorkeling through tropical marine ecosystems This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Bang Krachao ‘Green Lung’ bike ride",
      "coord": [
        13.685,
        100.48
      ],
      "desc": "Peaceful riverside pedal through orchards",
      "longDesc": "Similan Islands rank among world's premier diving destinations with coral and fish This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Foot massage stop",
      "coord": [
        13.754299999999999,
        100.50580000000001
      ],
      "desc": "Wellness in Bangkok in Thailand; luxury and culture",
      "longDesc": "Khao Yai National Park protects wildlife including elephants, gibbons, and hornbills This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Central Park Bangkok + Urban Sky Park",
      "coord": [
        13.7553,
        100.5038
      ],
      "desc": "Modern attraction in Bangkok in Thailand; luxury and culture",
      "longDesc": "Damnoen Saduak Floating Market represents iconic river commerce on traditional wooden boats This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Octave rooftop drinks",
      "coord": [
        13.7571,
        100.5053
      ],
      "desc": "Rooftop bar in Bangkok in Thailand; luxury and culture",
      "longDesc": "Amphawa Floating Market blends local commerce with firefly viewing evening atmosphere This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Ayutthaya ruins (UNESCO) day trip",
      "coord": [
        14.3596,
        100.5648
      ],
      "desc": "Historic site in Ayutthaya (from Bangkok)",
      "longDesc": "Chatuchak Weekend Market sprawls across acres with vendors, food, art, and discoveries This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Anantara Cruises – Ayutthaya Thousand Golden Temples Cruise",
      "coord": [
        14.361600000000001,
        100.5663
      ],
      "desc": "Luxury river cruise; Special occasion in Thailand; luxury and culture",
      "longDesc": "Chiang Mai Old City features dozens of temples showcasing northern Thai architecture This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Khao Yai National Park",
      "coord": [
        14.3727,
        99.0332
      ],
      "desc": "National park in Khao Yai (from Bangkok)",
      "longDesc": "Doi Suthep Temple sits mountaintop overlooking Chiang Mai with golden architecture This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "PB Valley Khao Yai Winery",
      "coord": [
        14.3627,
        99.0432
      ],
      "desc": "Winery in Khao Yai (from Bangkok) in Thailand; luxury and culture",
      "longDesc": "Wat Chedi Luang dominates old city with massive ancient chedi and cultural significance This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Kanchanaburi + Erawan Falls",
      "coord": [
        14.024700000000001,
        99.53469999999999
      ],
      "desc": "Nature / waterfall; Families (older kids)",
      "longDesc": "Wat Phra Singh preserves artistic Lanna temple traditions within old city walls This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Elephant Haven Thailand (no riding)",
      "coord": [
        14.0197,
        99.5312
      ],
      "desc": "Ethical elephant experience; Families in Thailand; luxury and culture",
      "longDesc": "Sunday Walking Street closes Nimman Road for vendor stalls and evening social gathering This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Doi Suthep Temple",
      "coord": [
        18.8048,
        98.9218
      ],
      "desc": "Temple / viewpoint; First-timers in Thailand; luxury and culture",
      "longDesc": "Chiang Mai Night Bazaar transformed into night market offering goods and street food This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Chiang Mai Old City temple walk",
      "coord": [
        18.787,
        98.993
      ],
      "desc": "Sightseeing in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Doi Inthanon National Park features Thailand's highest peak with forest and waterfalls This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Night markets (Chiang Mai)",
      "coord": [
        18.7873,
        98.9953
      ],
      "desc": "Market in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Chiang Rai Golden Triangle marks Laos-Myanmar-Thailand border area with river views This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Phuket Old Town (heritage stroll)",
      "coord": [
        7.885,
        98.388
      ],
      "desc": "Neighborhood in Phuket in Thailand; luxury and culture",
      "longDesc": "Wat Rong Khun White Temple displays contemporary Thai Buddhist artistic expression This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Wat Chalong",
      "coord": [
        7.8425,
        98.3378
      ],
      "desc": "Temple in Phuket in Thailand; luxury and culture",
      "longDesc": "Black House Chiang Rai juxtaposes dark contemporary architectural statement opposite white temple This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Big Buddha viewpoint",
      "coord": [
        7.8275,
        98.313
      ],
      "desc": "Viewpoint in Phuket in Thailand; luxury and culture",
      "longDesc": "Sukhothai Historical Park preserves ancient kingdom ruins spread across managed archaeological site This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Nai Harn Beach",
      "coord": [
        7.8340000000000005,
        98.3687
      ],
      "desc": "Secluded southern Phuket beach with turquoise water",
      "longDesc": "Si Satchanalai Historical Park extends Sukhothai era temples within intimate forest setting This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Kata Beach",
      "coord": [
        7.8208,
        98.2987
      ],
      "desc": "Family-friendly Phuket beach south of Patong",
      "longDesc": "Kamphaengphet Historical Park protects alternative ancient capital ruins and regional temples This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Ethical elephant visit (Phuket)",
      "coord": [
        7.784000000000001,
        98.3587
      ],
      "desc": "Wildlife/ethical in Phuket in Thailand; luxury and culture",
      "longDesc": "Ayutthaya Historical Park sprawls across former capital showing three kingdoms period splendor This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Ang Thong National Marine Park day trip",
      "coord": [
        9.482,
        100.145
      ],
      "desc": "Boat day trip; Snorkeling + hikes in Thailand; luxury and culture",
      "longDesc": "Wat Mahathat features Buddha heads intertwined within tree roots creating iconic image This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Island-hopping (Thailand’s beaches)",
      "coord": [
        9.25,
        99.8
      ],
      "desc": "Multi-day boat tour of Andaman islands",
      "longDesc": "Three Pagodas Pass in Kanchanaburi marks border while celebrating international friendship This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "100 Tonson Foundation (contemporary art)",
      "coord": [
        13.7575,
        100.5043
      ],
      "desc": "Gallery in Bangkok (Ploenchit) in Thailand; luxury and culture",
      "longDesc": "Bridge Over River Kwai memorializes WWII POW laborer history with museum exhibits This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Bangkok rooftop bars (general)",
      "coord": [
        13.7593,
        100.50580000000001
      ],
      "desc": "Nightlife in Bangkok in Thailand; luxury and culture",
      "longDesc": "River Kwai Raft Accommodation allows sleeping on bamboo rafts floating river This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Bar.Yard rooftop",
      "coord": [
        13.7595,
        100.506
      ],
      "desc": "Rooftop bar in Bangkok (Kimpton Maa-Lai)",
      "longDesc": "Elephant Nature Park offers ethical human-elephant contact with sanctuary environment This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Nobu Bangkok rooftop",
      "coord": [
        13.7591,
        100.5063
      ],
      "desc": "Rooftop dining/bar in Bangkok (The Empire)",
      "longDesc": "Chiang Mai Night Farang Thai Cooking teaches family recipes in home studio setting This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Erawan Museum",
      "coord": [
        13.741299999999999,
        100.5318
      ],
      "desc": "Museum/temple-like in Bangkok area (Samut Prakan)",
      "longDesc": "Muay Thai Training Camp provides instruction in Thailand's national martial art tradition This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Old Town temple cluster (self-guided)",
      "coord": [
        13.757299999999999,
        100.4993
      ],
      "desc": "Walking tour in Bangkok (Old Town) in Thailand; luxury and culture",
      "longDesc": "Thai Spa Massage Classes teach traditional therapeutic massage lineage within relaxation This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Tuk-tuk evening tour (street food + highlights)",
      "coord": [
        13.758099999999999,
        100.5033
      ],
      "desc": "Guided tour; Families (older kids) in Thailand; luxury and culture",
      "longDesc": "Silk Weaving Workshops demonstrate Jim Thompson silk techniques in traditional looms This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Taling Chan Floating Market (half-day)",
      "coord": [
        13.7583,
        100.4988
      ],
      "desc": "Riverside market with local boat-seller stalls",
      "longDesc": "Celadon Pottery Classes teach northern Thai ceramic glazing and throwing traditions This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Wang Lang Market grazing",
      "coord": [
        13.7578,
        100.49980000000001
      ],
      "desc": "Historic wet market near Wang Lang pier",
      "longDesc": "Umbrella Workshop San Kamphaeng creates traditional hand-painted parasols and umbrellas This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Nang Loeng Market snack crawl",
      "coord": [
        13.758799999999999,
        100.5008
      ],
      "desc": "Neighborhood market near Democracy Monument",
      "longDesc": "Orchid Plantation Tours showcase commercial growing operations and tropical beauty This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Grasshopper Adventures – Bike Historic Ayutthaya Tour",
      "coord": [
        14.3546,
        100.56880000000001
      ],
      "desc": "Cycling tour; Active travelers in Thailand; luxury and culture",
      "longDesc": "Butterfly Farm displays indigenous species within netted flight garden environments This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Khao Yai and Beyond (guided nature tours)",
      "coord": [
        14.42,
        101.36
      ],
      "desc": "Jungle trekking with wildlife spotting",
      "longDesc": "Insectarium Collections present exotic insect species from region and world This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Chiang Mai Sunday Walking Street",
      "coord": [
        18.7883,
        98.9853
      ],
      "desc": "Night market in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Reptile Farm houses cobra shows and venom extraction demonstration exhibits This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Phuket Walking Street Market (Old Town)",
      "coord": [
        7.884,
        98.3887
      ],
      "desc": "Weekend night market in Phuket historic center",
      "longDesc": "Safari World combines drive-through safari with animal theme park attractions This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Beach club day (Phuket)",
      "coord": [
        7.904,
        98.3487
      ],
      "desc": "Beach club; Adults / older kids in Thailand; luxury and culture",
      "longDesc": "Siam Niramit presents Thai cultural history through immersive theatrical production This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Khao Sok National Park stay (Rainforest Camp)",
      "coord": [
        6.684,
        97.8887
      ],
      "desc": "Jungle lodge experience; Families in Thailand; luxury and culture",
      "longDesc": "Floating Market Sunrise Experience preserves traditional water commerce atmosphere This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    },
    {
      "name": "Elephant Hills (ethical safari-style camp)",
      "coord": [
        6.5840000000000005,
        97.7887
      ],
      "desc": "Ethical wildlife + camp; Families in Thailand; luxury and culture",
      "longDesc": "Cooking Class with Family teaches authentic recipes in intimate home studio setting This destination offers cultural immersion and unforgettable memories for travelers of all interests."
    }
  ],
  "kidFriendly": [
    {
      "name": "Benjakitti Park (Green Mile skywalk)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Park for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Benjakitti Park Green Mile elevates through canopy walkway with thrilling tree perspectives Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Pak Khlong Talat (Flower Market)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Market / photo stop; Ages Toddler+ in Thailand; luxury and culture",
      "longDesc": "Lumphini Park offers paddle boats, playgrounds, and wildlife among Bangkok urban greenery Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Chatuchak Weekend Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Market for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Ancient City Muang Boran recreates famous Thai landmarks within manageable outdoor museum Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Chao Phraya River ferry ride",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Boat ride for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Safari World combines open-air drive safari with circus animal shows and performances Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Canal (khlong) tour",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Boat tour for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Siam Niramit immerses children in Thai history through visually spectacular theatrical productions Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Jim Thompson House",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Museum / garden for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Chiang Mai Zoo preserves diverse wildlife species within hillside botanical garden setting Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Grand Palace & Wat Phra Kaew",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Temple/Palace for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Chiang Mai Night Bazaar features stalls, games, and food creating evening entertainment Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Wat Pho (Reclining Buddha)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Temple for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Phuket Aquarium showcases tropical marine species in modern interactive display facilities Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Wat Arun (sunset boat view)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Temple/viewpoint; Ages Toddler+ in Thailand; luxury and culture",
      "longDesc": "Phuket FantaSea combines cultural shows, animal performances, and theme park attractions Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Taling Chan Floating Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Floating market; Ages Toddler+ in Thailand; luxury and culture",
      "longDesc": "Bangkok Butterfly Garden creates netted flight environment showcasing Thailand's indigenous species Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Wang Lang Market (snack crawl)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Market for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Insectarium Museum displays fascinating insect species through educational engaging presentations Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Raan Jay Fai (watch the wok action)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Food experience for kids in Bangkok in Thailand; luxury and culture",
      "longDesc": "Reptile Zoo presents cobra shows and reptile handling experiences safely Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Ayutthaya ruins day trip",
      "coord": [
        14.3596,
        100.5648
      ],
      "desc": "Historic site for kids in Ayutthaya in Thailand; luxury and culture",
      "longDesc": "Mini Golf Chiang Mai provides creative putt-putt activities for family entertainment Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Khao Yai National Park day trip",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Nature for kids in Khao Yai in Thailand; luxury and culture",
      "longDesc": "Water Park Splash combines water slides and pools throughout summer months Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Erawan Falls (Kanchanaburi)",
      "coord": [
        14.0227,
        99.5332
      ],
      "desc": "Waterfall for kids in Kanchanaburi in Thailand; luxury and culture",
      "longDesc": "Thai Cooking Class for Kids teaches culinary traditions in age-appropriate instruction Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Elephant Haven Thailand (no riding)",
      "coord": [
        14.0227,
        99.5332
      ],
      "desc": "Ethical elephant experience; Ages 6+ in Thailand; luxury and culture",
      "longDesc": "Elephant Camp Experience offers safe elephant encounters with ethical sanctuary practices Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Doi Suthep Temple",
      "coord": [
        18.7883,
        98.9853
      ],
      "desc": "Temple/viewpoint for kids in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Zip-lining Chiang Mai provides treetop adventure through jungle canopy safely Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Chiang Mai Old City stroll",
      "coord": [
        18.7883,
        98.9853
      ],
      "desc": "Walking for kids in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Thai Massage Training Classes teach traditional therapeutic techniques for family sharing Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Chiang Mai night markets",
      "coord": [
        18.7883,
        98.9853
      ],
      "desc": "Market for kids in Chiang Mai in Thailand; luxury and culture",
      "longDesc": "Traditional Puppet Workshops create shadow puppets through hands-on making experiences Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Phuket Old Town heritage walk",
      "coord": [
        8.65,
        98.4
      ],
      "desc": "Neighborhood for kids in Phuket in Thailand; luxury and culture",
      "longDesc": "Fruit Orchard Tours showcase tropical cultivation with picking and tasting opportunities Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Phuket Walking Street Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Night market for kids in Phuket Old Town",
      "longDesc": "Bamboo Craft Workshops construct traditional toys and household items hands-on Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Kata Beach",
      "coord": [
        8.65,
        98.4
      ],
      "desc": "Beach for kids in Phuket in Thailand; luxury and culture",
      "longDesc": "Silk Weaving Demonstrations teach traditional techniques using ancient loom technology Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Nai Harn Beach",
      "coord": [
        8.65,
        98.4
      ],
      "desc": "Beach for kids in Phuket in Thailand; luxury and culture",
      "longDesc": "Celadon Pottery Classes encourage artistic ceramic creation and glazing exploration Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "The Ritz-Carlton, Koh Samui",
      "coord": [
        9.145,
        100.0086
      ],
      "desc": "Resort for kids in Koh Samui in Thailand; luxury and culture",
      "longDesc": "Orchid Nursery Tours display thousands of tropical blooms in cultivation settings Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Kimpton Kitalay Samui",
      "coord": [
        9.145,
        100.0086
      ],
      "desc": "Resort for kids in Koh Samui in Thailand; luxury and culture",
      "longDesc": "Bicycle Tour Chiang Mai combines pedal-powered exploration with cultural stops Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Elephant Hills (ethical camp)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Adventure camp for kids in Khao Sok area",
      "longDesc": "Kayaking Adventure combines water exploration with mangrove ecosystem viewing Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    },
    {
      "name": "Ang Thong National Marine Park day trip",
      "coord": [
        9.145,
        100.0086
      ],
      "desc": "Boat day trip for kids in Koh Samui (day trip)",
      "longDesc": "Night Safari offers modified zoo experience under evening lighting conditions Children enjoy hands-on learning, play, and family bonding moments in safe engaging environments."
    }
  ],
  "markets": [
    {
      "name": "Pak Khlong Talat (Flower Market)",
      "coord": [
        13.7403,
        100.493
      ],
      "desc": "Market (flowers); Late night / early morning",
      "longDesc": "Pak Khlong Talat operates dawn flower market from historical floating market era traditions This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Floral Café at Napasorn",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Café in Bangkok (Pak Khlong Talat) in Thailand; luxury and culture",
      "longDesc": "Damnoen Saduak preserves iconic floating market with longtail boats and riverside commerce This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Chatuchak Weekend Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Market (weekend); Weekend daytime in Thailand; luxury and culture",
      "longDesc": "Amphawa Floating Market combines active commerce with firefly watching evening activities This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Chinatown (Yaowarat)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Food district / night market streets; Evening",
      "longDesc": "Khlong Lat Mayom maintains traditional floating market experience away from tourist crowds This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Banthat Thong Road",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Street food strip in Bangkok in Thailand; luxury and culture",
      "longDesc": "Sampran Riverside Market blends floating market commerce with contemporary shopping amenities This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Taling Chan Floating Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Floating market; Weekend mornings in Thailand; luxury and culture",
      "longDesc": "Chatuchak Weekend Market sprawls enormous weekend merchandise spectacle drawing pilgrimage crowds This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Wang Lang Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Market (street food + shopping); Late morning / afternoon",
      "longDesc": "JJ Market Night brings weekday energy to northern Bangkok area shopping districts This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Nang Loeng Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Historic market; Morning / lunch in Thailand; luxury and culture",
      "longDesc": "Phahurat Indian Market concentrates Indian goods, textiles, and street food This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Or Tor Kor Market",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Premium produce market; Morning in Thailand; luxury and culture",
      "longDesc": "Yaowarat Gold Jewelry Market specializes in Thai gold trading with market energy This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Central Park Bangkok (food & Michelin-recommended center)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Mall + food hall; Afternoon / evening in Thailand; luxury and culture",
      "longDesc": "Chinatown Sampeng Lane focuses wholesale textiles, buttons, and sewing supplies This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Bang Rak Market (via cooking classes)",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Wet market in Bangkok (Bang Rak) in Thailand; luxury and culture",
      "longDesc": "Talad Noi preserves old warehouse district shophouse antiquing and textile browsing This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Eiah-Sae",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Old-school coffee shop; Morning in Thailand; luxury and culture",
      "longDesc": "Talad Rot Fai showcases vintage railway market furniture and curious goods This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Raan Jay Fai",
      "coord": [
        13.7403,
        100.493
      ],
      "desc": "Street food (queue-heavy); Lunch / dinner",
      "longDesc": "Tha Chang Market serves wholesale produce distribution for Bangkok neighborhood This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Thipsamai Pad Thai",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Street food in Bangkok in Thailand; luxury and culture",
      "longDesc": "Warorot Market concentrates dry goods, spices, textiles, and traditional medicines This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Mae Varee Fruit Shop",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Dessert shop; Afternoon / evening in Thailand; luxury and culture",
      "longDesc": "Sanam Luang Market offers fresh produce, flowers, and prepared street food daily This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Prachak Pet Yang",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Roast duck shop; Lunch / dinner in Thailand; luxury and culture",
      "longDesc": "Victory Monument Food Court gathers vendors in modern facility serving diverse cuisines This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    },
    {
      "name": "Doy Kuay Teow Reua",
      "coord": [
        13.7563,
        100.5018
      ],
      "desc": "Noodle spot in Bangkok (Victory Monument)",
      "longDesc": "Khao Yai National Park Market combines local produce with park visitor necessities This vibrant destination captures authentic local commerce, traditional vendors, and cultural atmosphere."
    }
  ],
  "cityCenters": {
    "Bangkok": [
      13.7563,
      100.5018,
      0.05
    ],
    "Chiang Mai": [
      18.7883,
      98.9853,
      0.04
    ],
    "Phuket": [
      8.65,
      98.4,
      0.06
    ],
    "Koh Samui": [
      9.145,
      100.0086,
      0.03
    ],
    "Krabi": [
      8.0863,
      98.9063,
      0.04
    ],
    "Chiang Rai": [
      19.9099,
      99.854,
      0.04
    ],
    "Sukhothai": [
      17.013,
      99.8232,
      0.02
    ],
    "Kanchanaburi": [
      14.0227,
      99.5332,
      0.03
    ],
    "Ayutthaya": [
      14.3596,
      100.5648,
      0.03
    ],
    "Railay Beach": [
      8.8176,
      98.8344,
      0.02
    ],
    "Phi Phi": [
      7.7519,
      98.7738,
      0.02
    ]
  },
  "itineraryData": {
    "a": {
      "name": "Greatest Hits",
      "color": "#2563EB",
      "days": [
        {
          "day": 1,
          "title": "Bangkok Arrival & Grand Palace",
          "items": [
            {
              "type": "hotel",
              "name": "Mandarin Oriental, Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "lunch",
              "name": "Gaggan",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "sightseeing",
              "name": "Grand Palace & Wat Phra Kaew",
              "coord": [
                13.7403,
                100.493
              ]
            },
            {
              "type": "dinner",
              "name": "Le Du",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Bangkok Temples & Markets",
          "items": [
            {
              "type": "breakfast",
              "name": "Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "sightseeing",
              "name": "Wat Pho (Reclining Buddha)",
              "coord": [
                13.7403,
                100.493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Wat Arun",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "lunch",
              "name": "Jay Fai",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "sightseeing",
              "name": "Floating Markets",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Chiang Mai Flight & Old City",
          "items": [
            {
              "type": "sightseeing",
              "name": "Chiang Mai Old City",
              "coord": [
                18.7883,
                98.9853
              ]
            },
            {
              "type": "hotel",
              "name": "Four Seasons Resort Chiang Mai",
              "coord": [
                18.7883,
                98.9853
              ]
            },
            {
              "type": "dinner",
              "name": "SP Chicken",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Chiang Mai Temples & Elephants",
          "items": [
            {
              "type": "breakfast",
              "name": "Chiang Mai",
              "coord": [
                18.7883,
                98.9853
              ]
            },
            {
              "type": "sightseeing",
              "name": "Doi Suthep Temple",
              "coord": [
                18.7883,
                98.9853
              ]
            },
            {
              "type": "sightseeing",
              "name": "Elephant Sanctuary",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "lunch",
              "name": "Cooking Class",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Phuket Beach & Nightlife",
          "items": [
            {
              "type": "hotel",
              "name": "Centara Grand",
              "coord": [
                8.65,
                98.4
              ]
            },
            {
              "type": "sightseeing",
              "name": "Patong Beach",
              "coord": [
                8.6345,
                98.2958
              ]
            },
            {
              "type": "dinner",
              "name": "Fresh seafood",
              "coord": [
                8.6345,
                98.2958
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Island Hopping: Phi Phi & Snorkeling",
          "items": [
            {
              "type": "sightseeing",
              "name": "Phi Phi Islands",
              "coord": [
                7.7519,
                98.7738
              ]
            },
            {
              "type": "lunch",
              "name": "Koh Phi Phi",
              "coord": [
                7.7519,
                98.7738
              ]
            },
            {
              "type": "sightseeing",
              "name": "Snorkeling",
              "coord": [
                7.7519,
                98.7738
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Phuket Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Phuket",
              "coord": [
                8.65,
                98.4
              ]
            }
          ]
        }
      ]
    },
    "b": {
      "name": "Hidden Gems",
      "color": "#059669",
      "days": [
        {
          "day": 1,
          "title": "Chiang Rai Arrival",
          "items": [
            {
              "type": "hotel",
              "name": "Angsana Laguna",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "sightseeing",
              "name": "Chiang Rai",
              "coord": [
                19.9099,
                99.854
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "White Temple & Hill Tribes",
          "items": [
            {
              "type": "breakfast",
              "name": "Chiang Rai",
              "coord": [
                19.9099,
                99.854
              ]
            },
            {
              "type": "sightseeing",
              "name": "Wat Rong Khun (White Temple)",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hill Tribe Experience",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Sukhothai Ancient Capital",
          "items": [
            {
              "type": "hotel",
              "name": "Sukhothai",
              "coord": [
                17.013,
                99.8232
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sukhothai Historical Park",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Kanchanaburi & River Kwai",
          "items": [
            {
              "type": "hotel",
              "name": "Kanchanaburi",
              "coord": [
                14.0227,
                99.5332
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bridge Over River Kwai",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "sightseeing",
              "name": "Erawan Waterfall",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Bangkok Return & Rooftop Bars",
          "items": [
            {
              "type": "hotel",
              "name": "Rosewood Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "dinner",
              "name": "Octave Rooftop Bar",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Bangkok Day Markets",
          "items": [
            {
              "type": "breakfast",
              "name": "Chatuchak Weekend Market",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "lunch",
              "name": "Pak Khlong Talat",
              "coord": [
                13.7403,
                100.493
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        }
      ]
    },
    "c": {
      "name": "Family Comfort",
      "color": "#D97706",
      "days": [
        {
          "day": 1,
          "title": "Bangkok Arrival",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Bangkok Temples",
          "items": [
            {
              "type": "sightseeing",
              "name": "Grand Palace",
              "coord": [
                13.7403,
                100.493
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Bangkok Markets",
          "items": [
            {
              "type": "sightseeing",
              "name": "Floating Markets",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Kid Activities",
          "items": [
            {
              "type": "sightseeing",
              "name": "Benjakitti Park",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Rest Day",
          "items": [
            {
              "type": "nap",
              "name": "Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Koh Samui Travel",
          "items": [
            {
              "type": "hotel",
              "name": "Koh Samui Beach Resort",
              "coord": [
                9.145,
                100.0086
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Beach Relaxation",
          "items": [
            {
              "type": "sightseeing",
              "name": "Chaweng Beach",
              "coord": [
                9.145,
                100.0086
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Chiang Mai Transfer",
          "items": [
            {
              "type": "hotel",
              "name": "Chiang Mai Resort",
              "coord": [
                18.7883,
                98.9853
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Chiang Mai Temples",
          "items": [
            {
              "type": "sightseeing",
              "name": "Doi Suthep",
              "coord": [
                18.7883,
                98.9853
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Chiang Mai",
              "coord": [
                18.7883,
                98.9853
              ]
            }
          ]
        }
      ]
    },
    "d": {
      "name": "Foodie Deep-Dive",
      "color": "#DC2626",
      "days": [
        {
          "day": 1,
          "title": "Bangkok Street Food",
          "items": [
            {
              "type": "hotel",
              "name": "Capella Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "dinner",
              "name": "Jay Fai",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Michelin Dining",
          "items": [
            {
              "type": "lunch",
              "name": "Gaggan",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "dinner",
              "name": "Le Du",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Floating Markets",
          "items": [
            {
              "type": "breakfast",
              "name": "Floating Markets",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "lunch",
              "name": "Sorn",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Bangkok Markets",
          "items": [
            {
              "type": "sightseeing",
              "name": "Chatuchak",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Chiang Mai Night Market",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Chiang Mai",
              "coord": [
                18.7883,
                98.9853
              ]
            },
            {
              "type": "sightseeing",
              "name": "Night Markets",
              "coord": [
                18.7883,
                98.9853
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Thai Cooking Class",
          "items": [
            {
              "type": "lunch",
              "name": "Cooking Class",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Chiang Mai Dining",
          "items": [
            {
              "type": "dinner",
              "name": "SP Chicken",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Southern Cuisine",
          "items": [
            {
              "type": "hotel",
              "name": "Krabi Resort",
              "coord": [
                8.0863,
                98.9063
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Seafood Feast",
          "items": [
            {
              "type": "lunch",
              "name": "Fresh Seafood",
              "coord": [
                8.0863,
                98.9063
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Krabi",
              "coord": [
                8.0863,
                98.9063
              ]
            }
          ]
        }
      ]
    },
    "e": {
      "name": "Grand Tour",
      "color": "#7C3AED",
      "days": [
        {
          "day": 1,
          "title": "Bangkok Arrival",
          "items": [
            {
              "type": "hotel",
              "name": "Mandarin Oriental",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Grand Palace & Temples",
          "items": [
            {
              "type": "sightseeing",
              "name": "Grand Palace",
              "coord": [
                13.7403,
                100.493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Wat Pho",
              "coord": [
                13.7403,
                100.493
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Ayutthaya Ancient Ruins",
          "items": [
            {
              "type": "sightseeing",
              "name": "Ayutthaya Historical Park",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Bangkok Markets & Rooftops",
          "items": [
            {
              "type": "sightseeing",
              "name": "Floating Markets",
              "coord": [
                13.7563,
                100.5018
              ]
            },
            {
              "type": "dinner",
              "name": "Octave Bar",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Chiang Mai Temples",
          "items": [
            {
              "type": "hotel",
              "name": "Four Seasons Chiang Mai",
              "coord": [
                18.7883,
                98.9853
              ]
            },
            {
              "type": "sightseeing",
              "name": "Doi Suthep",
              "coord": [
                18.7883,
                98.9853
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Elephant Sanctuary",
          "items": [
            {
              "type": "sightseeing",
              "name": "Elephant Nature Park",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Cooking & Culture",
          "items": [
            {
              "type": "lunch",
              "name": "Cooking Class",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Chiang Rai White Temple",
          "items": [
            {
              "type": "sightseeing",
              "name": "Wat Rong Khun",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Krabi & Railay",
          "items": [
            {
              "type": "hotel",
              "name": "Railay Beach",
              "coord": [
                8.8176,
                98.8344
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Island Hopping",
          "items": [
            {
              "type": "sightseeing",
              "name": "Phi Phi Islands",
              "coord": [
                7.7519,
                98.7738
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "Koh Samui Beach",
          "items": [
            {
              "type": "hotel",
              "name": "Koh Samui",
              "coord": [
                9.145,
                100.0086
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Beach Relaxation",
          "items": [
            {
              "type": "sightseeing",
              "name": "Chaweng Beach",
              "coord": [
                9.145,
                100.0086
              ]
            }
          ]
        },
        {
          "day": 13,
          "title": "Bangkok Return",
          "items": [
            {
              "type": "hotel",
              "name": "Rosewood Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        },
        {
          "day": 14,
          "title": "Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Bangkok",
              "coord": [
                13.7563,
                100.5018
              ]
            }
          ]
        }
      ]
    }
  }
}