{
  "key": "uk",
  "name": "United Kingdom Family Adventure",
  "subtitle": "Interactive Trip Map",
  "flag": "🇬🇧",
  "defaultCenter": [
    52.5,
    -1.5
  ],
  "defaultZoom": 6,
  "hotels": [
    {
      "name": "Claridge's",
      "coord": [
        51.512524,
        -0.147518
      ],
      "desc": "Art Deco icon, legendary service, afternoon tea, Mayfair",
      "longDesc": "A legendary Art Deco masterpiece in Mayfair since 1812, beloved for its impeccable service, sumptuous afternoon tea, and elegant rooms that feel like stepping into refined British tradition."
    },
    {
      "name": "The Connaught",
      "coord": [
        50.828321,
        -0.179141
      ],
      "desc": "Connaught Bar, Michelin-star dining, intimate Mayfair",
      "longDesc": "An intimate Mayfair gem famous for its world-class Connaught Bar and Michelin-starred restaurant—perfect for families seeking sophisticated yet welcoming luxury dining."
    },
    {
      "name": "The Dorchester",
      "coord": [
        50.710578,
        -2.441859
      ],
      "desc": "Grand dame, famed afternoon tea, family-friendly, Mayfair",
      "longDesc": "A true grand dame overlooking Park Lane, celebrated for its legendary afternoon tea service and family-friendly approach to five-star hospitality in central London."
    },
    {
      "name": "The Savoy",
      "coord": [
        51.510127,
        -0.120499
      ],
      "desc": "Classic riverfront, American Bar, steps from West End",
      "longDesc": "This iconic Thames-side hotel combines theatrical charm with timeless elegance, offering riverside views, the legendary American Bar, and proximity to West End shows and attractions."
    },
    {
      "name": "The Ritz London",
      "coord": [
        51.507191,
        -0.141425
      ],
      "desc": "Iconic dining room & tea, gilded heritage, Piccadilly",
      "longDesc": "London's most iconic dining destination, where the gilded dining room and afternoon tea are rites of passage; a symbol of heritage and grandeur since 1906."
    },
    {
      "name": "The Langham, London",
      "coord": [
        51.517658,
        -0.143566
      ],
      "desc": "Historic grand hotel, strong cocktail program, Marylebone",
      "longDesc": "A historic Marylebone landmark featuring beautiful period details, an excellent cocktail program, and thoughtful service that welcomes families seeking classic luxury."
    },
    {
      "name": "The Lanesborough",
      "coord": [
        51.5027,
        -0.1527
      ],
      "desc": "Regency-style grandeur, butler service, Hyde Park Corner",
      "longDesc": "A Regency-style palace near Hyde Park Corner with butler service, lavish interiors, and a peaceful setting perfect for families wanting personalized luxury."
    },
    {
      "name": "Brown's Hotel",
      "coord": [
        51.771146,
        -4.462195
      ],
      "desc": "Historic Mayfair, classic British hospitality, refined rooms",
      "longDesc": "One of Mayfair's oldest family-run hotels, combining historic charm with warm British hospitality and rooms that celebrate timeless design and comfort."
    },
    {
      "name": "The Berkeley",
      "coord": [
        51.689255,
        -2.457712
      ],
      "desc": "Rooftop pool, close to museums/Hyde Park, Knightsbridge",
      "longDesc": "A Knightsbridge favorite featuring a glamorous rooftop pool, excellent kids' facilities, and prime access to world-class museums and green spaces."
    },
    {
      "name": "Mandarin Oriental Hyde Park",
      "coord": [
        51.5024,
        -0.1599
      ],
      "desc": "Hyde Park location, Michelin-star dining, luxury spa",
      "longDesc": "Perfectly positioned for museum-hopping, this hotel combines Michelin-star dining, a serene spa, and easy access to Hyde Park and cultural attractions."
    },
    {
      "name": "Four Seasons at Park Lane",
      "coord": [
        53.547133,
        -1.845923
      ],
      "desc": "Refined rooms, top spa, strong dining, Hyde Park Corner",
      "longDesc": "Luxury personified with refined rooms, an award-winning spa, and exceptional dining—ideal for families who appreciate both comfort and culinary excellence."
    },
    {
      "name": "Bulgari Hotel London",
      "coord": [
        51.501362,
        -0.162844
      ],
      "desc": "Sleek design, spa & pool, Knightsbridge",
      "longDesc": "Bulgari Hotel London offers sleek design, spa & pool, knightsbridge in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Rosewood London",
      "coord": [
        51.517417,
        -0.118222
      ],
      "desc": "Big rooms, central for museums, strong afternoon tea, Holborn",
      "longDesc": "Rosewood London offers big rooms, central for museums, strong afternoon tea, holborn in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Shangri-La The Shard",
      "coord": [
        51.711145,
        -0.608984
      ],
      "desc": "Skyline views, iconic address, high-floor pool & bar",
      "longDesc": "Shangri-La The Shard offers skyline views, iconic address, high-floor pool & bar in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Raffles London at The OWO",
      "coord": [
        50.768879,
        0.281533
      ],
      "desc": "Landmark conversion, ultra-luxe suites, Whitehall",
      "longDesc": "Raffles London at The OWO offers landmark conversion, ultra-luxe suites, whitehall in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Peninsula London",
      "coord": [
        51.501515,
        -0.152095
      ],
      "desc": "New five-star, excellent dining & bar, Belgravia",
      "longDesc": "A modern five-star gem in Belgravia with rooftop bar, spa, multiple restaurants, and family suites designed for comfort and elegance."
    },
    {
      "name": "The Emory",
      "coord": [
        51.493468,
        -0.165744
      ],
      "desc": "All-suite Maybourne newcomer, spa/wellness, Knightsbridge",
      "longDesc": "The Emory offers all-suite maybourne newcomer, spa/wellness, knightsbridge in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Corinthia London",
      "coord": [
        51.506537,
        -0.124384
      ],
      "desc": "ESPA Life spa, elegant rooms, Westminster/Embankment",
      "longDesc": "A glamorous modern classic combining contemporary design with historic Art Deco elements, featuring an exceptional spa and multiple dining venues."
    },
    {
      "name": "Hotel Café Royal",
      "coord": [
        51.510177,
        -0.135717
      ],
      "desc": "Central, stylish, great for Soho/Covent Garden",
      "longDesc": "Hotel Café Royal offers central, stylish, great for soho/covent garden in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "NoMad London",
      "coord": [
        51.513558,
        -0.121937
      ],
      "desc": "Chic Covent Garden base, destination bar/restaurant",
      "longDesc": "NoMad London offers chic covent garden base, destination bar/restaurant in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "One Aldwych",
      "coord": [
        51.511766,
        -0.119395
      ],
      "desc": "Theatre district, families, warm service, Covent Garden",
      "longDesc": "One Aldwych offers theatre district, families, warm service, covent garden in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Beaumont",
      "coord": [
        51.5112,
        -0.1455
      ],
      "desc": "Art Deco vibe, tucked off busy streets, near Selfridges",
      "longDesc": "The Beaumont offers art deco vibe, tucked off busy streets, near selfridges in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "45 Park Lane",
      "coord": [
        53.559022,
        -1.817465
      ],
      "desc": "Contemporary luxury, park-side, Dorchester Collection",
      "longDesc": "45 Park Lane offers contemporary luxury, park-side, dorchester collection in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Goring",
      "coord": [
        51.522953,
        -1.139595
      ],
      "desc": "Belgravia charm, near Buckingham Palace, refined dining",
      "longDesc": "The Goring offers belgravia charm, near buckingham palace, refined dining in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Stafford London",
      "coord": [
        51.50587,
        -0.140145
      ],
      "desc": "Historic wine cellar, great for St James's/West End",
      "longDesc": "The Stafford London offers historic wine cellar, great for st james's/west end in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Flemings Mayfair",
      "coord": [
        51.506534,
        -0.145088
      ],
      "desc": "Polished boutique, Mayfair base",
      "longDesc": "Flemings Mayfair offers polished boutique, mayfair base in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Ham Yard Hotel",
      "coord": [
        51.573827,
        -1.199377
      ],
      "desc": "Firmdale design-forward Soho, family-friendly suites",
      "longDesc": "Ham Yard Hotel offers firmdale design-forward soho, family-friendly suites in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Londoner",
      "coord": [
        55.850311,
        -4.23045
      ],
      "desc": "Modern luxury, easy for West End, Leicester Square",
      "longDesc": "The Londoner offers modern luxury, easy for west end, leicester square in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Broadwick Soho",
      "coord": [
        51.513744,
        -0.135445
      ],
      "desc": "Design hotel with rooftop, heart of Soho",
      "longDesc": "Broadwick Soho offers design hotel with rooftop, heart of soho in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Ned",
      "coord": [
        51.513727,
        -0.090038
      ],
      "desc": "Grand banking hall conversion, multiple restaurants, rooftop pool",
      "longDesc": "The Ned offers grand banking hall conversion, multiple restaurants, rooftop pool in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The London EDITION",
      "coord": [
        51.516119,
        -0.092871
      ],
      "desc": "Ian Schrager vibe, great bar scene, Fitzrovia",
      "longDesc": "The London EDITION offers ian schrager vibe, great bar scene, fitzrovia in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Chiltern Firehouse",
      "coord": [
        51.618914,
        -0.773387
      ],
      "desc": "Celebrity magnet, strong dining, Marylebone",
      "longDesc": "Chiltern Firehouse offers celebrity magnet, strong dining, marylebone in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Hari",
      "coord": [
        51.266994,
        -1.089639
      ],
      "desc": "Discreet Belgravia base, good for museums/Hyde Park",
      "longDesc": "The Hari offers discreet belgravia base, good for museums/hyde park in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Number Sixteen",
      "coord": [
        50.945679,
        -0.882575
      ],
      "desc": "Firmdale townhouse, garden, near V&A/NHM, South Kensington",
      "longDesc": "Number Sixteen offers firmdale townhouse, garden, near v&a/nhm, south kensington in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Knightsbridge Hotel",
      "coord": [
        51.498188,
        -0.164169
      ],
      "desc": "Boutique comfort near Harrods and South Ken museums",
      "longDesc": "Knightsbridge Hotel offers boutique comfort near harrods and south ken museums in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Beaverbrook Town House",
      "coord": [
        51.403907,
        -0.303687
      ],
      "desc": "Stylish suites, Japanese restaurant, Chelsea",
      "longDesc": "Beaverbrook Town House offers stylish suites, japanese restaurant, chelsea in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "11 Cadogan Gardens",
      "coord": [
        51.493663,
        -0.15913
      ],
      "desc": "Relais & Châteaux townhouse suites, good for families",
      "longDesc": "11 Cadogan Gardens offers relais & châteaux townhouse suites, good for families in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Chelsea Townhouse",
      "coord": [
        51.482063,
        -0.186682
      ],
      "desc": "Townhouse style, Cadogan Gardens access, kitchenettes",
      "longDesc": "The Chelsea Townhouse offers townhouse style, cadogan gardens access, kitchenettes in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Batty Langley's",
      "coord": [
        51.520953,
        -0.077969
      ],
      "desc": "Georgian character, fireplaces, Spitalfields",
      "longDesc": "Batty Langley's offers georgian character, fireplaces, spitalfields in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Landmark London",
      "coord": [
        51.52178,
        -0.162824
      ],
      "desc": "Grand atrium, indoor pool, family rooms, Marylebone",
      "longDesc": "The Landmark London offers grand atrium, indoor pool, family rooms, marylebone in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Cliveden House",
      "coord": [
        51.551869,
        -0.684169
      ],
      "desc": "Historic estate, Thames-side grounds, Berkshire",
      "longDesc": "A stately home turned hotel in Berkshire, featuring Italianate gardens, fine dining, and the perfect blend of grandeur and cosy country hospitality."
    },
    {
      "name": "Coworth Park",
      "coord": [
        51.403777,
        -0.621589
      ],
      "desc": "Equestrian country retreat, Dorchester Collection, Ascot",
      "longDesc": "Coworth Park offers equestrian country retreat, dorchester collection, ascot in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Grove",
      "coord": [
        50.551543,
        -2.424765
      ],
      "desc": "Big grounds, pools, family activities, Hertfordshire",
      "longDesc": "The Grove offers big grounds, pools, family activities, hertfordshire in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Heckfield Place",
      "coord": [
        51.343885,
        -0.950422
      ],
      "desc": "Farm-to-table dining, country-house style, Hampshire",
      "longDesc": "Heckfield Place offers farm-to-table dining, country-house style, hampshire in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Beaverbrook",
      "coord": [
        51.277597,
        -0.310223
      ],
      "desc": "Grand estate, wellness, strong dining, Surrey",
      "longDesc": "Beaverbrook offers grand estate, wellness, strong dining, surrey in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Lucknam Park",
      "coord": [
        51.4547,
        -2.2578
      ],
      "desc": "Stately estate, spa, family cottages, near Bath",
      "longDesc": "Lucknam Park offers stately estate, spa, family cottages, near bath in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "The Newt in Somerset",
      "coord": [
        51.205,
        -2.665
      ],
      "desc": "Immersive gardens, farm-to-table dining, Somerset",
      "longDesc": "The Newt in Somerset offers immersive gardens, farm-to-table dining, somerset in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Soho Farmhouse",
      "coord": [
        58.195416,
        -6.743984
      ],
      "desc": "Cotswolds-luxe cabins, activities, great for groups",
      "longDesc": "Soho Farmhouse offers cotswolds-luxe cabins, activities, great for groups in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    },
    {
      "name": "Gleneagles",
      "coord": [
        56.283019,
        -3.752468
      ],
      "desc": "Iconic Scottish resort, golf/spa, great for families",
      "longDesc": "A Scottish destination spanning 850 acres with championship golf, multiple restaurants, equestrian facilities, and activities for every family interest."
    },
    {
      "name": "The Balmoral",
      "coord": [
        55.615321,
        -2.819554
      ],
      "desc": "Edinburgh landmark, great base for Old Town",
      "longDesc": "The Balmoral offers edinburgh landmark, great base for old town in a welcoming environment perfect for families seeking comfort and cultural immersion during their UK travels."
    }
  ],
  "restaurants": [
    {
      "name": "Alain Ducasse at The Dorchester",
      "coord": [
        50.715436,
        -2.436952
      ],
      "desc": "3 Michelin stars, French fine dining, Mayfair",
      "longDesc": "Alain Ducasse at The Dorchester serves exceptional cuisine celebrating 3 michelin stars, french fine dining, mayfair, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "CORE by Clare Smyth",
      "coord": [
        54.970102,
        -3.9694
      ],
      "desc": "3 Michelin stars, modern British, Notting Hill",
      "longDesc": "CORE by Clare Smyth serves exceptional cuisine celebrating 3 michelin stars, modern british, notting hill, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Hélène Darroze at The Connaught",
      "coord": [
        57.085534,
        -2.231852
      ],
      "desc": "3 Michelin stars, French fine dining, Mayfair",
      "longDesc": "Hélène Darroze at The Connaught serves exceptional cuisine celebrating 3 michelin stars, french fine dining, mayfair, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Restaurant Gordon Ramsay",
      "coord": [
        51.485508,
        -0.162064
      ],
      "desc": "3 Michelin stars, French fine dining, Chelsea",
      "longDesc": "Restaurant Gordon Ramsay serves exceptional cuisine celebrating 3 michelin stars, french fine dining, chelsea, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Sketch (Lecture Room & Library)",
      "coord": [
        56.558262,
        -3.577609
      ],
      "desc": "3 Michelin stars, contemporary French, iconic interiors",
      "longDesc": "Sketch (Lecture Room & Library) serves exceptional cuisine celebrating 3 michelin stars, contemporary french, iconic interiors, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Ledbury",
      "coord": [
        52.036731,
        -2.422345
      ],
      "desc": "3 Michelin stars, modern British, Notting Hill",
      "longDesc": "An elegant Notting Hill restaurant celebrating seasonal British ingredients with refined French technique and thoughtful service for special family occasions."
    },
    {
      "name": "A. Wong",
      "coord": [
        56.083994,
        -3.865643
      ],
      "desc": "2 Michelin stars, high-craft dim sum, Pimlico",
      "longDesc": "A. Wong serves exceptional cuisine celebrating 2 michelin stars, high-craft dim sum, pimlico, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Alex Dilling at Hotel Café Royal",
      "coord": [
        51.5123,
        -0.1335
      ],
      "desc": "2 Michelin stars, French, elegant hotel dining",
      "longDesc": "Alex Dilling at Hotel Café Royal serves exceptional cuisine celebrating 2 michelin stars, french, elegant hotel dining, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Brooklands by Claude Bosi",
      "coord": [
        51.61227,
        0.511059
      ],
      "desc": "2 Michelin stars, modern French/British, Peninsula London",
      "longDesc": "Brooklands by Claude Bosi serves exceptional cuisine celebrating 2 michelin stars, modern french/british, peninsula london, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Da Terra",
      "coord": [
        51.5269,
        -0.074
      ],
      "desc": "2 Michelin stars, inventive tasting menu, Bethnal Green",
      "longDesc": "Da Terra serves exceptional cuisine celebrating 2 michelin stars, inventive tasting menu, bethnal green, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Dinner by Heston Blumenthal",
      "coord": [
        51.502362,
        -0.160298
      ],
      "desc": "2 Michelin stars, historic British dishes reimagined",
      "longDesc": "Dinner by Heston Blumenthal serves exceptional cuisine celebrating 2 michelin stars, historic british dishes reimagined, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Gymkhana",
      "coord": [
        51.508483,
        -0.141552
      ],
      "desc": "2 Michelin stars, iconic Mayfair Indian",
      "longDesc": "Exceptional Indian fine dining in Mayfair, where nuanced spice work, beautiful presentations, and thoughtful service rival any Western restaurant."
    },
    {
      "name": "Humble Chicken",
      "coord": [
        51.440918,
        -0.414895
      ],
      "desc": "2 Michelin stars, Japanese/European counter, Soho",
      "longDesc": "Humble Chicken serves exceptional cuisine celebrating 2 michelin stars, japanese/european counter, soho, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "La Dame de Pic London",
      "coord": [
        51.515618,
        -0.091998
      ],
      "desc": "2 Michelin stars, French, City of London",
      "longDesc": "La Dame de Pic London serves exceptional cuisine celebrating 2 michelin stars, french, city of london, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Clove Club",
      "coord": [
        51.349476,
        -0.431932
      ],
      "desc": "2 Michelin stars, modern British tasting, Shoreditch",
      "longDesc": "The Clove Club serves exceptional cuisine celebrating 2 michelin stars, modern british tasting, shoreditch, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Ritz Restaurant",
      "coord": [
        54.345138,
        -7.630685
      ],
      "desc": "2 Michelin stars, French haute cuisine, Piccadilly",
      "longDesc": "The Ritz Restaurant serves exceptional cuisine celebrating 2 michelin stars, french haute cuisine, piccadilly, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Trivet",
      "coord": [
        51.222801,
        -0.329347
      ],
      "desc": "2 Michelin stars, modern European, Fat Duck alumni",
      "longDesc": "Trivet serves exceptional cuisine celebrating 2 michelin stars, modern european, fat duck alumni, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "1890 by Gordon Ramsay",
      "coord": [
        55.680106,
        -2.563132
      ],
      "desc": "1 Michelin star, French, inside The Savoy",
      "longDesc": "1890 by Gordon Ramsay serves exceptional cuisine celebrating 1 michelin star, french, inside the savoy, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Akoko",
      "coord": [
        51.517686,
        -0.136842
      ],
      "desc": "1 Michelin star, modern West African tasting, Fitzrovia",
      "longDesc": "Akoko serves exceptional cuisine celebrating 1 michelin star, modern west african tasting, fitzrovia, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Brat",
      "coord": [
        53.562117,
        -0.620657
      ],
      "desc": "1 Michelin star, Basque-inspired wood-fired, Shoreditch",
      "longDesc": "Brat serves exceptional cuisine celebrating 1 michelin star, basque-inspired wood-fired, shoreditch, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Ikoyi",
      "coord": [
        51.512429,
        -0.115147
      ],
      "desc": "Michelin-starred, West African-influenced, World's 50 Best",
      "longDesc": "Ikoyi serves exceptional cuisine celebrating michelin-starred, west african-influenced, world's 50 best, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Kol",
      "coord": [
        51.514795,
        -0.157533
      ],
      "desc": "Michelin-starred, Mexican with UK ingredients, Marylebone",
      "longDesc": "Kol serves exceptional cuisine celebrating michelin-starred, mexican with uk ingredients, marylebone, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "St. JOHN",
      "coord": [
        50.361375,
        -4.237622
      ],
      "desc": "Michelin-starred, nose-to-tail British classic, Clerkenwell",
      "longDesc": "St. JOHN serves exceptional cuisine celebrating michelin-starred, nose-to-tail british classic, clerkenwell, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Sabor",
      "coord": [
        57.169802,
        -2.102366
      ],
      "desc": "Michelin-starred, Spanish counter + dining room, Mayfair",
      "longDesc": "Sabor serves exceptional cuisine celebrating michelin-starred, spanish counter + dining room, mayfair, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Lyle's",
      "coord": [
        51.523779,
        -0.076388
      ],
      "desc": "Michelin-starred, ingredient-led set menu, Shoreditch",
      "longDesc": "Hyper-seasonal British cooking focused on extraordinary ingredients, with a relaxed cool vibe and wines that pair beautifully with each course."
    },
    {
      "name": "The Harwood Arms",
      "coord": [
        52.430723,
        -2.831155
      ],
      "desc": "Michelin-starred gastropub, Fulham",
      "longDesc": "The Harwood Arms serves exceptional cuisine celebrating michelin-starred gastropub, fulham, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "River Café",
      "coord": [
        52.045481,
        -3.196536
      ],
      "desc": "London classic Italian, terrace when warm, Hammersmith",
      "longDesc": "River Café serves exceptional cuisine celebrating london classic italian, terrace when warm, hammersmith, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Wolseley",
      "coord": [
        51.266994,
        -1.089639
      ],
      "desc": "All-day grand café, breakfast through late dinner, Piccadilly",
      "longDesc": "The Wolseley serves exceptional cuisine celebrating all-day grand café, breakfast through late dinner, piccadilly, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Rules",
      "coord": [
        52.453248,
        -0.111325
      ],
      "desc": "Historic British cooking, game season favorite, Covent Garden",
      "longDesc": "Rules serves exceptional cuisine celebrating historic british cooking, game season favorite, covent garden, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Palomar",
      "coord": [
        51.511221,
        -0.132708
      ],
      "desc": "Lively counter seating, modern Middle Eastern, Soho",
      "longDesc": "The Palomar serves exceptional cuisine celebrating lively counter seating, modern middle eastern, soho, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Connaught Bar",
      "coord": [
        51.692886,
        -0.192891
      ],
      "desc": "World's 50 Best, martini ritual, Mayfair",
      "longDesc": "Connaught Bar serves exceptional cuisine celebrating world's 50 best, martini ritual, mayfair, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Tayēr + Elementary",
      "coord": [
        52.387157,
        0.540975
      ],
      "desc": "World's 50 Best cocktails, inventive, Old Street",
      "longDesc": "Tayēr + Elementary serves exceptional cuisine celebrating world's 50 best cocktails, inventive, old street, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The American Bar (The Savoy)",
      "coord": [
        54.608482,
        -5.920005
      ],
      "desc": "Legendary hotel bar, classic cocktails, live music",
      "longDesc": "The American Bar (The Savoy) serves exceptional cuisine celebrating legendary hotel bar, classic cocktails, live music, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Scarfes Bar (Rosewood)",
      "coord": [
        56.019352,
        -3.755585
      ],
      "desc": "Illustrated interiors, refined cocktails, Holborn",
      "longDesc": "Scarfes Bar (Rosewood) serves exceptional cuisine celebrating illustrated interiors, refined cocktails, holborn, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Dukes Bar",
      "coord": [
        51.50557,
        -0.139607
      ],
      "desc": "Old-school martini temple, St James's",
      "longDesc": "Dukes Bar serves exceptional cuisine celebrating old-school martini temple, st james's, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Nightjar",
      "coord": [
        51.108534,
        0.225356
      ],
      "desc": "Live jazz + cocktails, book ahead, Shoreditch",
      "longDesc": "Nightjar serves exceptional cuisine celebrating live jazz + cocktails, book ahead, shoreditch, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Fat Duck",
      "coord": [
        51.507809,
        -0.7016
      ],
      "desc": "3 Michelin stars, theatrical tasting menus, Bray",
      "longDesc": "The Fat Duck serves exceptional cuisine celebrating 3 michelin stars, theatrical tasting menus, bray, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Waterside Inn",
      "coord": [
        52.731895,
        -1.139569
      ],
      "desc": "3 Michelin stars, classic riverside French, Bray",
      "longDesc": "The Waterside Inn serves exceptional cuisine celebrating 3 michelin stars, classic riverside french, bray, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Le Manoir aux Quat'Saisons",
      "coord": [
        51.7662,
        -1.1514
      ],
      "desc": "Belmond country house + 2-star dining, Oxfordshire",
      "longDesc": "Le Manoir aux Quat'Saisons serves exceptional cuisine celebrating belmond country house + 2-star dining, oxfordshire, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Moor Hall",
      "coord": [
        53.541564,
        -2.889865
      ],
      "desc": "3 Michelin stars, countryside destination, Lancashire",
      "longDesc": "Moor Hall serves exceptional cuisine celebrating 3 michelin stars, countryside destination, lancashire, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "L'Enclume",
      "coord": [
        54.201765,
        -2.953812
      ],
      "desc": "3 Michelin stars, farm-led tasting menu, Cumbria",
      "longDesc": "L'Enclume serves exceptional cuisine celebrating 3 michelin stars, farm-led tasting menu, cumbria, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Ynyshir",
      "coord": [
        51.626255,
        -3.412385
      ],
      "desc": "2 Michelin stars, immersive tasting, Wales",
      "longDesc": "Ynyshir serves exceptional cuisine celebrating 2 michelin stars, immersive tasting, wales, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Elystan Street",
      "coord": [
        51.126749,
        -2.739722
      ],
      "desc": "1 Michelin star, relaxed refined Chelsea dining",
      "longDesc": "An intimate French-inspired restaurant with outstanding seasonal cooking, thoughtful wine pairing, and the feeling of dining with dear friends."
    },
    {
      "name": "Five Fields",
      "coord": [
        53.869085,
        -2.354669
      ],
      "desc": "1 Michelin star, seasonal tasting menus, Chelsea",
      "longDesc": "Five Fields serves exceptional cuisine celebrating 1 michelin star, seasonal tasting menus, chelsea, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Frog by Adam Handling",
      "coord": [
        51.510761,
        -0.122032
      ],
      "desc": "1 Michelin star, playful tasting menu, Covent Garden",
      "longDesc": "Frog by Adam Handling serves exceptional cuisine celebrating 1 michelin star, playful tasting menu, covent garden, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Hide",
      "coord": [
        51.021492,
        -1.544929
      ],
      "desc": "1 Michelin star, design-forward dining, Green Park",
      "longDesc": "A two-level culinary experience in Mayfair—casual downstairs with food-forward cooking, elegant private dining above—pushing boundaries and expectations."
    },
    {
      "name": "Kitchen Table",
      "coord": [
        51.430387,
        -0.155709
      ],
      "desc": "1 Michelin star, intimate chef's table, Fitzrovia",
      "longDesc": "Kitchen Table serves exceptional cuisine celebrating 1 michelin star, intimate chef's table, fitzrovia, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Restaurant Story",
      "coord": [
        51.530687,
        -0.129478
      ],
      "desc": "Michelin-starred, narrative tasting menus, London Bridge",
      "longDesc": "Restaurant Story serves exceptional cuisine celebrating michelin-starred, narrative tasting menus, london bridge, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Umu",
      "coord": [
        51.511358,
        -0.144384
      ],
      "desc": "Michelin-starred, refined Japanese kaiseki, Mayfair",
      "longDesc": "Umu serves exceptional cuisine celebrating michelin-starred, refined japanese kaiseki, mayfair, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Sushi Kanesaka",
      "coord": [
        51.508681,
        -0.197751
      ],
      "desc": "Michelin-starred, ultra-high-end omakase, Mayfair",
      "longDesc": "Sushi Kanesaka serves exceptional cuisine celebrating michelin-starred, ultra-high-end omakase, mayfair, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Hideaway Coffee House",
      "coord": [
        51.5082,
        -0.1258
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Hideaway Coffee House serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Bocca di Lupo",
      "coord": [
        51.509,
        -0.1298
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Bocca di Lupo serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "OMA",
      "coord": [
        51.5098,
        -0.1288
      ],
      "desc": "Google Maps saved place",
      "longDesc": "OMA serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Fallow",
      "coord": [
        51.505,
        -0.1278
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Fallow serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "BAO Soho",
      "coord": [
        51.5058,
        -0.1268
      ],
      "desc": "Google Maps saved place",
      "longDesc": "BAO Soho serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Brasserie Zedel",
      "coord": [
        51.5066,
        -0.1258
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Brasserie Zedel serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Noble Rot Soho",
      "coord": [
        51.5074,
        -0.1298
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Noble Rot Soho serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Barrafina Dean Street",
      "coord": [
        51.5082,
        -0.1288
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Barrafina Dean Street serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Quo Vadis",
      "coord": [
        51.509,
        -0.1278
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Quo Vadis serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Devonshire Arms",
      "coord": [
        51.5098,
        -0.1268
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Devonshire Arms serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Koya Japanese Restaurant Soho",
      "coord": [
        51.505,
        -0.1258
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Koya Japanese Restaurant Soho serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Hoppers",
      "coord": [
        51.5058,
        -0.1298
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Hoppers serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Ole & Steen",
      "coord": [
        51.5066,
        -0.1288
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Ole & Steen serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "St. JOHN Bread and Wine",
      "coord": [
        51.5074,
        -0.1278
      ],
      "desc": "Google Maps saved place",
      "longDesc": "St. JOHN Bread and Wine serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Golden Union",
      "coord": [
        51.5082,
        -0.1268
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Golden Union serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Padella",
      "coord": [
        51.509,
        -0.1258
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Padella serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "The Lamb & Flag, Covent Garden",
      "coord": [
        51.5098,
        -0.1298
      ],
      "desc": "Google Maps saved place",
      "longDesc": "The Lamb & Flag, Covent Garden serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Aperture UK",
      "coord": [
        51.5058,
        -0.1278
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Aperture UK serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    },
    {
      "name": "Din Tai Fung Covent Garden",
      "coord": [
        51.5066,
        -0.1268
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Din Tai Fung Covent Garden serves exceptional cuisine celebrating google maps saved place, with thoughtful service and an inviting atmosphere for families to enjoy memorable meals together."
    }
  ],
  "experiences": [
    {
      "name": "British Museum",
      "coord": [
        51.946281,
        -0.275796
      ],
      "desc": "World-class collections, free entry, Bloomsbury",
      "longDesc": "A world-spanning collection from Egyptian mummies to the Rosetta Stone, offering endless discovery moments and family audio guides for meaningful exploration."
    },
    {
      "name": "National Gallery",
      "coord": [
        56.781429,
        -2.53678
      ],
      "desc": "Masterpieces, free entry, Trafalgar Square",
      "longDesc": "A world-class art collection from medieval through impressionist periods, with family trails, interactive activities, and free admission to spark artistic curiosity."
    },
    {
      "name": "Tate Modern",
      "coord": [
        51.507429,
        -0.099342
      ],
      "desc": "Modern art with city views, great South Bank pairing",
      "longDesc": "A converted power station bursting with contemporary art, free admission, theatrical installations, and family programs sparking creative thinking."
    },
    {
      "name": "V&A Museum",
      "coord": [
        51.541851,
        -0.013572
      ],
      "desc": "Decorative arts, great café courtyard, free, South Kensington",
      "longDesc": "A vast design museum celebrating decorative arts, fashion, and architecture, with interactive galleries and objects that surprise visitors of all ages."
    },
    {
      "name": "Natural History Museum",
      "coord": [
        51.490903,
        -0.611224
      ],
      "desc": "Dinosaurs + blue whale, classic with kids, free",
      "longDesc": "A stunning Victorian palace filled with dinosaurs, animals, and geological wonders—the blue whale and T-Rex skeletons never fail to mesmerize children."
    },
    {
      "name": "Tower of London",
      "coord": [
        51.508217,
        -0.076188
      ],
      "desc": "Crown Jewels, Yeoman Warder tours, book ahead",
      "longDesc": "A dramatic fortress with 1,000 years of history, Crown Jewels that dazzle, and Yeoman Warder stories that bring royal drama vividly alive."
    },
    {
      "name": "Tower Bridge Walkway",
      "coord": [
        51.505517,
        -0.075252
      ],
      "desc": "Iconic bridge, glass floor views, easy with kids",
      "longDesc": "Tower Bridge Walkway provides iconic bridge, glass floor views, easy with kids, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "St Paul's Cathedral",
      "coord": [
        56.461023,
        -2.968099
      ],
      "desc": "Dome climb for views, iconic architecture, City",
      "longDesc": "St Paul's Cathedral provides dome climb for views, iconic architecture, city, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Westminster Abbey",
      "coord": [
        51.499399,
        -0.127391
      ],
      "desc": "Royal coronation site, timed entry, Westminster",
      "longDesc": "An awe-inspiring Gothic cathedral where coronations and royal weddings occur, offering soaring arches, stained glass, and palpable history."
    },
    {
      "name": "Buckingham Palace",
      "coord": [
        51.501738,
        -0.140674
      ],
      "desc": "State Rooms (seasonal), classic London moment",
      "longDesc": "The iconic royal residence with State Rooms open seasonally, offering glimpses of royal interiors, gilded furnishings, and pageantry."
    },
    {
      "name": "Changing of the Guard",
      "coord": [
        51.502192,
        -0.139254
      ],
      "desc": "Free spectacle, arrive early for best views",
      "longDesc": "Changing of the Guard provides free spectacle, arrive early for best views, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "London Eye",
      "coord": [
        51.503342,
        -0.119676
      ],
      "desc": "Easy skyline views, great first-day orientation",
      "longDesc": "London Eye provides easy skyline views, great first-day orientation, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "The View from The Shard",
      "coord": [
        51.50451,
        -0.086437
      ],
      "desc": "Highest viewpoint in London, best at sunset",
      "longDesc": "The View from The Shard provides highest viewpoint in london, best at sunset, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Sky Garden",
      "coord": [
        54.656078,
        -5.91925
      ],
      "desc": "Free indoor gardens + panoramic views, City",
      "longDesc": "Sky Garden provides free indoor gardens + panoramic views, city, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Churchill War Rooms",
      "coord": [
        52.290329,
        -1.539435
      ],
      "desc": "Underground wartime HQ, book timed tickets",
      "longDesc": "Churchill War Rooms provides underground wartime hq, book timed tickets, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Greenwich Royal Observatory",
      "coord": [
        51.477362,
        -0.000846
      ],
      "desc": "Prime Meridian, great day out with river boat",
      "longDesc": "Greenwich Royal Observatory provides prime meridian, great day out with river boat, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Cutty Sark",
      "coord": [
        51.482165,
        -0.010165
      ],
      "desc": "Climb aboard iconic ship, pairs with Greenwich Market",
      "longDesc": "A preserved Victorian tea clipper ship offering glimpses into maritime trade, sailors' life, and 19th-century ocean voyaging."
    },
    {
      "name": "Hampton Court Palace",
      "coord": [
        51.403684,
        -0.337696
      ],
      "desc": "Tudor history, gardens, maze great for kids",
      "longDesc": "Henry VIII's riverside palace with maze gardens, grand interiors, boating, and the dramatic history of Tudor power."
    },
    {
      "name": "Kensington Palace",
      "coord": [
        51.505099,
        -0.187633
      ],
      "desc": "Royal residence + gardens, good stroller walks",
      "longDesc": "A royal residence with beautiful gardens, apartments showing royal family history, and a setting that sparks imagination in every child."
    },
    {
      "name": "Hyde Park & Kensington Gardens",
      "coord": [
        51.509812,
        -0.190486
      ],
      "desc": "Playgrounds, seasonal boating, easy stroller time",
      "longDesc": "Hyde Park & Kensington Gardens provides playgrounds, seasonal boating, easy stroller time, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Regent's Park",
      "coord": [
        51.530107,
        -0.153769
      ],
      "desc": "Beautiful gardens, nearby zoo, great picnic spot",
      "longDesc": "A royal park featuring open-air theatre, Queen Mary's Gardens, boating lake, and beautiful landscaping perfect for family strolls."
    },
    {
      "name": "Primrose Hill",
      "coord": [
        53.636238,
        -1.784631
      ],
      "desc": "Best easy hilltop view, great at golden hour",
      "longDesc": "A small park north of Regent's Park offering panoramic London views from the summit—a family hike with big rewards."
    },
    {
      "name": "Hampstead Heath",
      "coord": [
        51.566201,
        -0.168077
      ],
      "desc": "Wild-feeling open space, ponds, viewpoints",
      "longDesc": "A wild, rolling 790-acre space offering woodland trails, swimming ponds, kite flying, and suburban escape from city life."
    },
    {
      "name": "Richmond Park",
      "coord": [
        53.43045,
        -1.399295
      ],
      "desc": "Deer herds, huge green space, great half-day",
      "longDesc": "A vast royal park with red and fallow deer roaming freely, beautiful woodland trails, and views across the Thames valley."
    },
    {
      "name": "Kew Gardens",
      "coord": [
        54.876744,
        -6.27502
      ],
      "desc": "World-class botanic gardens, playgrounds, cafés",
      "longDesc": "A world-class botanical garden with 300 acres, exotic glasshouses, tree canopy walks, and the wonder of plant diversity."
    },
    {
      "name": "Notting Hill & Portobello Road",
      "coord": [
        51.516336,
        -0.20532
      ],
      "desc": "Colorful streets, market day browsing, photogenic",
      "longDesc": "Notting Hill & Portobello Road provides colorful streets, market day browsing, photogenic, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Covent Garden Piazza",
      "coord": [
        51.512008,
        -0.121807
      ],
      "desc": "Street performers, easy dining, central for theatre",
      "longDesc": "Covent Garden Piazza provides street performers, easy dining, central for theatre, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Borough Market Food Crawl",
      "coord": [
        51.5054,
        -0.0912
      ],
      "desc": "Iconic gourmet market, grab-and-go lunches",
      "longDesc": "Borough Market Food Crawl provides iconic gourmet market, grab-and-go lunches, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "South Bank Riverside Walk",
      "coord": [
        53.569719,
        -2.295852
      ],
      "desc": "Stroller-friendly promenade, Tate/Globe/London Eye",
      "longDesc": "South Bank Riverside Walk provides stroller-friendly promenade, tate/globe/london eye, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Thames Clippers Boat Ride",
      "coord": [
        51.5,
        -0.115
      ],
      "desc": "Most scenic public transport, ride past major sights",
      "longDesc": "Thames Clippers Boat Ride provides most scenic public transport, ride past major sights, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Shoreditch Street Art",
      "coord": [
        51.526314,
        -0.083295
      ],
      "desc": "Street art, cafés, great photo walk",
      "longDesc": "Shoreditch Street Art provides street art, cafés, great photo walk, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Shakespeare's Globe",
      "coord": [
        51.508121,
        -0.097186
      ],
      "desc": "Tour + performances, fun history for older kids",
      "longDesc": "A faithful reconstruction of Shakespeare's original theatre, offering performances in authentic wooden galleries and the magic of Elizabethan drama."
    },
    {
      "name": "West End Show",
      "coord": [
        52.975642,
        -0.025442
      ],
      "desc": "Book ahead; matinees work well for kids",
      "longDesc": "West End Show provides book ahead; matinees work well for kids, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Royal Opera House",
      "coord": [
        51.512873,
        -0.122564
      ],
      "desc": "World-class performances, backstage tours, Covent Garden",
      "longDesc": "Royal Opera House provides world-class performances, backstage tours, covent garden, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Royal Albert Hall",
      "coord": [
        51.54208,
        -0.61584
      ],
      "desc": "Iconic venue, check family concerts, Kensington",
      "longDesc": "Royal Albert Hall provides iconic venue, check family concerts, kensington, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Afternoon Tea at The Ritz",
      "coord": [
        51.520238,
        -0.125516
      ],
      "desc": "Classic London ritual, reserve far ahead",
      "longDesc": "Afternoon Tea at The Ritz provides classic london ritual, reserve far ahead, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Afternoon Tea at Claridge's",
      "coord": [
        51.512524,
        -0.147518
      ],
      "desc": "Iconic tea in glamorous setting, celebration option",
      "longDesc": "Afternoon Tea at Claridge's provides iconic tea in glamorous setting, celebration option, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Afternoon Tea at The Savoy",
      "coord": [
        51.520238,
        -0.125516
      ],
      "desc": "Grand setting, pairs well with theatre",
      "longDesc": "Afternoon Tea at The Savoy provides grand setting, pairs well with theatre, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Somerset House",
      "coord": [
        50.964704,
        -0.082772
      ],
      "desc": "Courtyard exhibitions, seasonal events, Strand",
      "longDesc": "Somerset House provides courtyard exhibitions, seasonal events, strand, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Barbican Centre",
      "coord": [
        51.519776,
        -0.093756
      ],
      "desc": "Brutalist architecture, art/cinema, great rainy-day option",
      "longDesc": "Barbican Centre provides brutalist architecture, art/cinema, great rainy-day option, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Little Venice Canal Walk",
      "coord": [
        51.5204,
        -0.1762
      ],
      "desc": "Pretty canal area, boat rides to Camden/Regent's Park",
      "longDesc": "Little Venice Canal Walk provides pretty canal area, boat rides to camden/regent's park, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Coal Drops Yard (King's Cross)",
      "coord": [
        51.53554,
        -0.126484
      ],
      "desc": "Modern retail + food in restored industrial setting",
      "longDesc": "Coal Drops Yard (King's Cross) provides modern retail + food in restored industrial setting, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Windsor Castle",
      "coord": [
        51.483347,
        -0.607852
      ],
      "desc": "Easy day trip, royal history + castle grounds",
      "longDesc": "The world's largest occupied castle, featuring State Rooms, St. George's Chapel, and centuries of royal drama set dramatically above the Thames."
    },
    {
      "name": "Bath: Roman Baths",
      "coord": [
        51.378485,
        -2.36767
      ],
      "desc": "Roman Baths + Georgian city, great culture day trip",
      "longDesc": "Bath: Roman Baths provides roman baths + georgian city, great culture day trip, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Oxford Colleges & Museums",
      "coord": [
        51.738119,
        -1.444783
      ],
      "desc": "University city, great walking day trip",
      "longDesc": "Oxford Colleges & Museums provides university city, great walking day trip, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Cambridge Punting",
      "coord": [
        52.194109,
        0.137715
      ],
      "desc": "Punting + colleges, best in warmer months",
      "longDesc": "Cambridge Punting provides punting + colleges, best in warmer months, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Brighton Seafront & The Lanes",
      "coord": [
        51.669258,
        -4.703193
      ],
      "desc": "Seaside energy + shopping, great summer day trip",
      "longDesc": "Brighton Seafront & The Lanes provides seaside energy + shopping, great summer day trip, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Stonehenge",
      "coord": [
        51.177499,
        -1.827421
      ],
      "desc": "Prehistoric monument, pair with Salisbury",
      "longDesc": "An ancient stone circle mystifying archaeologists for 5,000 years, offering a sense of prehistoric wonder and connection to distant human history."
    },
    {
      "name": "Cotswolds Villages",
      "coord": [
        51.656918,
        -1.937947
      ],
      "desc": "Storybook villages (Bibury, Stow), best with a car",
      "longDesc": "Cotswolds Villages provides storybook villages (bibury, stow), best with a car, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Edinburgh Castle & Royal Mile",
      "coord": [
        55.948687,
        -3.200417
      ],
      "desc": "Classic Scotland city break anchor",
      "longDesc": "Edinburgh Castle & Royal Mile provides classic scotland city break anchor, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    },
    {
      "name": "Canterbury Cathedral",
      "coord": [
        51.279272,
        1.081104
      ],
      "desc": "Medieval city, cathedral + old streets",
      "longDesc": "A UNESCO site of pilgrimage where Chaucer's characters journeyed, featuring beautiful Gothic architecture and centuries of religious history."
    },
    {
      "name": "John Lewis & Partners",
      "coord": [
        51.505,
        -0.1288
      ],
      "desc": "Google Maps saved place",
      "longDesc": "John Lewis & Partners provides google maps saved place, offering visitors of all ages wonderful opportunities to explore and learn while creating lasting family memories."
    }
  ],
  "kidFriendly": [
    {
      "name": "Natural History Museum",
      "coord": [
        51.490903,
        -0.611224
      ],
      "desc": "Dinosaurs, blue whale, free entry, South Kensington",
      "longDesc": "A stunning Victorian palace filled with dinosaurs, animals, and geological wonders—the blue whale and T-Rex skeletons never fail to mesmerize children."
    },
    {
      "name": "Science Museum",
      "coord": [
        52.482647,
        -1.88623
      ],
      "desc": "Hands-on galleries, great rainy-day option",
      "longDesc": "Six floors celebrating human ingenuity—steam engines, rockets, medical technology—with hands-on experiments and interactive galleries for curious minds."
    },
    {
      "name": "Science Museum Wonderlab",
      "coord": [
        51.497398,
        -0.174673
      ],
      "desc": "Ticketed hands-on science exhibits, ages 3+",
      "longDesc": "Science Museum Wonderlab features ticketed hands-on science exhibits, ages 3+, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "London Transport Museum",
      "coord": [
        51.511769,
        -0.121468
      ],
      "desc": "All Aboard play zone for under-7s, Covent Garden",
      "longDesc": "A colorful celebration of iconic double-deckers, buses, and the Underground, with hands-on simulators and design history."
    },
    {
      "name": "Young V&A",
      "coord": [
        51.529046,
        -0.054873
      ],
      "desc": "Purpose-built kid museum, play + design, Bethnal Green",
      "longDesc": "Young V&A features purpose-built kid museum, play + design, bethnal green, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Horniman Museum & Gardens",
      "coord": [
        51.44218,
        -0.061324
      ],
      "desc": "Free museum + gardens, butterfly house, Forest Hill",
      "longDesc": "Horniman Museum & Gardens features free museum + gardens, butterfly house, forest hill, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Diana Memorial Playground",
      "coord": [
        51.509217,
        -0.188137
      ],
      "desc": "Outstanding pirate-ship playground, ages 1-8",
      "longDesc": "Diana Memorial Playground features outstanding pirate-ship playground, ages 1-8, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Coram's Fields",
      "coord": [
        53.869085,
        -2.354669
      ],
      "desc": "Huge play spaces, adults only with children, Bloomsbury",
      "longDesc": "A 7-acre children's playground and farm in central London where kids climb, swing, and meet animals in a safe, traffic-free space."
    },
    {
      "name": "ZSL London Zoo",
      "coord": [
        51.537424,
        -0.153964
      ],
      "desc": "Classic big zoo day, book ahead on weekends",
      "longDesc": "ZSL London Zoo features classic big zoo day, book ahead on weekends, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "SEA LIFE London Aquarium",
      "coord": [
        51.501626,
        -0.119466
      ],
      "desc": "Toddler-friendly, great with South Bank day",
      "longDesc": "SEA LIFE London Aquarium features toddler-friendly, great with south bank day, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Kew Gardens (Kids)",
      "coord": [
        51.477134,
        -0.284962
      ],
      "desc": "Wide paths for strollers, greenhouses, playgrounds",
      "longDesc": "Kew Gardens (Kids) features wide paths for strollers, greenhouses, playgrounds, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Hyde Park Playgrounds",
      "coord": [
        51.507489,
        -0.162207
      ],
      "desc": "Stroller-friendly loops, playgrounds, pedal boats",
      "longDesc": "Hyde Park Playgrounds features stroller-friendly loops, playgrounds, pedal boats, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Paddington Bear Experience",
      "coord": [
        53.399475,
        -2.554077
      ],
      "desc": "Highly interactive story-world, timed tickets, ages 2+",
      "longDesc": "Paddington Bear Experience features highly interactive story-world, timed tickets, ages 2+, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Frameless (Immersive Art)",
      "coord": [
        51.5128,
        -0.1595
      ],
      "desc": "Large-scale projections, kids can move freely",
      "longDesc": "Frameless (Immersive Art) features large-scale projections, kids can move freely, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Hamleys",
      "coord": [
        51.531292,
        -0.126553
      ],
      "desc": "Iconic toy store, best early/weekday, Regent Street",
      "longDesc": "Hamleys features iconic toy store, best early/weekday, regent street, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Warner Bros. Studio Tour (Harry Potter)",
      "coord": [
        51.688863,
        -0.417656
      ],
      "desc": "Book far ahead, great for older kids/teens, Watford",
      "longDesc": "Warner Bros. Studio Tour (Harry Potter) features book far ahead, great for older kids/teens, watford, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Battersea Park Children's Zoo",
      "coord": [
        51.481185,
        -0.156566
      ],
      "desc": "Small zoo + playground, easy half-day",
      "longDesc": "Battersea Park Children's Zoo features small zoo + playground, easy half-day, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Greenwich Day Out",
      "coord": [
        51.477235,
        0.000923
      ],
      "desc": "Park, market, maritime museums, easy family day",
      "longDesc": "Greenwich Day Out features park, market, maritime museums, easy family day, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Thames Clippers Boat Ride (Kids)",
      "coord": [
        51.5,
        -0.115
      ],
      "desc": "Low-effort sightseeing, fun with toddlers + snacks",
      "longDesc": "Thames Clippers Boat Ride (Kids) features low-effort sightseeing, fun with toddlers + snacks, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "West End Matinee",
      "coord": [
        51.576848,
        -2.816745
      ],
      "desc": "Choose a matinee, aisle seats help with kids",
      "longDesc": "West End Matinee features choose a matinee, aisle seats help with kids, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Cutty Sark (Kids)",
      "coord": [
        51.482933,
        -0.009615
      ],
      "desc": "Climb aboard the ship, great imagination fuel, ages 3+",
      "longDesc": "Cutty Sark (Kids) features climb aboard the ship, great imagination fuel, ages 3+, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Hampstead Heath",
      "coord": [
        51.566201,
        -0.168077
      ],
      "desc": "Great for running around, views and ponds",
      "longDesc": "A wild, rolling 790-acre space offering woodland trails, swimming ponds, kite flying, and suburban escape from city life."
    },
    {
      "name": "Design Museum Mudlarks",
      "coord": [
        51.499806,
        -0.199805
      ],
      "desc": "Soft-play style activity centre, ages 0-8, Kensington",
      "longDesc": "Design Museum Mudlarks features soft-play style activity centre, ages 0-8, kensington, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Victoria Embankment Gardens",
      "coord": [
        51.5074,
        -0.1258
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Victoria Embankment Gardens features google maps saved place, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "The LEGO® Store Leicester Square",
      "coord": [
        51.5082,
        -0.1298
      ],
      "desc": "Google Maps saved place",
      "longDesc": "The LEGO® Store Leicester Square features google maps saved place, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    },
    {
      "name": "Hanover Gate Children's Playground",
      "coord": [
        51.509,
        -0.1288
      ],
      "desc": "Google Maps saved place",
      "longDesc": "Hanover Gate Children's Playground features google maps saved place, making it an excellent destination for families with children seeking fun, learning, and adventure together."
    }
  ],
  "markets": [
    {
      "name": "Borough Market",
      "coord": [
        51.501144,
        -0.093293
      ],
      "desc": "Iconic gourmet market, excellent grab-and-go lunches",
      "longDesc": "London's legendary food market with vendors selling fresh produce, artisan foods, ready-to-eat samples, and the energy of a working foodie gathering."
    },
    {
      "name": "Maltby Street Market",
      "coord": [
        51.499258,
        -0.075624
      ],
      "desc": "Small high-quality weekend street food + bakeries",
      "longDesc": "Maltby Street Market offers small high-quality weekend street food + bakeries, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Portobello Road Market",
      "coord": [
        55.955067,
        -3.148299
      ],
      "desc": "Antiques + food, great neighborhood stroll, Notting Hill",
      "longDesc": "London's most famous antique market stretching for miles on Saturdays, with vintage treasures, collectibles, and street-food energy."
    },
    {
      "name": "Columbia Road Flower Market",
      "coord": [
        51.529116,
        -0.069731
      ],
      "desc": "Sunday flowers + coffee + small shops, Bethnal Green",
      "longDesc": "A Sunday institution in East London selling exuberant cut flowers, potted plants, antiques, and second-hand finds amid village-like atmosphere."
    },
    {
      "name": "Broadway Market",
      "coord": [
        52.951817,
        -1.143436
      ],
      "desc": "Saturday food stalls + indie shops, Hackney",
      "longDesc": "A gentrified East London street market combining antiques, fashion, food, and the energy of a tight-knit creative neighborhood."
    },
    {
      "name": "Spitalfields Market",
      "coord": [
        51.5196,
        -0.075363
      ],
      "desc": "Covered market for crafts + food, good in bad weather",
      "longDesc": "Spitalfields Market offers covered market for crafts + food, good in bad weather, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Camden Market",
      "coord": [
        52.952728,
        -1.132762
      ],
      "desc": "Huge food options, fun vibe for older kids/teens",
      "longDesc": "London's iconic alternative market with punk fashion, vintage clothing, global street food, and the youthful bohemian energy of North London."
    },
    {
      "name": "Leadenhall Market",
      "coord": [
        51.512818,
        -0.083484
      ],
      "desc": "Beautiful Victorian arcade, photogenic, City",
      "longDesc": "A Victorian covered market in the City selling upmarket delicatessens, wine, and luxury foods in beautiful ironwork setting."
    },
    {
      "name": "Fortnum & Mason Food Hall",
      "coord": [
        51.508186,
        -0.138141
      ],
      "desc": "Luxury hampers, teas, sweets, Piccadilly",
      "longDesc": "Fortnum & Mason Food Hall offers luxury hampers, teas, sweets, piccadilly, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Harrods Food Halls",
      "coord": [
        51.49921,
        -0.162989
      ],
      "desc": "Over-the-top food halls, easy lunch, Knightsbridge",
      "longDesc": "Harrods Food Halls offers over-the-top food halls, easy lunch, knightsbridge, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Greenwich Market",
      "coord": [
        52.593805,
        0.378158
      ],
      "desc": "Food + crafts, easy with Greenwich sights",
      "longDesc": "A historic covered market featuring antiques, crafts, vintage finds, and food stalls in a charming waterfront neighborhood."
    },
    {
      "name": "Brick Lane Sunday UpMarket",
      "coord": [
        50.796927,
        -1.716687
      ],
      "desc": "Global street food + vintage browsing, Sundays",
      "longDesc": "Brick Lane Sunday UpMarket offers global street food + vintage browsing, sundays, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Mercato Mayfair",
      "coord": [
        51.513079,
        -0.153247
      ],
      "desc": "Food stalls in converted church setting",
      "longDesc": "Mercato Mayfair offers food stalls in converted church setting, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Marylebone Farmers' Market",
      "coord": [
        51.519307,
        -0.153001
      ],
      "desc": "Top produce & pastries, Sundays, great for park picnic",
      "longDesc": "Marylebone Farmers' Market offers top produce & pastries, sundays, great for park picnic, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    },
    {
      "name": "Selfridges Foodhall",
      "coord": [
        51.514596,
        -0.152829
      ],
      "desc": "Strong prepared foods and treats, Oxford Street",
      "longDesc": "Selfridges Foodhall offers strong prepared foods and treats, oxford street, where visitors can explore local goods, experience community energy, and discover authentic cultural treasures."
    }
  ],
  "cityCenters": {
    "Central London": [
      51.509,
      -0.135,
      0.08
    ],
    "Westminster": [
      51.5,
      -0.13,
      0.06
    ],
    "Mayfair": [
      51.51,
      -0.148,
      0.04
    ],
    "Soho": [
      51.514,
      -0.132,
      0.03
    ],
    "Covent Garden": [
      51.512,
      -0.123,
      0.03
    ],
    "Knightsbridge": [
      51.5,
      -0.163,
      0.04
    ],
    "South Kensington": [
      51.496,
      -0.178,
      0.04
    ],
    "Chelsea": [
      51.49,
      -0.163,
      0.04
    ],
    "Shoreditch": [
      51.525,
      -0.076,
      0.04
    ],
    "South Bank": [
      51.504,
      -0.115,
      0.04
    ],
    "Greenwich": [
      51.479,
      -0.005,
      0.05
    ],
    "Marylebone": [
      51.52,
      -0.15,
      0.04
    ],
    "Fitzrovia": [
      51.518,
      -0.135,
      0.03
    ],
    "Notting Hill": [
      51.512,
      -0.205,
      0.04
    ],
    "City of London": [
      51.515,
      -0.09,
      0.04
    ],
    "Belgravia": [
      51.498,
      -0.15,
      0.03
    ],
    "Camden": [
      51.54,
      -0.145,
      0.04
    ],
    "Hampstead": [
      51.56,
      -0.163,
      0.05
    ],
    "Richmond": [
      51.445,
      -0.275,
      0.06
    ],
    "Edinburgh": [
      55.95,
      -3.195,
      0.12
    ],
    "Bath": [
      51.381,
      -2.36,
      0.08
    ],
    "Oxford": [
      51.755,
      -1.254,
      0.08
    ],
    "Cambridge": [
      52.205,
      0.12,
      0.08
    ],
    "Cotswolds": [
      51.815,
      -1.67,
      0.2
    ],
    "Windsor": [
      51.483,
      -0.604,
      0.06
    ],
    "Brighton": [
      50.828,
      -0.14,
      0.08
    ],
    "Bray": [
      51.489,
      -0.638,
      0.04
    ]
  },
  "itineraryData": {
    "a": {
      "name": "London Greatest Hits",
      "color": "#2563EB",
      "days": [
        {
          "day": 1,
          "title": "Arrival & South Kensington",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Natural History Museum",
              "coord": [
                51.4967,
                -0.1765
              ]
            },
            {
              "type": "lunch",
              "name": "V&A Café (inside museum)",
              "coord": [
                51.4967,
                -0.1764
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hyde Park & Kensington Gardens",
              "coord": [
                51.5086,
                -0.1634
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner by Heston Blumenthal",
              "coord": [
                51.5023,
                -0.1605
              ]
            },
            {
              "type": "optional",
              "name": "Evening walk through Knightsbridge",
              "coord": [
                51.5,
                -0.163
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Westminster & Royal London",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Changing of the Guard",
              "coord": [
                51.5015,
                -0.1406
              ]
            },
            {
              "type": "sightseeing",
              "name": "Westminster Abbey",
              "coord": [
                51.4994,
                -0.1275
              ]
            },
            {
              "type": "lunch",
              "name": "The Wolseley",
              "coord": [
                51.507,
                -0.1384
              ]
            },
            {
              "type": "sightseeing",
              "name": "Churchill War Rooms",
              "coord": [
                51.5021,
                -0.1295
              ]
            },
            {
              "type": "sightseeing",
              "name": "St James's Park",
              "coord": [
                51.5025,
                -0.137
              ]
            },
            {
              "type": "dinner",
              "name": "The Ritz Restaurant",
              "coord": [
                51.5071,
                -0.1384
              ]
            },
            {
              "type": "optional",
              "name": "Connaught Bar cocktails",
              "coord": [
                51.5087,
                -0.1475
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "South Bank & Borough Market",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "London Eye",
              "coord": [
                51.5034,
                -0.1195
              ]
            },
            {
              "type": "sightseeing",
              "name": "South Bank Riverside Walk",
              "coord": [
                51.4944,
                -0.1231
              ]
            },
            {
              "type": "lunch",
              "name": "Borough Market Food Crawl",
              "coord": [
                51.5054,
                -0.0912
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tate Modern",
              "coord": [
                51.5076,
                -0.0995
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shakespeare's Globe",
              "coord": [
                51.5081,
                -0.0973
              ]
            },
            {
              "type": "dinner",
              "name": "Restaurant Story",
              "coord": [
                51.5053,
                -0.0863
              ]
            },
            {
              "type": "optional",
              "name": "The View from The Shard at sunset",
              "coord": [
                51.5045,
                -0.0865
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Tower & East London",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tower of London",
              "coord": [
                51.5085,
                -0.0761
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tower Bridge Walkway",
              "coord": [
                51.5055,
                -0.0753
              ]
            },
            {
              "type": "lunch",
              "name": "St. JOHN",
              "coord": [
                51.5206,
                -0.1088
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shoreditch Street Art",
              "coord": [
                51.5235,
                -0.0745
              ]
            },
            {
              "type": "sightseeing",
              "name": "Spitalfields Market",
              "coord": [
                51.5197,
                -0.0763
              ]
            },
            {
              "type": "dinner",
              "name": "Brat",
              "coord": [
                51.5271,
                -0.0749
              ]
            },
            {
              "type": "optional",
              "name": "Nightjar cocktails",
              "coord": [
                51.5282,
                -0.0754
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Covent Garden, British Museum & West End",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "British Museum",
              "coord": [
                51.5188,
                -0.1262
              ]
            },
            {
              "type": "lunch",
              "name": "Frog by Adam Handling",
              "coord": [
                51.5157,
                -0.1234
              ]
            },
            {
              "type": "sightseeing",
              "name": "Covent Garden Piazza",
              "coord": [
                51.5124,
                -0.1251
              ]
            },
            {
              "type": "sightseeing",
              "name": "London Transport Museum",
              "coord": [
                51.5124,
                -0.1251
              ]
            },
            {
              "type": "dinner",
              "name": "Rules",
              "coord": [
                51.5137,
                -0.1233
              ]
            },
            {
              "type": "sightseeing",
              "name": "West End Show",
              "coord": [
                51.5134,
                -0.1293
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Mayfair & Afternoon Tea",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Mayfair & Bond Street",
              "coord": [
                51.513,
                -0.1462
              ]
            },
            {
              "type": "sightseeing",
              "name": "Fortnum & Mason",
              "coord": [
                51.5084,
                -0.1385
              ]
            },
            {
              "type": "lunch",
              "name": "Gymkhana",
              "coord": [
                51.5075,
                -0.15
              ]
            },
            {
              "type": "sightseeing",
              "name": "Afternoon Tea at Claridge's",
              "coord": [
                51.5102,
                -0.15
              ]
            },
            {
              "type": "dinner",
              "name": "Sketch (Lecture Room & Library)",
              "coord": [
                51.5125,
                -0.1416
              ]
            },
            {
              "type": "optional",
              "name": "Dukes Bar martini",
              "coord": [
                51.5047,
                -0.1291
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Greenwich Day",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Thames Clippers Boat Ride",
              "coord": [
                51.5,
                -0.115
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cutty Sark",
              "coord": [
                51.4829,
                -0.0097
              ]
            },
            {
              "type": "lunch",
              "name": "Greenwich Market",
              "coord": [
                51.4768,
                -0.0005
              ]
            },
            {
              "type": "sightseeing",
              "name": "Greenwich Royal Observatory",
              "coord": [
                51.4768,
                -0.0005
              ]
            },
            {
              "type": "sightseeing",
              "name": "Greenwich Park",
              "coord": [
                51.4767,
                0.0001
              ]
            },
            {
              "type": "dinner",
              "name": "The Palomar",
              "coord": [
                51.515,
                -0.1309
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Day Trip: Windsor & Bray",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Windsor Castle",
              "coord": [
                51.4833,
                -0.6042
              ]
            },
            {
              "type": "lunch",
              "name": "Windsor town lunch",
              "coord": [
                51.4833,
                -0.6042
              ]
            },
            {
              "type": "optional",
              "name": "Long Walk in Windsor Great Park",
              "coord": [
                51.4773,
                -0.6169
              ]
            },
            {
              "type": "dinner",
              "name": "The Fat Duck",
              "coord": [
                51.4888,
                -0.6385
              ]
            },
            {
              "type": "optional",
              "name": "The Waterside Inn (alternative)",
              "coord": [
                51.4878,
                -0.6395
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Day Trip: Bath & Roman Baths",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bath: Roman Baths",
              "coord": [
                51.3811,
                -2.3597
              ]
            },
            {
              "type": "lunch",
              "name": "Bath city center lunch",
              "coord": [
                51.3816,
                -2.359
              ]
            },
            {
              "type": "sightseeing",
              "name": "Royal Crescent & Circus walk",
              "coord": [
                51.386,
                -2.366
              ]
            },
            {
              "type": "optional",
              "name": "Thermae Bath Spa",
              "coord": [
                51.3802,
                -2.3603
              ]
            },
            {
              "type": "dinner",
              "name": "Elystan Street",
              "coord": [
                51.4909,
                -0.1646
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Notting Hill & Kensington",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Notting Hill & Portobello Road",
              "coord": [
                51.5142,
                -0.2105
              ]
            },
            {
              "type": "lunch",
              "name": "The Ledbury",
              "coord": [
                51.5081,
                -0.2013
              ]
            },
            {
              "type": "sightseeing",
              "name": "Kensington Palace",
              "coord": [
                51.505,
                -0.1878
              ]
            },
            {
              "type": "sightseeing",
              "name": "Diana Memorial Playground",
              "coord": [
                51.5092,
                -0.1883
              ]
            },
            {
              "type": "dinner",
              "name": "CORE by Clare Smyth",
              "coord": [
                51.5095,
                -0.2007
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "King's Cross, Camden & Regent's Park",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Coal Drops Yard",
              "coord": [
                51.5319,
                -0.1218
              ]
            },
            {
              "type": "sightseeing",
              "name": "Regent's Park",
              "coord": [
                51.5311,
                -0.1599
              ]
            },
            {
              "type": "lunch",
              "name": "Camden Market",
              "coord": [
                51.5414,
                -0.1466
              ]
            },
            {
              "type": "sightseeing",
              "name": "ZSL London Zoo",
              "coord": [
                51.536,
                -0.1536
              ]
            },
            {
              "type": "sightseeing",
              "name": "Primrose Hill",
              "coord": [
                51.5399,
                -0.1614
              ]
            },
            {
              "type": "dinner",
              "name": "Kol",
              "coord": [
                51.5244,
                -0.1451
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Farewell & Last Treats",
          "items": [
            {
              "type": "hotel",
              "name": "The Berkeley",
              "coord": [
                51.502,
                -0.1561
              ]
            },
            {
              "type": "sightseeing",
              "name": "Harrods",
              "coord": [
                51.4994,
                -0.1633
              ]
            },
            {
              "type": "lunch",
              "name": "Afternoon Tea at The Savoy",
              "coord": [
                51.51,
                -0.1193
              ]
            },
            {
              "type": "sightseeing",
              "name": "Somerset House",
              "coord": [
                51.5066,
                -0.117
              ]
            },
            {
              "type": "optional",
              "name": "Last shopping at Liberty",
              "coord": [
                51.513,
                -0.1367
              ]
            },
            {
              "type": "dinner",
              "name": "Alain Ducasse at The Dorchester",
              "coord": [
                51.5074,
                -0.1502
              ]
            }
          ]
        }
      ]
    },
    "b": {
      "name": "Hidden Gems & Countryside",
      "color": "#059669",
      "days": [
        {
          "day": 1,
          "title": "Arrival & Covent Garden",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Covent Garden Piazza",
              "coord": [
                51.5124,
                -0.1251
              ]
            },
            {
              "type": "lunch",
              "name": "Frog by Adam Handling",
              "coord": [
                51.5157,
                -0.1234
              ]
            },
            {
              "type": "sightseeing",
              "name": "Royal Opera House",
              "coord": [
                51.513,
                -0.1257
              ]
            },
            {
              "type": "dinner",
              "name": "Rules",
              "coord": [
                51.5137,
                -0.1233
              ]
            },
            {
              "type": "optional",
              "name": "The American Bar (The Savoy)",
              "coord": [
                51.5117,
                -0.1199
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Westminster & Whitehall",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Westminster Abbey",
              "coord": [
                51.4994,
                -0.1275
              ]
            },
            {
              "type": "sightseeing",
              "name": "Buckingham Palace",
              "coord": [
                51.5015,
                -0.1406
              ]
            },
            {
              "type": "lunch",
              "name": "A. Wong",
              "coord": [
                51.4915,
                -0.13
              ]
            },
            {
              "type": "sightseeing",
              "name": "St James's Park",
              "coord": [
                51.5025,
                -0.137
              ]
            },
            {
              "type": "dinner",
              "name": "Sabor",
              "coord": [
                51.5094,
                -0.1449
              ]
            },
            {
              "type": "optional",
              "name": "Dukes Bar",
              "coord": [
                51.5047,
                -0.1291
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "South Bank Culture Crawl",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tate Modern",
              "coord": [
                51.5076,
                -0.0995
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shakespeare's Globe",
              "coord": [
                51.5081,
                -0.0973
              ]
            },
            {
              "type": "lunch",
              "name": "Borough Market Food Crawl",
              "coord": [
                51.5054,
                -0.0912
              ]
            },
            {
              "type": "sightseeing",
              "name": "London Eye",
              "coord": [
                51.5034,
                -0.1195
              ]
            },
            {
              "type": "dinner",
              "name": "Ikoyi",
              "coord": [
                51.513,
                -0.1199
              ]
            },
            {
              "type": "optional",
              "name": "Lyaness cocktails",
              "coord": [
                51.5068,
                -0.1198
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "East London Food & Art",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Columbia Road Flower Market",
              "coord": [
                51.5331,
                -0.0666
              ]
            },
            {
              "type": "breakfast",
              "name": "Brick Lane Sunday UpMarket",
              "coord": [
                51.5219,
                -0.0697
              ]
            },
            {
              "type": "sightseeing",
              "name": "Shoreditch Street Art",
              "coord": [
                51.5235,
                -0.0745
              ]
            },
            {
              "type": "lunch",
              "name": "Lyle's",
              "coord": [
                51.526,
                -0.076
              ]
            },
            {
              "type": "sightseeing",
              "name": "Young V&A",
              "coord": [
                51.5281,
                -0.0635
              ]
            },
            {
              "type": "dinner",
              "name": "Da Terra",
              "coord": [
                51.5304,
                -0.0763
              ]
            },
            {
              "type": "optional",
              "name": "Tayēr + Elementary cocktails",
              "coord": [
                51.5232,
                -0.0876
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "British Museum & Bloomsbury",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "British Museum",
              "coord": [
                51.5188,
                -0.1262
              ]
            },
            {
              "type": "lunch",
              "name": "Akoko",
              "coord": [
                51.5182,
                -0.1346
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sir John Soane's Museum",
              "coord": [
                51.5166,
                -0.1216
              ]
            },
            {
              "type": "dinner",
              "name": "Kitchen Table",
              "coord": [
                51.5192,
                -0.1336
              ]
            },
            {
              "type": "optional",
              "name": "West End Show",
              "coord": [
                51.5134,
                -0.1293
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Chelsea & South Ken Museums",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "V&A Museum",
              "coord": [
                51.4967,
                -0.1764
              ]
            },
            {
              "type": "sightseeing",
              "name": "Science Museum Wonderlab",
              "coord": [
                51.4972,
                -0.1768
              ]
            },
            {
              "type": "lunch",
              "name": "Elystan Street",
              "coord": [
                51.4909,
                -0.1646
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hyde Park & Kensington Gardens",
              "coord": [
                51.5086,
                -0.1634
              ]
            },
            {
              "type": "dinner",
              "name": "Five Fields",
              "coord": [
                51.4916,
                -0.1649
              ]
            },
            {
              "type": "optional",
              "name": "Harrods Food Halls",
              "coord": [
                51.4994,
                -0.1633
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Day Trip: Oxford & Le Manoir",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Oxford Colleges & Museums",
              "coord": [
                51.7545,
                -1.2544
              ]
            },
            {
              "type": "lunch",
              "name": "Oxford covered market lunch",
              "coord": [
                51.752,
                -1.257
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bodleian Library",
              "coord": [
                51.7537,
                -1.2541
              ]
            },
            {
              "type": "dinner",
              "name": "Le Manoir aux Quat'Saisons",
              "coord": [
                51.8341,
                -1.3167
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Day Trip: Cotswolds",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cotswolds Villages",
              "coord": [
                51.8155,
                -1.67
              ]
            },
            {
              "type": "lunch",
              "name": "Cotswolds pub lunch",
              "coord": [
                51.832,
                -1.723
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bibury & Arlington Row",
              "coord": [
                51.758,
                -1.832
              ]
            },
            {
              "type": "optional",
              "name": "Soho Farmhouse visit",
              "coord": [
                51.8594,
                -1.635
              ]
            },
            {
              "type": "dinner",
              "name": "The Harwood Arms",
              "coord": [
                51.4798,
                -0.2093
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Notting Hill & Kensington",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Notting Hill & Portobello Road",
              "coord": [
                51.5142,
                -0.2105
              ]
            },
            {
              "type": "lunch",
              "name": "The Ledbury",
              "coord": [
                51.5081,
                -0.2013
              ]
            },
            {
              "type": "sightseeing",
              "name": "Design Museum",
              "coord": [
                51.4999,
                -0.2004
              ]
            },
            {
              "type": "sightseeing",
              "name": "Kensington Palace",
              "coord": [
                51.505,
                -0.1878
              ]
            },
            {
              "type": "dinner",
              "name": "CORE by Clare Smyth",
              "coord": [
                51.5095,
                -0.2007
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Hampstead & North London",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hampstead Heath",
              "coord": [
                51.5609,
                -0.1636
              ]
            },
            {
              "type": "sightseeing",
              "name": "Primrose Hill",
              "coord": [
                51.5399,
                -0.1614
              ]
            },
            {
              "type": "lunch",
              "name": "Camden Market",
              "coord": [
                51.5414,
                -0.1466
              ]
            },
            {
              "type": "sightseeing",
              "name": "Little Venice Canal Walk",
              "coord": [
                51.5204,
                -0.1762
              ]
            },
            {
              "type": "dinner",
              "name": "Kol",
              "coord": [
                51.5244,
                -0.1451
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "City of London & Tower",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tower of London",
              "coord": [
                51.5085,
                -0.0761
              ]
            },
            {
              "type": "sightseeing",
              "name": "Tower Bridge Walkway",
              "coord": [
                51.5055,
                -0.0753
              ]
            },
            {
              "type": "lunch",
              "name": "Leadenhall Market",
              "coord": [
                51.5128,
                -0.0837
              ]
            },
            {
              "type": "sightseeing",
              "name": "St Paul's Cathedral",
              "coord": [
                51.5139,
                -0.0984
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sky Garden",
              "coord": [
                51.5113,
                -0.0837
              ]
            },
            {
              "type": "dinner",
              "name": "Restaurant Gordon Ramsay",
              "coord": [
                51.4897,
                -0.1665
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Farewell: Tea & Treats",
          "items": [
            {
              "type": "hotel",
              "name": "NoMad London",
              "coord": [
                51.5135,
                -0.1221
              ]
            },
            {
              "type": "sightseeing",
              "name": "Liberty London",
              "coord": [
                51.513,
                -0.1367
              ]
            },
            {
              "type": "lunch",
              "name": "Afternoon Tea at The Ritz",
              "coord": [
                51.5079,
                -0.1392
              ]
            },
            {
              "type": "sightseeing",
              "name": "Somerset House",
              "coord": [
                51.5066,
                -0.117
              ]
            },
            {
              "type": "dinner",
              "name": "Hélène Darroze at The Connaught",
              "coord": [
                51.5087,
                -0.1475
              ]
            },
            {
              "type": "optional",
              "name": "Connaught Bar farewell",
              "coord": [
                51.5087,
                -0.1475
              ]
            }
          ]
        }
      ]
    },
    "c": {
      "name": "Slow Family & Country Houses",
      "color": "#D97706",
      "days": [
        {
          "day": 1,
          "title": "Arrival & South Kensington Play",
          "items": [
            {
              "type": "hotel",
              "name": "Number Sixteen",
              "coord": [
                51.4943,
                -0.1814
              ]
            },
            {
              "type": "sightseeing",
              "name": "Natural History Museum",
              "coord": [
                51.4967,
                -0.1765
              ]
            },
            {
              "type": "lunch",
              "name": "V&A Café",
              "coord": [
                51.4967,
                -0.1764
              ]
            },
            {
              "type": "sightseeing",
              "name": "Diana Memorial Playground",
              "coord": [
                51.5092,
                -0.1883
              ]
            },
            {
              "type": "dinner",
              "name": "Elystan Street",
              "coord": [
                51.4909,
                -0.1646
              ]
            },
            {
              "type": "optional",
              "name": "Hyde Park pedal boats",
              "coord": [
                51.5053,
                -0.1621
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Paddington Bear & South Bank",
          "items": [
            {
              "type": "hotel",
              "name": "Number Sixteen",
              "coord": [
                51.4943,
                -0.1814
              ]
            },
            {
              "type": "sightseeing",
              "name": "Paddington Bear Experience",
              "coord": [
                51.5018,
                -0.1176
              ]
            },
            {
              "type": "sightseeing",
              "name": "SEA LIFE London Aquarium",
              "coord": [
                51.5012,
                -0.1189
              ]
            },
            {
              "type": "lunch",
              "name": "Southbank Centre café",
              "coord": [
                51.5061,
                -0.1164
              ]
            },
            {
              "type": "sightseeing",
              "name": "London Eye",
              "coord": [
                51.5034,
                -0.1195
              ]
            },
            {
              "type": "dinner",
              "name": "The Palomar",
              "coord": [
                51.515,
                -0.1309
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Zoo & Regent's Park",
          "items": [
            {
              "type": "hotel",
              "name": "Number Sixteen",
              "coord": [
                51.4943,
                -0.1814
              ]
            },
            {
              "type": "sightseeing",
              "name": "ZSL London Zoo",
              "coord": [
                51.536,
                -0.1536
              ]
            },
            {
              "type": "lunch",
              "name": "Regent's Park picnic",
              "coord": [
                51.5311,
                -0.1599
              ]
            },
            {
              "type": "sightseeing",
              "name": "Primrose Hill",
              "coord": [
                51.5399,
                -0.1614
              ]
            },
            {
              "type": "dinner",
              "name": "Kol",
              "coord": [
                51.5244,
                -0.1451
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Greenwich Family Day",
          "items": [
            {
              "type": "hotel",
              "name": "Number Sixteen",
              "coord": [
                51.4943,
                -0.1814
              ]
            },
            {
              "type": "sightseeing",
              "name": "Thames Clippers Boat Ride",
              "coord": [
                51.5,
                -0.115
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cutty Sark",
              "coord": [
                51.4829,
                -0.0097
              ]
            },
            {
              "type": "lunch",
              "name": "Greenwich Market",
              "coord": [
                51.4768,
                -0.0005
              ]
            },
            {
              "type": "sightseeing",
              "name": "Greenwich Royal Observatory",
              "coord": [
                51.4768,
                -0.0005
              ]
            },
            {
              "type": "dinner",
              "name": "River Café",
              "coord": [
                51.4887,
                -0.2278
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Harry Potter Studio Tour",
          "items": [
            {
              "type": "hotel",
              "name": "Number Sixteen",
              "coord": [
                51.4943,
                -0.1814
              ]
            },
            {
              "type": "sightseeing",
              "name": "Warner Bros. Studio Tour (Harry Potter)",
              "coord": [
                51.6911,
                -0.4182
              ]
            },
            {
              "type": "lunch",
              "name": "Studio Tour café",
              "coord": [
                51.6911,
                -0.4182
              ]
            },
            {
              "type": "dinner",
              "name": "The Wolseley",
              "coord": [
                51.507,
                -0.1384
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Markets, Hamleys & West End Show",
          "items": [
            {
              "type": "hotel",
              "name": "Number Sixteen",
              "coord": [
                51.4943,
                -0.1814
              ]
            },
            {
              "type": "sightseeing",
              "name": "Covent Garden Piazza",
              "coord": [
                51.5124,
                -0.1251
              ]
            },
            {
              "type": "sightseeing",
              "name": "London Transport Museum",
              "coord": [
                51.5124,
                -0.1251
              ]
            },
            {
              "type": "lunch",
              "name": "Borough Market Food Crawl",
              "coord": [
                51.5054,
                -0.0912
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hamleys",
              "coord": [
                51.5128,
                -0.1402
              ]
            },
            {
              "type": "dinner",
              "name": "Early dinner near West End",
              "coord": [
                51.513,
                -0.128
              ]
            },
            {
              "type": "sightseeing",
              "name": "West End Matinee or Evening Show",
              "coord": [
                51.5134,
                -0.1293
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Country Escape: The Grove",
          "items": [
            {
              "type": "hotel",
              "name": "The Grove",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to The Grove",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "lunch",
              "name": "The Grove restaurant",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "optional",
              "name": "Pool, gardens & family activities",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "dinner",
              "name": "The Grove dining",
              "coord": [
                51.6089,
                -0.4292
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Country Day & Relaxation",
          "items": [
            {
              "type": "hotel",
              "name": "The Grove",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "optional",
              "name": "Morning pool/spa/games",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "sightseeing",
              "name": "Countryside walk or bike ride",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "lunch",
              "name": "Afternoon Tea at The Grove",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "dinner",
              "name": "The Grove restaurant",
              "coord": [
                51.6089,
                -0.4292
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Day Trip: Windsor Castle",
          "items": [
            {
              "type": "hotel",
              "name": "The Grove",
              "coord": [
                51.6089,
                -0.4292
              ]
            },
            {
              "type": "sightseeing",
              "name": "Windsor Castle",
              "coord": [
                51.4833,
                -0.6042
              ]
            },
            {
              "type": "lunch",
              "name": "Windsor lunch",
              "coord": [
                51.4833,
                -0.6042
              ]
            },
            {
              "type": "sightseeing",
              "name": "Windsor Great Park",
              "coord": [
                51.4773,
                -0.6169
              ]
            },
            {
              "type": "dinner",
              "name": "The Fat Duck",
              "coord": [
                51.4888,
                -0.6385
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Return to London: Kew & Richmond",
          "items": [
            {
              "type": "hotel",
              "name": "11 Cadogan Gardens",
              "coord": [
                51.4936,
                -0.1595
              ]
            },
            {
              "type": "sightseeing",
              "name": "Kew Gardens",
              "coord": [
                51.4783,
                -0.298
              ]
            },
            {
              "type": "lunch",
              "name": "Kew Gardens café",
              "coord": [
                51.4783,
                -0.298
              ]
            },
            {
              "type": "sightseeing",
              "name": "Richmond Park",
              "coord": [
                51.4412,
                -0.2749
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner by Heston Blumenthal",
              "coord": [
                51.5023,
                -0.1605
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "Last London Sights",
          "items": [
            {
              "type": "hotel",
              "name": "11 Cadogan Gardens",
              "coord": [
                51.4936,
                -0.1595
              ]
            },
            {
              "type": "sightseeing",
              "name": "Changing of the Guard",
              "coord": [
                51.5015,
                -0.1406
              ]
            },
            {
              "type": "lunch",
              "name": "Afternoon Tea at Claridge's",
              "coord": [
                51.5102,
                -0.15
              ]
            },
            {
              "type": "sightseeing",
              "name": "Fortnum & Mason",
              "coord": [
                51.5084,
                -0.1385
              ]
            },
            {
              "type": "dinner",
              "name": "Restaurant Gordon Ramsay",
              "coord": [
                51.4897,
                -0.1665
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Farewell: Battersea & Chelsea",
          "items": [
            {
              "type": "hotel",
              "name": "11 Cadogan Gardens",
              "coord": [
                51.4936,
                -0.1595
              ]
            },
            {
              "type": "sightseeing",
              "name": "Battersea Park",
              "coord": [
                51.4791,
                -0.1568
              ]
            },
            {
              "type": "sightseeing",
              "name": "Battersea Park Children's Zoo",
              "coord": [
                51.4791,
                -0.1568
              ]
            },
            {
              "type": "lunch",
              "name": "Harrods Food Halls",
              "coord": [
                51.4994,
                -0.1633
              ]
            },
            {
              "type": "optional",
              "name": "Last stroll through Chelsea",
              "coord": [
                51.49,
                -0.163
              ]
            },
            {
              "type": "dinner",
              "name": "The Harwood Arms",
              "coord": [
                51.4798,
                -0.2093
              ]
            }
          ]
        }
      ]
    }
  }
}