{
  "key": "vietnam",
  "name": "Vietnam Family Adventure",
  "subtitle": "Interactive Trip Map",
  "flag": "🇻🇳",
  "defaultCenter": [
    16.0,
    107.0
  ],
  "defaultZoom": 6,
  "hotels": [
    {
      "name": "Capella Hanoi",
      "coord": [
        21.025715,
        105.85681
      ],
      "desc": "Bill Bensley opera-house glam; central; standout dining incl. Koki/Hibana; Design ...",
      "longDesc": "An architectural masterpiece housed in a restored opera house, this hotel captures Hanoi's cultural heartbeat with world-class French-Vietnamese dining and stunning design that captivates architecture lovers."
    },
    {
      "name": "Sofitel Legend Metropole Hanoi",
      "coord": [
        21.025488,
        105.855978
      ],
      "desc": "1901 grand dame; French Quarter; iconic bars/restaurants; History buffs; classic-l...",
      "longDesc": "A living museum since 1901, this French colonial icon offers elegant rooms steeped in heritage and legendary cocktail bars where generations of travelers have celebrated timeless Hanoi."
    },
    {
      "name": "The Legend Hanoi Hotel",
      "coord": [
        16.06817,
        108.243412
      ],
      "desc": "Modern luxury, strong location near key sights; Central stay; business & leisure",
      "longDesc": "Perfectly positioned for exploring Hanoi's treasures, this sleek modern hotel combines upscale comfort with walkability, making it ideal for families who want style without fussiness."
    },
    {
      "name": "Peridot Grand Luxury Boutique Hotel",
      "coord": [
        21.033048,
        105.846297
      ],
      "desc": "Rooftop pool/bar; walkable Old Quarter base; Boutique lovers; couples",
      "longDesc": "A rooftop oasis in the charming Old Quarter, this intimate boutique hotel delivers romantic ambiance with bird's-eye views of Hanoi's ancient streets and bustling daily life."
    },
    {
      "name": "Lotte Hotel Hanoi",
      "coord": [
        21.032168,
        105.812493
      ],
      "desc": "Skyscraper views; multiple restaurants; big gym/spa; Views; amenities; families",
      "longDesc": "Towering above the city with panoramic rooftop dining and full-service spa, this family-friendly skyscraper offers everything under one roof from kids' clubs to executive lounges."
    },
    {
      "name": "Chi Hotel",
      "coord": [
        21.0265,
        105.845
      ],
      "desc": "Stylish boutique base; rooftop bar; Value + style",
      "longDesc": "Stylish minimalist design meets Old Quarter convenience at this savvy boutique hideaway, where the rooftop bar serves sunset cocktails against red-tiled roofs and temple silhouettes."
    },
    {
      "name": "Hotel de l'Opera Hanoi - MGallery",
      "coord": [
        21.03472,
        105.847534
      ],
      "desc": "Belle Époque interiors; central near opera house; Art/design lovers",
      "longDesc": "Wrapped in Belle Époque grandeur just steps from the historic Opera House, this artistic hotel immerses guests in Hanoi's refined French-Vietnamese heritage through ornate details."
    },
    {
      "name": "Mövenpick Hotel Hanoi (French Quarter)",
      "coord": [
        21.02511,
        105.84435
      ],
      "desc": "Refreshed design; strong F&B; Comfort & convenience",
      "longDesc": "Swiss-standard efficiency blends with French Quarter charm at this refreshed hotel, offering dependable comfort, excellent dining, and easy access to central attractions."
    },
    {
      "name": "Pan Pacific Hanoi",
      "coord": [
        21.04987,
        105.839857
      ],
      "desc": "West Lake setting; indoor pool; great views; Lake views; families",
      "longDesc": "Serene West Lake views and a family-welcoming pool make this elegant waterfront hotel a peaceful escape from the city's hustle while remaining well-connected to major sights."
    },
    {
      "name": "InterContinental Hanoi Westlake",
      "coord": [
        21.05834,
        105.83165
      ],
      "desc": "Overwater rooms; lake + pagoda views; Relaxed lake stay",
      "longDesc": "Wake to mirror reflections of pagodas on tranquil West Lake from overwater rooms that feel like a luxury treehouse, blending lake serenity with upscale service."
    },
    {
      "name": "Aira Hanoi Hotel & Spa",
      "coord": [
        21.0268,
        105.8485
      ],
      "desc": "Sky bar views; spa; Old Quarter base; Couples; quick city break",
      "longDesc": "A sky-high spa sanctuary in the Old Quarter, this intimate hotel rewards travelers with panoramic city views and rejuvenating wellness treatments after exploring bustling street markets."
    },
    {
      "name": "Meritel Hanoi",
      "coord": [
        21.029,
        105.852
      ],
      "desc": "Central boutique base with modern comforts; Boutique seekers",
      "longDesc": "A refined Central boutique option with modern comforts and a warm welcome, perfectly positioned for exploring the French Quarter without overwhelming corporate-hotel feeling."
    },
    {
      "name": "Grand Hotel du Lac Hanoi",
      "coord": [
        21.0872,
        105.8242
      ],
      "desc": "Boutique charm; Old Quarter access; Style + location",
      "longDesc": "Boutique charm in an elegant setting with easy Old Quarter access, this intimate hotel balances style and location for travelers seeking sophisticated central base."
    },
    {
      "name": "The Reverie Saigon",
      "coord": [
        10.773873,
        106.704865
      ],
      "desc": "Opulent Italian-palazzo styling; top-notch spa & dining; Ultra-luxury; couples",
      "longDesc": "Opulent Italian-palazzo styling defines this Ho Chi Minh City luxury flagship, where a world-class spa and inventive dining create an unforgettable urban escape."
    },
    {
      "name": "Park Hyatt Saigon",
      "coord": [
        10.777534,
        106.703416
      ],
      "desc": "Colonial-era elegance; central; strong dining; Classic city luxury",
      "longDesc": "This colonial-era elegance landmark in Ho Chi Minh City offers iconic bars, refined dining, and a prime location ideal for history buffs and classic travelers."
    },
    {
      "name": "Hôtel des Arts Saigon – MGallery Collection",
      "coord": [
        10.7769,
        106.6975
      ],
      "desc": "Art-deco vibe; rooftop pool/bar; Design lovers",
      "longDesc": "Art-deco vibes shine at this design-forward hotel with a rooftop pool overlooking the city, perfectly suited for design-conscious travelers seeking style and substance."
    },
    {
      "name": "Mia Saigon",
      "coord": [
        10.7748,
        106.7025
      ],
      "desc": "Riverside setting; boutique feel; Quieter base; families",
      "longDesc": "Riverside setting and boutique charm make this Ho Chi Minh City hotel a quieter base for families, offering proximity to attractions without the bustling central hustle."
    },
    {
      "name": "Mai House Saigon",
      "coord": [
        10.781924,
        106.691579
      ],
      "desc": "Polished modern classic; great service; Comfort + value",
      "longDesc": "Polished modern classic styling and attentive service define this comfortable Ho Chi Minh City option, ideal for travelers seeking reliable comfort with Vietnamese-style hospitality."
    },
    {
      "name": "Sheraton Saigon Grand Opera Hotel",
      "coord": [
        10.775848,
        106.703995
      ],
      "desc": "Prime location; skyline views; Central stay",
      "longDesc": "Prime central location with commanding skyline views positions this hotel as a strong choice for visitors wanting to be in the heart of Ho Chi Minh City's action."
    },
    {
      "name": "Vinpearl Landmark 81, Autograph Collection",
      "coord": [
        20.86301,
        106.661515
      ],
      "desc": "In Landmark 81 tower; panoramic city views; Views; modern luxury",
      "longDesc": "Housed in Vietnam's tallest tower with panoramic city views, this modern luxury hotel offers contemporary comfort and the thrill of staying in an architectural landmark."
    },
    {
      "name": "An Lam Retreats Saigon River",
      "coord": [
        10.758,
        106.687
      ],
      "desc": "Riverside seclusion close to city; villa-style stays; Nature break; couples",
      "longDesc": "Riverside seclusion within easy reach of Ho Chi Minh City creates a villa-style escape perfect for couples and nature-seekers wanting tranquil elegance."
    },
    {
      "name": "La Siesta Premium Saigon",
      "coord": [
        10.773017,
        106.695709
      ],
      "desc": "Central boutique option with polished rooms; Boutique + location",
      "longDesc": "Central boutique option with polished design and strong service makes this hotel a smart choice for travelers wanting personal attention and authentic character."
    },
    {
      "name": "InterContinental Danang Sun Peninsula Resort",
      "coord": [
        16.121088,
        108.306136
      ],
      "desc": "Bill Bensley design; private beach; destination dining; Iconic splurge; families",
      "longDesc": "Bill Bensley's signature design transforms a private beach into a destination unto itself, where every meal and view celebrates Vietnam's coastal beauty."
    },
    {
      "name": "Banyan Tree Lang Co",
      "coord": [
        16.338052,
        107.953753
      ],
      "desc": "Villas with pools; lagoon & sea scenery; Beach + villas; families",
      "longDesc": "Villas with private pools overlooking lagoon and sea create an all-villa resort experience perfect for couples and families seeking tropical luxury and beach bliss."
    },
    {
      "name": "Anantara Hoi An Resort",
      "coord": [
        15.87706,
        108.33699
      ],
      "desc": "Riverside resort close to UNESCO old town; Old Town access; families",
      "longDesc": "Riverside location steps from UNESCO Old Town offers riverside charm with easy access to Hoi An's lantern-lit streets and cultural treasures."
    },
    {
      "name": "Four Seasons Resort The Nam Hai",
      "coord": [
        15.876,
        108.315
      ],
      "desc": "Beachfront villas; strong wellness & dining; Families; wellness; beach",
      "longDesc": "Beachfront villas with exceptional wellness programming and culinary offerings create an ideal family destination combining relaxation with adventure."
    },
    {
      "name": "TIA Wellness Resort",
      "coord": [
        16.03117,
        108.255199
      ],
      "desc": "Pool villas; strong spa + wellbeing programming; Wellness-first stay",
      "longDesc": "Pool villas and strong spa-focused programming make this coastal retreat perfect for wellness-minded travelers seeking rejuvenation and healthy indulgence."
    },
    {
      "name": "Namia River Retreat",
      "coord": [
        15.867,
        108.335
      ],
      "desc": "Boutique river retreat with spa focus; Wellness + design; families",
      "longDesc": "Boutique riverside setting with spa focus delivers intimate wellness escape combining design, comfort, and nature connection."
    },
    {
      "name": "Boutique Hoi An Resort",
      "coord": [
        15.90413,
        108.3532
      ],
      "desc": "Beachfront resort with easy access to Hoi An; Families; relaxed beach base",
      "longDesc": "Beachfront location with easy access to Hoi An Ancient Town makes this family-friendly resort ideal for combining beach time with cultural exploration."
    },
    {
      "name": "Azerai La Residence, Hue",
      "coord": [
        16.4591,
        107.580153
      ],
      "desc": "Perfume River setting; Art Deco/colonial feel; Culture base; couples",
      "longDesc": "Perfume River setting and art-deco charm position this hotel as the perfect culture base for exploring imperial Hue with style and sophistication."
    },
    {
      "name": "Jiva Hoa Lu Retreat",
      "coord": [
        20.241,
        105.438
      ],
      "desc": "Set in karst landscapes near Trang An; boutique hideaway; Nature + culture; wellness",
      "longDesc": "Set dramatically amid karst landscapes near Trang An, this boutique hideaway offers nature immersion with spa and wellness as core experiences."
    },
    {
      "name": "Anantara Quy Nhon Villas",
      "coord": [
        13.7833,
        109.2167
      ],
      "desc": "All-villa resort; butler service; dramatic bays; Secluded beach escape",
      "longDesc": "All-villa resort with butler service and dramatic bay views delivers ultimate privacy and pampering for discerning travelers."
    },
    {
      "name": "Six Senses Ninh Van Bay",
      "coord": [
        12.3587,
        109.27762
      ],
      "desc": "Secluded bay villas; wellness + nature; Eco-luxury; families",
      "longDesc": "Secluded bay villas with wellness and nature integration create an eco-luxury experience where families experience authentic connection to nature."
    },
    {
      "name": "Amanoi",
      "coord": [
        11.613,
        108.857
      ],
      "desc": "Aman serenity in Nui Chua NP; epic views; strong experiences; Wellness; splurge; f...",
      "longDesc": "Aman serenity in a national park with epic views and signature experiences defines luxury with purpose at this exclusive highland retreat."
    },
    {
      "name": "Zannier Hotels Bãi San Hô",
      "coord": [
        13.254,
        109.3275
      ],
      "desc": "Villas inspired by local styles; big beach + estate feel; Families; design lovers",
      "longDesc": "Locally-inspired villa architecture and expansive beach create a family-friendly resort where design honors regional traditions."
    },
    {
      "name": "Six Senses Con Dao",
      "coord": [
        8.7013,
        106.63341
      ],
      "desc": "Remote archipelago; conservation-minded; villa stays; Nature; beach; families",
      "longDesc": "Remote archipelago location with conservation focus defines this villa resort for nature-loving couples seeking ultimate privacy and purpose."
    },
    {
      "name": "JW Marriott Phu Quoc Emerald Bay Resort & Spa",
      "coord": [
        10.033482,
        104.02817
      ],
      "desc": "Whimsical Bill Bensley design; beachfront resort; Design lovers; families",
      "longDesc": "Whimsical Bill Bensley design and beachfront location make this resort a playful family destination with imagination and comfort woven throughout."
    },
    {
      "name": "Regent Phu Quoc",
      "coord": [
        10.318,
        103.962
      ],
      "desc": "Large suites/villas; refined service; long-stay comfort; Beach luxury; families",
      "longDesc": "Large suites and villas with refined service cater to long-stay comfort seekers wanting upscale beach relaxation without pretense."
    },
    {
      "name": "La Veranda Resort Phu Quoc - MGallery",
      "coord": [
        10.193892,
        103.964671
      ],
      "desc": "Colonial-style boutique on beach; Couples; charm",
      "longDesc": "Colonial-style boutique on pristine beach combines historic charm with modern beach-resort comfort for couples seeking romantic coastal escape."
    },
    {
      "name": "The Westin Resort & Spa Cam Ranh",
      "coord": [
        12.033335,
        109.212621
      ],
      "desc": "Big resort comforts; beach access; Families; beach",
      "longDesc": "Big resort comforts and beach access make this property ideal for families wanting familiar amenities with coastal Vietnamese setting."
    },
    {
      "name": "Villa Le Corail, a Gran Meliá Hotel",
      "coord": [
        11.918,
        109.19
      ],
      "desc": "High-end coastal stay; strong dining; Gastronomy + beach",
      "longDesc": "High-end coastal stay with strong dining program celebrates gastronomy and beach views for food-focused travelers."
    },
    {
      "name": "The Anam Cam Ranh",
      "coord": [
        11.91667,
        109.14861
      ],
      "desc": "Beachfront resort with Indochine styling; Families; classic resort vibe",
      "longDesc": "Beachfront resort with Indochine styling offers classic elegance and family comfort on Cam Ranh's quieter shores."
    },
    {
      "name": "The Anam Mui Ne",
      "coord": [
        12.100286,
        109.188573
      ],
      "desc": "Indochine styling; access to dunes + ruins; Families; weekend escape",
      "longDesc": "Indochine-styled refuge with access to sand dunes and archaeological ruins makes this weekend escape perfect for adventure-seeking families."
    },
    {
      "name": "Azerai Ke Ga Bay",
      "coord": [
        10.99,
        107.28
      ],
      "desc": "Adrian Zecha’s minimalist escape on coast; Design lovers; couples",
      "longDesc": "Adrian Zecha's minimalist coastal escape balances design purity with comfort, ideal for travelers valuing understated elegance and nature."
    },
    {
      "name": "Avana Retreat",
      "coord": [
        20.698927,
        104.945852
      ],
      "desc": "Mountain valley retreat with villas; outdoorsy calm; Nature; families",
      "longDesc": "Mountain valley setting with villa architecture creates a nature-centered retreat for travelers seeking mountain calm and cultural immersion."
    },
    {
      "name": "Mia Resort Nha Trang",
      "coord": [
        12.234877,
        109.194144
      ],
      "desc": "Design-led beachfront resort; Beach + design",
      "longDesc": "Design-led beachfront property celebrates contemporary Vietnamese aesthetics with warm hospitality for design-conscious beach lovers."
    },
    {
      "name": "InterContinental Halong Bay Resort",
      "coord": [
        20.96,
        107.04
      ],
      "desc": "Modern luxury base for bay cruises; Gateway to Ha Long; families",
      "longDesc": "Modern luxury base positioned for Ha Long Bay exploration, ideal for families wanting comfort and easy access to natural wonders."
    },
    {
      "name": "Azerai Can Tho",
      "coord": [
        10.036205,
        105.787266
      ],
      "desc": "Jungle-islet retreat; easy floating-market access; Mekong base; couples",
      "longDesc": "Jungle-islet retreat with easy floating-market access creates authentic Mekong Delta immersion with upscale comfort."
    },
    {
      "name": "Heritage Line – Ginger (Lan Ha Bay cruise)",
      "coord": [
        20.945,
        107.049
      ],
      "desc": "Boutique overnight cruise through karst seascapes; Families; photographers",
      "longDesc": "Boutique overnight cruise through karst seascapes offers gentle adventure with family-friendly pace and included water activities."
    },
    {
      "name": "Chen Sea Resort & Spa Phu Quoc",
      "coord": [
        10.217091,
        103.959054
      ],
      "desc": "Beachfront villas; boutique feel on Phu Quoc; Couples; quieter beach stay",
      "longDesc": "Beachfront villas with boutique feel deliver quiet Phu Quoc escape for couples seeking privacy and coastal charm."
    }
  ],
  "restaurants": [
    {
      "name": "Gia",
      "coord": [
        10.01071,
        105.083262
      ],
      "desc": "1* MICHELIN — seasonal 12-course Vietnamese contemporary tasting; Vietnamese Conte...",
      "longDesc": "One Michelin star crowns this seasonal tasting menu restaurant where Vietnamese culinary innovation shines through 12 meticulous courses of contemporary technique and local wisdom."
    },
    {
      "name": "Hibana by Koki",
      "coord": [
        21.0305,
        105.8582
      ],
      "desc": "1* MICHELIN — intimate teppanyaki counter in Capella Hanoi; Teppanyaki",
      "longDesc": "One Michelin star celebrates chef Koki's intimate teppanyaki counter in Capella, where theatrical cooking and Japanese-Vietnamese fusion unfold inches from your seat."
    },
    {
      "name": "Tầm Vị",
      "coord": [
        21.01397,
        105.32996
      ],
      "desc": "1* MICHELIN — classic Vietnamese cooking in a house setting; Vietnamese",
      "longDesc": "One Michelin star recognizes this chef's-table celebration of classic Vietnamese cooking served in a charming house, where tradition meets personalized attention."
    },
    {
      "name": "Ănăn Saigon",
      "coord": [
        10.771803,
        106.702975
      ],
      "desc": "1* MICHELIN — modern Vietnamese in a market-tower setting; Vietnamese Contemporary",
      "longDesc": "One Michelin star honors this modern Vietnamese restaurant set in a market tower, where contemporary plating elevates street-food wisdom to fine-dining art."
    },
    {
      "name": "Long Trieu",
      "coord": [
        10.470868,
        107.216989
      ],
      "desc": "1* MICHELIN — refined Cantonese at The Reverie Saigon; Cantonese",
      "longDesc": "One Michelin star celebrates refined Cantonese mastery at The Reverie, where skilled technique and premium ingredients create elegant Hong Kong-style dining."
    },
    {
      "name": "Coco Dining",
      "coord": [
        10.948491,
        108.205339
      ],
      "desc": "1* MICHELIN — inventive tasting menus (NEW in 2025); Innovative",
      "longDesc": "One Michelin star marks this inventive restaurant's debut, where chef reimagines Vietnamese classics through unexpected techniques and ingredient combinations."
    },
    {
      "name": "Akuna",
      "coord": [
        10.779757,
        106.707343
      ],
      "desc": "1* MICHELIN — modern, technique-driven menus; Innovative",
      "longDesc": "One Michelin star recognizes this technique-driven restaurant where modern culinary methods elevate Vietnamese foundations into sophisticated contemporary cuisine."
    },
    {
      "name": "CieL",
      "coord": [
        21.063776,
        105.867225
      ],
      "desc": "1* MICHELIN — chef’s table experience (NEW in 2025); Innovative",
      "longDesc": "One Michelin star defines this intimate chef's table experience where the counter seats guests for an immersive culinary performance."
    },
    {
      "name": "La Maison 1888",
      "coord": [
        16.0471,
        107.0843
      ],
      "desc": "1* MICHELIN — elegant French contemporary at InterContinental Danang; French Conte...",
      "longDesc": "One Michelin star celebrates elegant French contemporary cuisine at InterContinental Danang, where European traditions meet Vietnamese ingredients."
    },
    {
      "name": "Lamai Garden",
      "coord": [
        21.0285,
        105.8602
      ],
      "desc": "MICHELIN Green Star — farm-to-table, zero-waste focus (NEW in 2025); Vietnamese Co...",
      "longDesc": "Michelin Green Star marks this farm-to-table restaurant's commitment to zero-waste cooking and seasonal Vietnamese ingredients with honest, flavorful results."
    },
    {
      "name": "Nén Danang",
      "coord": [
        16.03101,
        108.25502
      ],
      "desc": "MICHELIN Green Star — seasonal, local ingredients, farm-to-table; Vietnamese Conte...",
      "longDesc": "Michelin Green Star recognizes this seasonal restaurant's dedication to local ingredients and sustainable practices creating authentic farm-fresh Vietnamese meals."
    },
    {
      "name": "Phở Khôi Hói",
      "coord": [
        15.877298,
        108.331907
      ],
      "desc": "Hanoi pho legend, 50-year bone broth, Old Quarter",
      "longDesc": "Michelin inspectors picked this phở spot for its consistently excellent broth and honest, no-frills approach to Vietnam's most beloved dish."
    },
    {
      "name": "Ngọc Chi",
      "coord": [
        19.14156,
        105.58845
      ],
      "desc": "Hanoi street pho, sunrise ritual, local institution",
      "longDesc": "Michelin-recommended quality defines this Hanoi favorite where pho mastery and loyal crowds prove that best food needs no decoration."
    },
    {
      "name": "Bà Đông",
      "coord": [
        20.934503,
        106.714508
      ],
      "desc": "Hanoi grilled pork, charred perfection, noodle dip tradition",
      "longDesc": "Michelin-recognized quality ensures this spot delivers authentic Vietnamese cooking at genuine local prices with genuine neighborhood warmth."
    },
    {
      "name": "Phở Bò Lâm",
      "coord": [
        11.942211,
        108.434051
      ],
      "desc": "North Vietnamese pho, perfect balance, noodle artistry",
      "longDesc": "Michelin-approved excellence marks this beef-pho specialist where slow-simmered broth and perfectly sliced beef create bowls that justify the queue."
    },
    {
      "name": "Bánh Xèo 76",
      "coord": [
        13.781668,
        109.22339
      ],
      "desc": "Crispy banh xeo, shrimp & pork, sizzling tradition",
      "longDesc": "Michelin-recognized this crispy turmeric crepe spot where skilled flippers work the griddle and fresh herbs make each bite a textural celebration."
    },
    {
      "name": "Bún Bò Huế Bà Thương",
      "coord": [
        10.7829,
        106.7029
      ],
      "desc": "Cha gio specialty, shrimp-pork filling, dipping sauce perfection",
      "longDesc": "Michelin-picked this specialty bun bo hue restaurant where the central Vietnamese spiced noodle broth comes with authentic firepower and depth."
    },
    {
      "name": "Miến Lươn Đông Thịnh",
      "coord": [
        21.031853,
        105.846905
      ],
      "desc": "Hanoi egg coffee, traditional brewing, morning ceremony",
      "longDesc": "Michelin-recommended eel vermicelli where tender eel and aromatic broth create a rustic delicacy that's pure soul-food comfort."
    },
    {
      "name": "Bò Kho Gánh",
      "coord": [
        10.7769,
        106.6969
      ],
      "desc": "Pho establishment, anise fragrance, customer loyalty",
      "longDesc": "Michelin-approved beef stew where the street-cart tradition of slow-cooked brisket shines through in every fragrant spoonful."
    },
    {
      "name": "Bánh Xèo Tôm Nhảy Cô Ba",
      "coord": [
        13.781668,
        109.22339
      ],
      "desc": "Hanoi banh cuon, fresh rice rolls, market tradition",
      "longDesc": "Michelin recognized this legendary jumping-shrimp banh xeo spot where fresh shrimp and crispy crepes celebrate Saigon street-food tradition."
    },
    {
      "name": "Bún Chả Cá 109",
      "coord": [
        20.884985,
        106.702785
      ],
      "desc": "Plant-forward Vietnamese, herb-driven, innovative tradition",
      "longDesc": "Michelin-picked charred fish cakes and noodles where the grill's flames and herb-scattered broth create the ultimate handheld meal."
    },
    {
      "name": "Ăn Thôi",
      "coord": [
        9.346893,
        105.090417
      ],
      "desc": "Crispy sizzling crepes, shrimp & pork, sizzle on table",
      "longDesc": "Michelin inspectors loved this casual spot for its honest Vietnamese cooking and genuine neighborhood vibe without touristic pretense."
    },
    {
      "name": "Quán Nhân",
      "coord": [
        12.288074,
        109.191267
      ],
      "desc": "Rice congee comfort, century egg, warming breakfast tradition",
      "longDesc": "Michelin-approved where traditional Vietnamese techniques meet fresh market ingredients in a no-fuss setting that prioritizes flavor."
    },
    {
      "name": "Bún Chả Cá Hờn",
      "coord": [
        16.074083,
        108.221241
      ],
      "desc": "Contemporary Vietnamese, refined plating, cultural innovation",
      "longDesc": "Michelin recognized charred fish cake specialty where the ritual of dipping and eating with hands feels like true cultural participation."
    },
    {
      "name": "Phở Miến Gà Kỳ Đồng",
      "coord": [
        10.7789,
        106.6969
      ],
      "desc": "Da Nang coastal heritage, fresh seafood, central Vietnam",
      "longDesc": "Michelin-picked chicken pho and vermicelli where the broth's clear flavor speaks to hours of careful simmering and meat selection."
    },
    {
      "name": "Thìa Gỗ",
      "coord": [
        16.052962,
        108.241507
      ],
      "desc": "Rabbit speciality, slow-braised perfection, countryside recipe",
      "longDesc": "Michelin-approved casual dining where wooden spoons and honest Vietnamese home cooking prove that best meals need no fuss."
    },
    {
      "name": "Nhà Tú",
      "coord": [
        10.775194,
        106.689576
      ],
      "desc": "Bun cha Hanoi, smoky meat, herb garden fresh",
      "longDesc": "Michelin recognized this cozy spot for its carefully executed Vietnamese classics and warm neighborhood welcome that feels like family dining."
    },
    {
      "name": "Bánh Xèo 46A",
      "coord": [
        10.789605,
        106.691299
      ],
      "desc": "Dumpling expertise, handmade wrappers, seasonal fillings",
      "longDesc": "Michelin-approved banh xeo where the griddle expertise and fresh ingredient quality justify the cramped-but-joyful standing-room setting."
    },
    {
      "name": "Mặn Mòi (Thu Duc City)",
      "coord": [
        10.7729,
        106.7009
      ],
      "desc": "Banh xeo specialist, golden texture, dipping sauce artistry",
      "longDesc": "Michelin-recognized quality Vietnamese cooking where authentic flavors and fair prices attract locals who know where to eat."
    },
    {
      "name": "Chào Bạn",
      "coord": [
        21.075659,
        105.42331
      ],
      "desc": "Noodle soup foundation, stock depth, umami balance",
      "longDesc": "Michelin-picked casual spot where friendly service and solid Vietnamese standards create a welcoming neighborhood gathering place."
    },
    {
      "name": "Phở Phượng",
      "coord": [
        21.0325,
        105.8562
      ],
      "desc": "Northern pho tradition, slow-simmered, family vendor",
      "longDesc": "Michelin-approved pho where the silky broth and generous portions prove that best bowl doesn't need fanfare."
    },
    {
      "name": "Bun Cha Ta (Nguyen Huu Huan St.)",
      "coord": [
        21.034357,
        105.854493
      ],
      "desc": "Saigon broken rice, grilled meat, affordable daily special",
      "longDesc": "Michelin recognized this charred pork specialty where the griddle technique and herb abundance celebrate Hanoi's most iconic street meal."
    },
    {
      "name": "Phở Hương Bình",
      "coord": [
        11.53549,
        107.42706
      ],
      "desc": "Hanoi cultural cuisine, old quarter charm, dining institution",
      "longDesc": "Michelin-picked for its aromatic broth quality and authentic approach to Hanoi pho tradition without modern adaptation."
    },
    {
      "name": "Phở Lệ (District 5)",
      "coord": [
        21.033269,
        105.837265
      ],
      "desc": "MICHELIN-recognized, quality value balance, local treasure",
      "longDesc": "Michelin-approved where this reliable pho spot delivers consistent quality and authentic preparation that keeps locals returning."
    },
    {
      "name": "Bún Chả Chan",
      "coord": [
        21.010222,
        105.850671
      ],
      "desc": "Modern Saigon cuisine, molecular techniques, heritage roots",
      "longDesc": "Michelin recognized charred pork and noodles where the skillful grilling and fresh herbs create handheld Vietnamese perfection."
    },
    {
      "name": "The East",
      "coord": [
        21.029729,
        105.844128
      ],
      "desc": "Paste & relish, fermented mastery, condiment culture",
      "longDesc": "Michelin inspectors appreciated this modern-casual spot for elevated Vietnamese cooking that respects tradition while embracing contemporary technique."
    },
    {
      "name": "Chay Garden (District 3)",
      "coord": [
        10.7749,
        106.7029
      ],
      "desc": "Snail delicacy, garlic butter, French-Vietnamese fusion",
      "longDesc": "Michelin-recognized vegetarian Vietnamese where creative plant-based dishes prove that meat-free cooking can be deeply satisfying."
    },
    {
      "name": "Phở Gia Truyền (Hoan Kiem)",
      "coord": [
        21.033638,
        105.846379
      ],
      "desc": "Hanoi pho house, broth depth, meat quality focus",
      "longDesc": "Michelin-picked for its generational pho mastery and Hanoi authenticity where the broth's clarity reflects dedication to craft."
    },
    {
      "name": "Ưu Đàm",
      "coord": [
        20.922269,
        106.71833
      ],
      "desc": "Beef pho mastery, aromatic broth, generations-old",
      "longDesc": "Michelin-recognized vegetarian dining where Buddhist-inspired cooking creates meals that nourish both body and spirit."
    },
    {
      "name": "Cô Chủ Nhỏ",
      "coord": [
        10.808447,
        106.716719
      ],
      "desc": "Silky rice porridge, pork & ginger, morning nourishment",
      "longDesc": "Michelin-approved casual comfort where home-style Vietnamese cooking and genuine hospitality create neighborhood-favorite atmosphere."
    },
    {
      "name": "Shamballa",
      "coord": [
        16.075616,
        108.229039
      ],
      "desc": "Crab specialty, whole crustacean, seafood excellence",
      "longDesc": "Michelin recognized this vegetarian Vietnamese spot for creative plant-based interpretations of traditional flavors with genuine care."
    },
    {
      "name": "Miến Lươn Chân Cầm (Hoan Kiem)",
      "coord": [
        22.484016,
        105.621654
      ],
      "desc": "Turtle specialty, ancient tradition, sustainable sourcing",
      "longDesc": "Michelin-picked eel vermicelli where Hanoi's classic dish comes with tender meat and aromatic broth worthy of pilgrimage."
    },
    {
      "name": "Hà Thành Mansion",
      "coord": [
        14.708374,
        107.691589
      ],
      "desc": "Coastal seafood, grilled fresh catch, limestone backdrop",
      "longDesc": "Michelin-recognized where elegant setting meets Vietnamese sophistication in fine-dining interpretation of regional specialties."
    },
    {
      "name": "Quê Xưa",
      "coord": [
        17.91667,
        106.36667
      ],
      "desc": "Fish sauce essence, shrimp & squid, coastal treasure",
      "longDesc": "Michelin approved rustic Vietnamese where countryside simplicity and ingredient quality prove that soul-food cooking transcends settings."
    },
    {
      "name": "Bún Bò Bà Rơi (Hai Chau)",
      "coord": [
        16.051,
        107.0755
      ],
      "desc": "Street food institution, authentic flavors, local gathering",
      "longDesc": "Michelin-picked spiced beef vermicelli where central Vietnamese heat and complexity reward adventurous palates."
    },
    {
      "name": "Bé Ni 2",
      "coord": [
        16.066791,
        108.244952
      ],
      "desc": "Bib Gourmand (MICHELIN Guide) — inspectors’ pick for quality/value; Seafood",
      "longDesc": "Michelin-recognized casual spot where consistent quality Vietnamese standards and fair prices make it neighborhood favorite."
    },
    {
      "name": "Bún Bò Huế 14B",
      "coord": [
        11.958096,
        108.442667
      ],
      "desc": "Vietnamese coffee ritual, dark roast, condensed milk swirl",
      "longDesc": "Michelin-approved specialty where the imperial-city spiced beef broth comes with authentic depth and generous meat."
    },
    {
      "name": "Phở Gà Nguyệt",
      "coord": [
        20.906897,
        105.822608
      ],
      "desc": "Pho restaurant, fragrant spice, traditional comfort",
      "longDesc": "Michelin recognized chicken pho where silky broth and quality poultry create a lighter alternative with full flavor."
    },
    {
      "name": "Bánh Xèo Tôm Nhảy Năm Hiền (Phan Thanh St.)",
      "coord": [
        16.05988,
        108.209281
      ],
      "desc": "Wonton specialty, delicate folds, broth perfection",
      "longDesc": "Michelin-picked where jumping shrimp and griddle mastery celebrate Saigon street-food technique at its finest."
    },
    {
      "name": "Vị Quê Kitchen",
      "coord": [
        10.7809,
        106.7109
      ],
      "desc": "Beef pho tradition, silky noodles, umami-rich broth",
      "longDesc": "Michelin-recognized countryside Vietnamese where rustic cooking and ingredient authenticity create soulful, honest meals."
    },
    {
      "name": "1946 Cua Bac",
      "coord": [
        21.165755,
        106.138152
      ],
      "desc": "Duck perfection, five-spice roast, cantonese technique",
      "longDesc": "Michelin-approved crab specialist where seafood quality and preparation technique shine in classic Vietnamese crab preparations."
    },
    {
      "name": "Tuyết Bún Chả 34",
      "coord": [
        21.0345,
        105.8622
      ],
      "desc": "Market-sourced cooking, traditional technique, neighborhood gem",
      "longDesc": "Michelin recognized charred pork specialty where generations have perfected the griddle technique and flavor balance."
    },
    {
      "name": "Bếp Mẹ ỉn (Le Thanh Ton St.)",
      "coord": [
        10.773905,
        106.698187
      ],
      "desc": "Beef tartare tradition, herb-wrapped, daring raw cuisine",
      "longDesc": "Michelin-picked where mom's-cooking authenticity and warm hospitality create dining that feels like family gathering."
    },
    {
      "name": "Phở Bò Ấu Triệu",
      "coord": [
        16.88333,
        107.2
      ],
      "desc": "Authentic pho culture, beef or chicken, steaming perfection",
      "longDesc": "Michelin-approved beef pho where the careful broth simmering and premium meat selection deliver bowl of pure comfort."
    },
    {
      "name": "Hồng Phát (District 3)",
      "coord": [
        10.7849,
        106.6969
      ],
      "desc": "Buddhist temple cuisine, seasonal vegetables, mindful cooking",
      "longDesc": "Michelin-recognized where reliable Vietnamese standards and consistent quality keep locals coming back."
    },
    {
      "name": "Habakuk",
      "coord": [
        21.0345,
        105.8642
      ],
      "desc": "Bib Gourmand (MICHELIN Guide) — inspectors’ pick for quality/value; European Conte...",
      "longDesc": "Michelin-picked this casual spot for its inventive Vietnamese dishes that balance innovation with respectful tradition."
    },
    {
      "name": "Luk Lak",
      "coord": [
        13.011821,
        108.062139
      ],
      "desc": "Grilled meats, charcoal flame, skewer artistry",
      "longDesc": "Michelin-recognized shaking beef where the wok technique and ingredient quality celebrate Vietnam's most theatrical street meal."
    },
    {
      "name": "Tiệm Cơm Thố Chuyên Ký",
      "coord": [
        10.7869,
        106.6969
      ],
      "desc": "Bib Gourmand (MICHELIN Guide) — inspectors’ pick for quality/value; Cantonese",
      "longDesc": "Michelin-approved rice-bowl specialty where each component is prepared with care creating satisfying complete meals."
    },
    {
      "name": "Mr Bảy Miền Tây",
      "coord": [
        21.032056,
        105.846906
      ],
      "desc": "Broken rice classic, charred chicken, southern comfort",
      "longDesc": "Michelin-recognized where southern Vietnamese flavors and ingredient abundance create bold, generous cooking."
    },
    {
      "name": "Phú Hồng",
      "coord": [
        20.956904,
        107.08601
      ],
      "desc": "Vietnamese pho specialty, 30-year legacy, tourist icon",
      "longDesc": "Michelin-approved reliable spot where Vietnamese standards consistently deliver authentic taste and value."
    },
    {
      "name": "Rang",
      "coord": [
        22.86667,
        106.43333
      ],
      "desc": "Hue imperial noodle soup, palace recipes, spiced perfection",
      "longDesc": "Michelin-picked where innovative techniques respect Vietnamese foundations creating thoughtful contemporary cooking."
    },
    {
      "name": "Mỳ Quảng Sứa Hồng Vân",
      "coord": [
        16.066123,
        108.229693
      ],
      "desc": "Noodle mastery, hand-pulled craft, regional variety",
      "longDesc": "Michelin-recognized quang noodle specialty where the turmeric broth and fresh toppings celebrate central Vietnamese tradition."
    },
    {
      "name": "Indian Aroma",
      "coord": [
        16.0475,
        107.082
      ],
      "desc": "Hue regional specialty, pork & beef, Perfume River heritage",
      "longDesc": "Michelin-picked this Indian specialist where fragrant spices and skillful preparation create warmth and satisfaction."
    },
    {
      "name": "Mậu Dịch Số 37",
      "coord": [
        21.0365,
        105.8522
      ],
      "desc": "Fried spring rolls, golden crispy, market snack legend",
      "longDesc": "Michelin-recognized casual Vietnamese where ingredient quality and preparation technique shine through simple preparations."
    },
    {
      "name": "Xới Cơm",
      "coord": [
        10.847545,
        106.768604
      ],
      "desc": "Broken rice with grilled meat, southern Vietnamese classic",
      "longDesc": "Michelin-approved rice-specialty where each dish starts from rice foundation creating satisfying Vietnamese comfort."
    },
    {
      "name": "Phở Minh",
      "coord": [
        10.775525,
        106.702105
      ],
      "desc": "MICHELIN Bib Gourmand, inspectors' choice, best bargain",
      "longDesc": "Michelin-picked reliable pho where consistent broth quality and honest preparation serve customers daily."
    },
    {
      "name": "Phở Hoàng (Nguyen Tri Phuong St.)",
      "coord": [
        21.049371,
        105.784289
      ],
      "desc": "MICHELIN Guide featured, exceptional cooking, price point",
      "longDesc": "Michelin-approved beef pho where careful simmering and quality meat create deeply satisfying bowls."
    },
    {
      "name": "Cơm Tấm Ba Ghiền",
      "coord": [
        10.7729,
        106.6929
      ],
      "desc": "Saigon rice bowl, local favorite, affordable comfort",
      "longDesc": "Michelin-recognized broken-rice specialty where the crusty rice and flavorful toppings create addictive Vietnamese comfort."
    },
    {
      "name": "Hum Garden",
      "coord": [
        10.804141,
        106.744146
      ],
      "desc": "Banh mi fusion, colonial bread legacy, street icon",
      "longDesc": "Michelin-picked where garden setting and vegetable focus create fresh, light Vietnamese meals with ingredient integrity."
    },
    {
      "name": "Chả Cá Thăng Long (6B Duong Thanh St.)",
      "coord": [
        21.032965,
        105.846123
      ],
      "desc": "Cha gio spring rolls, crispy golden, market staple",
      "longDesc": "Michelin-approved fish-cake specialty where Hanoi's signature dish comes from hands that have perfected the technique."
    },
    {
      "name": "Cục Gạch Quán",
      "coord": [
        10.793,
        106.68893
      ],
      "desc": "Pho noodle art, hand-cut meat, sunrise service",
      "longDesc": "Michelin-recognized where rustic brick-walled setting matches honest Vietnamese cooking with neighborhood warmth."
    },
    {
      "name": "Phở Chào",
      "coord": [
        10.7749,
        106.6949
      ],
      "desc": "Northern-style pho, sunrise tradition, family recipe",
      "longDesc": "Michelin-approved pho where the balanced broth and quality preparations represent Hanoi tradition at its finest."
    },
    {
      "name": "Phở 10 Lý Quốc Sư (Hoan Kiem)",
      "coord": [
        21.030472,
        105.848847
      ],
      "desc": "Pho restaurant, fragrant spice, traditional comfort bowl",
      "longDesc": "Michelin-picked central-location pho where the convenient location doesn't compromise quality or authentic preparation."
    },
    {
      "name": "Sol Kitchen & Bar (District 1)",
      "coord": [
        10.7449,
        106.7329
      ],
      "desc": "Bib Gourmand (MICHELIN Guide) — inspectors’ pick for quality/value; Latin American",
      "longDesc": "Michelin-recognized where modern Vietnamese cooking and wine pairing create sophisticated dining experience."
    },
    {
      "name": "Bún Bò Nam Bộ Bách Phương",
      "coord": [
        21.0321585,
        105.8469112
      ],
      "desc": "Bun cha, grilled pork, Hanoi street tradition",
      "longDesc": "This beloved southern Vietnamese spiced beef vermicelli spot draws crowds for its fiery broth and generous meat portions."
    },
    {
      "name": "Cafe Giảng",
      "coord": [
        21.0334664,
        105.854518
      ],
      "desc": "Vietnamese-French sandwich, pickled veggies, crusty heritage",
      "longDesc": "Hanoi's most famous egg-coffee café where the sweet, frothy novelty and charming Old Quarter location create Instagram-worthy mornings."
    },
    {
      "name": "Bún chả Hương Liên",
      "coord": [
        21.0181373,
        105.8538926
      ],
      "desc": "Mekong Delta specialty, family recipe, river tradition",
      "longDesc": "This Hanoi legend perfects charred pork cakes and vermicelli where the herbal broth and dipping ritual feel like pure tradition."
    }
  ],
  "experiences": [
    {
      "name": "Vietage Scenic Train (Da Nang ↔ Quy Nhon)",
      "coord": [
        16.068,
        108.212
      ],
      "desc": "Old-world luxury carriage with à la carte dining and spa-style touches; Couples; f...",
      "longDesc": "Old-world luxury carriage with fine dining creates a journey where coastal scenery unfolds from your cabin as slowly as a movie reel."
    },
    {
      "name": "Hanoi Street Eats After Dark (guided)",
      "coord": [
        21.0275,
        105.8512
      ],
      "desc": "Evening street-food crawl through Old Quarter classics; Foodies; first-timers",
      "longDesc": "Evening street-food crawl through Old Quarter classics transforms dark alleys into a sensory adventure where vendors and locals tell stories between bites."
    },
    {
      "name": "Hidden Hanoi by Cyclo & Vintage Vespa",
      "coord": [
        21.033,
        105.85
      ],
      "desc": "Slow cyclo + Vespa route through hidden lanes and landmarks; Families; culture lovers",
      "longDesc": "Slow cyclo rides combined with vintage Vespa jaunts reveal hidden temples, artisan workshops, and neighborhood spots tourists never discover."
    },
    {
      "name": "Thăng Long Water Puppet Show",
      "coord": [
        13.051505,
        109.346901
      ],
      "desc": "Traditional Northern Vietnamese water puppetry; Families; all ages",
      "longDesc": "Traditional Northern Vietnamese water puppetry brings folk tales and mythical legends to life through wooden puppet performances set to ancient music."
    },
    {
      "name": "Saigon Street Food Tour by Vespa",
      "coord": [
        10.759,
        106.698
      ],
      "desc": "Back-of-Vespa bites across districts after dark; Foodies; groups",
      "longDesc": "Back-of-Vespa bites across Ho Chi Minh City districts after dark capture the city's soul through sizzling street vendors and hidden local gems."
    },
    {
      "name": "Four Seasons Nam Hai Cooking Academy",
      "coord": [
        15.9045,
        108.2565
      ],
      "desc": "Hands-on Vietnamese cooking with resort chefs; Families; foodies",
      "longDesc": "Hands-on Vietnamese cooking with resort chefs teaches technique and regional specialties in a stunning beachfront kitchen setting."
    },
    {
      "name": "Hoi An Countryside Adventure on Vintage Vespas",
      "coord": [
        15.878,
        108.321
      ],
      "desc": "Ride rural lanes, crafts villages and Cam Kim Island, plus riverside lunch; Famili...",
      "longDesc": "Vintage Vespa rides through rural villages and craft areas reveal quiet rice paddies, traditional artisans, and authentic Hoi An surroundings."
    },
    {
      "name": "Hoi An Street Food with a Local Expert",
      "coord": [
        15.8795,
        108.32
      ],
      "desc": "Beyond-Old-Town food walk with insider stops; Foodies",
      "longDesc": "Beyond Old Town walking with insider stops reveals where Hoi An locals actually eat and how regional specialties differ from tourist versions."
    },
    {
      "name": "A Day in Cái Bè (Mekong Delta)",
      "coord": [
        10.258,
        105.785
      ],
      "desc": "Waterways, orchards, local industries and a traditional-house lunch; Families; cul...",
      "longDesc": "Waterways, fruit orchards, and traditional-house visits create genuine immersion in Mekong rhythm and agricultural heritage."
    },
    {
      "name": "Hanoi Evening Vespa Tour + Live Jazz",
      "coord": [
        21.0205,
        105.8565
      ],
      "desc": "Night ride, street eats, finish at a jazz club; Couples; music lovers",
      "longDesc": "Night ride through atmospheric streets leads to hidden jazz clubs where live music and street-food stops celebrate Hanoi's sophisticated side."
    },
    {
      "name": "Old Quarter walking loop + Hoàn Kiếm Lake",
      "coord": [
        21.0312,
        105.8485
      ],
      "desc": "Easy stroll for street life, temples, cafés and lake views; First-timers; families",
      "longDesc": "Easy stroll through 1,000-year-old streets reveals temples, hidden courtyards, and lakeside gardens that anchor Hanoi's spiritual heart."
    },
    {
      "name": "Temple of Literature (Văn Miếu)",
      "coord": [
        21.02879,
        105.835953
      ],
      "desc": "Vietnam’s historic university complex and courtyards; History buffs; families",
      "longDesc": "Vietnam's historic 1070 university complex preserves scholarly traditions in peaceful walled gardens where ancient cypress trees inspire reflection."
    },
    {
      "name": "Hỏa Lò Prison (\"Hanoi Hilton\")",
      "coord": [
        21.025422,
        105.846509
      ],
      "desc": "Thought-provoking museum on colonial-era prison history; History buffs",
      "longDesc": "Thought-provoking museum in colonial-era prison reveals Vietnam's revolutionary history through preserved cells and personal testimonies."
    },
    {
      "name": "Ho Chi Minh Mausoleum complex",
      "coord": [
        21.03652,
        105.83486
      ],
      "desc": "Iconic site with strict etiquette; pair with nearby sights; History buffs; familie...",
      "longDesc": "Solemn pilgrimage site honoring Vietnam's founder offers insight into national reverence and modern history through formal ceremonial architecture."
    },
    {
      "name": "Vietnam Museum of Ethnology",
      "coord": [
        21.040077,
        105.79884
      ],
      "desc": "Great for kids: outdoor traditional houses + exhibits; Families; culture lovers",
      "longDesc": "Outdoor traditional houses and interactive exhibits celebrate Vietnam's 54 ethnic groups in a family-friendly setting with beautiful gardens."
    },
    {
      "name": "West Lake (Tây Hồ) cycling at sunset",
      "coord": [
        21.0867,
        105.8239
      ],
      "desc": "Flat loop, cafés, and calm water views; Families; active travelers",
      "longDesc": "Flat lakeside loop past cafés and temples creates peaceful evening where Hanoi's locals gather for movement and sunset reflection."
    },
    {
      "name": "Egg coffee + café crawl",
      "coord": [
        12.238983,
        109.190562
      ],
      "desc": "Sample Hanoi’s signature coffee culture; Foodies",
      "longDesc": "Hanoi's signature coffee culture unfolds through charming cafés where the creamy egg-yolk topping became legendary post-WWII."
    },
    {
      "name": "Daytime cyclo ride (short)",
      "coord": [
        21.031,
        105.8495
      ],
      "desc": "Gentle intro to the Old Quarter—good for toddlers with shade; Families; easy pace",
      "longDesc": "Gentle three-wheeled exploration of Old Quarter streets offers shade and intimacy perfect for first-time visitors and young travelers."
    },
    {
      "name": "Tràng An scenic boat ride",
      "coord": [
        20.4225,
        105.8525
      ],
      "desc": "Rowboat through karst landscapes and caves; Families; photographers",
      "longDesc": "Rowboat through dramatic karst landscapes and cave passages reveals nature's sculpture garden with limestone cliffs rising from water."
    },
    {
      "name": "Tam Cốc sampan ride",
      "coord": [
        20.2215,
        105.8835
      ],
      "desc": "Rice paddies + limestone cliffs from the river; Families; couples",
      "longDesc": "Rice paddies meeting limestone cliffs create 'Halong Bay of the north' experience accessible without overnight cruise commitment."
    },
    {
      "name": "Hang Múa viewpoint climb",
      "coord": [
        20.2385,
        105.8755
      ],
      "desc": "Short steep climb to signature panorama; Active travelers",
      "longDesc": "Steep but manageable climb rewards with signature panorama where rice fields stretch to horizons and limestone peaks pierce clouds."
    },
    {
      "name": "Countryside cycling between karsts",
      "coord": [
        20.4165,
        105.8475
      ],
      "desc": "Easy rural biking, villages and paddies; Families (older kids); active",
      "longDesc": "Easy rural biking past villages and paddies offers intimate encounters with farmers and glimpses of pre-tourism Vietnam."
    },
    {
      "name": "Luxury overnight cruise in Ha Long Bay",
      "coord": [
        20.9101,
        107.1839
      ],
      "desc": "Classic limestone seascape—sunrise, caves, kayaking; Couples; families",
      "longDesc": "Classic UNESCO limestone seascape unfolds through sunrise kayaking, cave exploration, and moonlit deck moments of pure wonder."
    },
    {
      "name": "Lan Ha Bay cruise (quieter alternative)",
      "coord": [
        15.556973,
        108.502023
      ],
      "desc": "Softer crowds; kayaking and beaches near Cat Ba; Couples; families",
      "longDesc": "Softer crowds and pristine waters near Cat Ba reveal that exploration can be both adventurous and peaceful."
    },
    {
      "name": "Kayak among karsts and lagoons",
      "coord": [
        20.9121,
        107.1839
      ],
      "desc": "Close-up exploration of caves and coves; Families (older kids); active",
      "longDesc": "Close-up exploration through hidden caves and turquoise lagoons creates intimate access to Halong's geology and protected ecosystems."
    },
    {
      "name": "Cat Ba Island hike",
      "coord": [
        20.72,
        107.03
      ],
      "desc": "Jungle trails and viewpoints above the bay; Active travelers",
      "longDesc": "Jungle trails and viewpoints above the bay deliver adventure and solitude where fewer tourists venture into karst wilderness."
    },
    {
      "name": "Imperial City (Citadel)",
      "coord": [
        16.4637,
        107.5909
      ],
      "desc": "Nguyễn-era palace complex and gates; History buffs; families",
      "longDesc": "Nguyễn-era palace complex and gates preserve Vietnam's royal architecture in weathered grandeur that speaks of centuries of power."
    },
    {
      "name": "Royal tombs by private car/boat",
      "coord": [
        16.342,
        107.619
      ],
      "desc": "Atmospheric tombs set in gardens and hills; History buffs; photographers",
      "longDesc": "Atmospheric tomb complexes set in gardens and hills honor Vietnam's emperors through art, architecture, and historical atmosphere."
    },
    {
      "name": "Perfume River dragon-boat cruise (short)",
      "coord": [
        16.459,
        107.587
      ],
      "desc": "Low-effort way to see river life and temples; Families",
      "longDesc": "Gentle water journey reveals riverside temples, local fishing, and water-village life without demanding time or endurance."
    },
    {
      "name": "Thien Mu Pagoda",
      "coord": [
        16.45242,
        107.54504
      ],
      "desc": "Riverside pagoda and gardens; Families; culture lovers",
      "longDesc": "Riverside pagoda and gardens combine spiritual atmosphere with Perfume River views creating peaceful cultural moment."
    },
    {
      "name": "Hoi An Ancient Town at dusk",
      "coord": [
        15.8801,
        108.3189
      ],
      "desc": "Lantern-lit lanes; riverside cafés; easy stroll; Couples; families",
      "longDesc": "Lantern-lit lanes and riverside cafés transform the UNESCO old town into storybook setting as sunset light creates magical photography."
    },
    {
      "name": "Lantern-making workshop",
      "coord": [
        15.888604,
        108.330045
      ],
      "desc": "Hands-on, packable souvenir; great rainy-day activity; Families; all ages",
      "longDesc": "Hands-on craft class teaches the silk-lantern tradition where participants create take-home souvenirs connecting personally to town's signature art."
    },
    {
      "name": "Tailor-made clothing fitting",
      "coord": [
        15.881,
        108.3195
      ],
      "desc": "Fast, custom tailoring—plan time for fittings; Style lovers",
      "longDesc": "Vietnam's renowned tailors craft custom pieces in days, offering families chance to leave with bespoke souvenirs that fit perfectly."
    },
    {
      "name": "Tra Que Vegetable Village by bike",
      "coord": [
        15.895,
        108.3015
      ],
      "desc": "Cycle and meet farmers; simple, hands-on activities; Families; foodies",
      "longDesc": "Cycling to working farms lets travelers meet farmers, learn growing techniques, and understand rural Hoi An's agricultural foundation."
    },
    {
      "name": "Cam Thanh coconut forest basket boat ride",
      "coord": [
        15.862,
        108.345
      ],
      "desc": "Fun circular boats through palms; splashy and short; Families",
      "longDesc": "Fun circular boats through mangrove palms create splashy adventure perfect for kids wanting water fun without technical difficulty."
    },
    {
      "name": "An Bang Beach day",
      "coord": [
        15.915667,
        108.336874
      ],
      "desc": "Easy beach reset between sightseeing; Families; downtime",
      "longDesc": "Easy beach reset between sightseeing offers sand, swim, and beach shacks serving fresh seafood and cold beer."
    },
    {
      "name": "Marble Mountains",
      "coord": [
        16.003907,
        108.266031
      ],
      "desc": "Caves, pagodas, viewpoints (stairs involved); Families (older kids)",
      "longDesc": "Five limestone peaks riddled with caves and pagodas offer cultural sites and viewpoints accessible via manageable climbs."
    },
    {
      "name": "Bà Nà Hills + Golden Bridge",
      "coord": [
        15.987,
        107.973
      ],
      "desc": "Iconic 'giant hands' bridge and mountain park; Families; photographers",
      "longDesc": "Iconic 'giant hands' bridge and mountain park deliver Instagram-worthy moments and cool mountain air escape."
    },
    {
      "name": "Son Tra Peninsula (Lady Buddha)",
      "coord": [
        15.382466,
        108.78253
      ],
      "desc": "Coastal views and pagoda stop; Families",
      "longDesc": "Coastal mountain setting with massive Buddha statue and temple creates spiritual moment overlooking Da Nang and the South China Sea."
    },
    {
      "name": "War Remnants Museum",
      "coord": [
        10.779365,
        106.692281
      ],
      "desc": "Powerful modern-history museum; allow decompression time; History buffs",
      "longDesc": "Powerful modern-history museum requires emotional preparation but provides essential context for understanding Vietnam's recent past."
    },
    {
      "name": "Reunification Palace",
      "coord": [
        10.777035,
        106.695488
      ],
      "desc": "Key Vietnam War-era site; quick, easy visit; Families; history buffs",
      "longDesc": "Key Vietnam War-era site frozen in time preserves 1960s décor and architecture offering glimpse into final days of South Vietnam."
    },
    {
      "name": "Central Post Office + colonial landmarks",
      "coord": [
        10.77991,
        106.69999
      ],
      "desc": "French-era architecture cluster in District 1; First-timers",
      "longDesc": "French-era architecture cluster in District 1 celebrates colonial heritage through elegant buildings and downtown streetscape."
    },
    {
      "name": "Nguyễn Huệ walking street at night",
      "coord": [
        10.7885,
        106.6898
      ],
      "desc": "Light, safe-feeling evening stroll with people-watching; Families",
      "longDesc": "Safe, lively evening promenade buzzes with people-watching, street vendors, and Ho Chi Minh City energy at pedestrian-friendly pace."
    },
    {
      "name": "Chợ Lớn (Chinatown) temples",
      "coord": [
        10.7645,
        106.671
      ],
      "desc": "Temples, markets, food—great with a guide; Families (older kids)",
      "longDesc": "Temples, markets, and food create sensory overload perfect with guide who navigates history and cultural nuances of district."
    },
    {
      "name": "Rooftop cocktail (choose family-friendly early hour)",
      "coord": [
        10.776,
        106.705
      ],
      "desc": "Skyline views—go at sunset before late crowds; Couples; parents’ date night",
      "longDesc": "Skyline views from sunset hour drinks celebrate Ho Chi Minh City's evening transformation into glittering lights."
    },
    {
      "name": "Saigon river sunset cruise (short)",
      "coord": [
        10.775381,
        106.704711
      ],
      "desc": "Low-effort sightseeing from the water; Families",
      "longDesc": "Low-effort sightseeing from water captures temples, bridges, and city silhouettes against dramatic sunset backdrop."
    },
    {
      "name": "Cu Chi Tunnels day trip (by private car)",
      "coord": [
        11.0476,
        106.3997
      ],
      "desc": "Famous wartime tunnels; choose shorter routes; Older kids/teens; history buffs",
      "longDesc": "Famous wartime tunnel complex tells story through preserved sites, choosing routes manageable for families and older children."
    },
    {
      "name": "Coffee workshop / tasting flight",
      "coord": [
        10.7705,
        106.7015
      ],
      "desc": "Vietnam’s coffee culture beyond egg coffee; Foodies",
      "longDesc": "Vietnam's coffee culture expands beyond egg coffee through bean education and comparison tasting with expert guides."
    },
    {
      "name": "Cái Răng floating market at sunrise",
      "coord": [
        10.0379,
        105.787
      ],
      "desc": "Boat ride among wholesale sellers and breakfast boats; Families; photographers",
      "longDesc": "Boat ride among wholesale merchants and breakfast vendors captures timeless Mekong commerce in early-morning golden light."
    },
    {
      "name": "Sampan through narrow canals",
      "coord": [
        16.0,
        107.0
      ],
      "desc": "Quiet backwaters, palms, village life; Families",
      "longDesc": "Quiet backwater paddling past palm-lined banks reveals village life and agricultural rhythms undisturbed by main waterways."
    },
    {
      "name": "Fruit orchards + tasting",
      "coord": [
        20.991232,
        106.057552
      ],
      "desc": "Seasonal tropical fruit tasting with local hosts; Families",
      "longDesc": "Seasonal tropical fruit tasting directly from trees connects travelers to Mekong's agricultural abundance with flavors never found in markets."
    },
    {
      "name": "Bike small islands between ferries",
      "coord": [
        10.3045,
        105.818
      ],
      "desc": "Flat routes through villages and rice fields; Active families",
      "longDesc": "Flat routes through villages and rice fields offer gentle pedaling where encounters with locals reveal island rhythms."
    },
    {
      "name": "Sapa rice-terrace trek with local guide",
      "coord": [
        22.3402,
        103.8443
      ],
      "desc": "Classic highland trek + minority villages; Active travelers; older kids",
      "longDesc": "Classic highland trek through cascading rice paddies and minority villages delivers landscape beauty paired with cultural respect."
    },
    {
      "name": "Overnight village homestay (curated)",
      "coord": [
        20.41,
        105.856
      ],
      "desc": "Meaningful cultural exchange—go via vetted operators; Families (older kids); cultu...",
      "longDesc": "Vetted homestays create meaningful exchanges where families sleep in minority villages and share meals with host families."
    },
    {
      "name": "Fansipan cable car (weather permitting)",
      "coord": [
        22.3422,
        103.8443
      ],
      "desc": "Big views with minimal effort; pack layers; Families",
      "longDesc": "Dramatic rides to Vietnam's highest peak deliver big views with minimal effort and layered clothing for cooler temperatures."
    },
    {
      "name": "Highland market visit (timing-dependent)",
      "coord": [
        20.972666,
        105.81189
      ],
      "desc": "Textiles and crafts (check weekly schedule); Families; shoppers",
      "longDesc": "Textiles and crafts at weekly highland markets reveal indigenous artistry and trade practices unchanged for generations."
    },
    {
      "name": "Ha Giang Loop (driver-led, curated)",
      "coord": [
        11.540046,
        107.823036
      ],
      "desc": "Epic mountain roads—best with private driver for comfort; Adventure travelers",
      "longDesc": "Epic mountain roads through remote regions demand private driver comfort but reward adventurers with raw geology and untouched views."
    },
    {
      "name": "Phong Nha-Kẻ Bàng cave boat tour",
      "coord": [
        20.573,
        105.3385
      ],
      "desc": "Underground rivers and cave chambers; Families (older kids)",
      "longDesc": "Underground rivers and dramatic cave chambers reveal formations shaped over millennia accessible through gentle boat exploration."
    },
    {
      "name": "Paradise Cave walk",
      "coord": [
        20.579,
        105.3465
      ],
      "desc": "Easy boardwalk through huge stalactite chambers; Families",
      "longDesc": "Easy boardwalk through massive stalactite chambers creates accessible cave experience where geology speaks for itself."
    },
    {
      "name": "Son Doong expedition (limited permits)",
      "coord": [
        21.28413,
        103.837169
      ],
      "desc": "World’s largest cave—bucket-list multi-day trek; Hardcore adventurers",
      "longDesc": "World's largest cave demands multi-day expedition but rewards hardcore adventurers with bucket-list underground journey of magnitude."
    },
    {
      "name": "Phu Quoc beach day + resort pool time",
      "coord": [
        10.1858,
        103.9899
      ],
      "desc": "Easy tropical reset; pick calmer beaches; Families; downtime",
      "longDesc": "Easy tropical reset on calm beaches combined with resort pools creates uncomplicated family day of simple pleasures."
    },
    {
      "name": "Hon Thom cable car (Phu Quoc)",
      "coord": [
        9.992031,
        104.012439
      ],
      "desc": "Long sea cable car—great with kids who like rides; Families",
      "longDesc": "Long sea cable car descending to island peaks delivers thrilling ride and views rewarding even cable-car-nervous travelers."
    },
    {
      "name": "Island-hopping snorkel day (private boat)",
      "coord": [
        10.526686,
        108.949211
      ],
      "desc": "Snorkeling + beach stops—go private for flexibility; Families (older kids)",
      "longDesc": "Private boat flexibility lets families snorkel at calm reefs and beach-hop without rigid group-tour timing."
    },
    {
      "name": "Con Dao nature & beaches",
      "coord": [
        8.6908,
        106.585
      ],
      "desc": "Remote islands for quiet beaches and nature focus; Couples; nature lovers",
      "longDesc": "Remote archipelago delivers quiet beaches and nature focus perfect for couples seeking escape from touristy rhythms."
    },
    {
      "name": "Dalat coffee farm tasting",
      "coord": [
        11.942,
        108.4405
      ],
      "desc": "Highland coffee culture and tastings; Foodies",
      "longDesc": "Highland coffee culture reveals growing practices and bean characteristics through education and tasting sessions."
    },
    {
      "name": "Dalat waterfalls day (easy loop)",
      "coord": [
        11.9115,
        108.4535
      ],
      "desc": "Short scenic stops and forest air; Families",
      "longDesc": "Short scenic stops through forest air and cascading water create gentle day with photogenic moments."
    },
    {
      "name": "Amanoi water sports (kayak/catamaran/snorkel)",
      "coord": [
        15.9065,
        108.2565
      ],
      "desc": "Signature Amanoi bay exploration options; Families; couples",
      "longDesc": "Resort-led bay exploration through multiple water activities lets families discover coastal features at their own pace."
    },
    {
      "name": "Wellness retreat programming (TIA / Amanoi / Nam Hai)",
      "coord": [
        15.9045,
        108.2585
      ],
      "desc": "Spa-led schedules, yoga/meditation and cultural workshops; Parents; couples",
      "longDesc": "Spa-led schedules combining yoga, meditation, and cultural workshops create holistic rejuvenation beyond beaches."
    },
    {
      "name": "Hanoi train street café stop (timing varies)",
      "coord": [
        21.0175,
        105.8665
      ],
      "desc": "Photo-worthy railside coffee—follow local rules; Adults; older kids",
      "longDesc": "Photo-worthy railway-side coffee ritual requires early mornings and respect for working trains but creates viral-worthy moment."
    },
    {
      "name": "French Quarter architecture wander",
      "coord": [
        11.936396,
        108.448316
      ],
      "desc": "Colonial-era avenues + cafes; Couples; photographers",
      "longDesc": "Colonial-era avenues lined with converted villas, boutiques, and cafés create European atmosphere in central Hanoi."
    },
    {
      "name": "Hanoi Fine Arts Museum",
      "coord": [
        21.0465,
        105.8285
      ],
      "desc": "Vietnamese art overview in a calm space; Art lovers; families (short visit)",
      "longDesc": "Vietnamese art overview in calm gallery space celebrates contemporary and traditional works appealing to art-loving families."
    },
    {
      "name": "Street photography session (private)",
      "coord": [
        21.009393,
        105.774389
      ],
      "desc": "Guided route to markets, lanes and lake light; Photographers",
      "longDesc": "Guided routes to markets, temples, and lake light reveal compositional opportunities and storytelling through trained photographer's eye."
    },
    {
      "name": "Cooking class in Hanoi (market-to-table)",
      "coord": [
        21.0295,
        105.8525
      ],
      "desc": "Shop a market then cook Northern dishes; Families; foodies",
      "longDesc": "Market shopping followed by Northern Vietnamese cooking lesson teaches techniques while building ingredients with guide."
    },
    {
      "name": "Bãi Đính Pagoda complex",
      "coord": [
        20.27672,
        105.8049
      ],
      "desc": "Grand pagoda complex—best early/late for heat; Families",
      "longDesc": "Grand pagoda complex requires early-morning or late-afternoon visits to avoid midday heat while exploring spiritual architecture."
    },
    {
      "name": "Bích Động Pagoda",
      "coord": [
        20.21722,
        105.9141
      ],
      "desc": "Cave pagoda and karst scenery; Families",
      "longDesc": "Cave pagoda setting amid karst scenery combines religious site with dramatic geography accessible via moderate climb."
    },
    {
      "name": "Luxury picnic in countryside (curated)",
      "coord": [
        16.002,
        107.0
      ],
      "desc": "Private set-up with views—operator arranged; Couples",
      "longDesc": "Private setup with curated views and refined food creates romantic escape to rural Vietnam with all comforts included."
    },
    {
      "name": "Hue royal cuisine tasting",
      "coord": [
        16.463,
        107.592
      ],
      "desc": "Sample imperial-style dishes with a guide; Foodies",
      "longDesc": "Imperial-style dishes prepared with guide's explanation reveal how emperors ate and celebrate ancient foodways."
    },
    {
      "name": "Hoi An sunrise fish market visit",
      "coord": [
        13.76587,
        109.224722
      ],
      "desc": "Early-morning market energy and river boats; Photographers",
      "longDesc": "Early morning market energy, boat activity, and vendor interactions create photographer's paradise and cultural education."
    },
    {
      "name": "My Son Sanctuary half-day trip",
      "coord": [
        15.755,
        108.181
      ],
      "desc": "Champa-era temple ruins; go early for heat; History buffs; families (older kids)",
      "longDesc": "Champa-era temple ruins deep in jungle create atmospheric archaeology experience inspiring imagination about ancient kingdoms."
    },
    {
      "name": "Da Nang Dragon Bridge weekend show",
      "coord": [
        16.065,
        107.188
      ],
      "desc": "Weekend fire/water show (schedule varies); Families",
      "longDesc": "Weekend fire-and-water spectacle transforms bridge into nocturnal display where families gather for free entertainment."
    }
  ],
  "kidFriendly": [
    {
      "name": "Thăng Long Water Puppet Show",
      "coord": [
        13.051505,
        109.346901
      ],
      "desc": "Short cultural show; easy seated entertainment; All ages (best 2+)",
      "longDesc": "Short cultural performance with whimsical puppets and traditional music enchants kids without demanding long attention spans."
    },
    {
      "name": "Cyclo ride (short loop)",
      "coord": [
        21.035,
        105.85
      ],
      "desc": "Low-effort sightseeing; choose quieter hours; 2+",
      "longDesc": "Low-effort three-wheeled sightseeing offers shade and novelty perfect for young legs that tire easily."
    },
    {
      "name": "Vietnam Museum of Ethnology",
      "coord": [
        21.040077,
        105.79884
      ],
      "desc": "Outdoor traditional houses + space to roam; All ages",
      "longDesc": "Outdoor traditional houses provide roaming space while exhibits celebrate Vietnam's diversity in kid-friendly interactive format."
    },
    {
      "name": "West Lake stroll + playground stop",
      "coord": [
        21.0887,
        105.8239
      ],
      "desc": "Flat lakeside walk; cafés nearby; All ages",
      "longDesc": "Flat lakeside walk past cafés and parks lets kids play safely while parents relax under shade trees."
    },
    {
      "name": "Tràng An boat ride",
      "coord": [
        20.25276,
        105.918466
      ],
      "desc": "Gentle rowboat through caves and karsts (bring hat/sunscreen); All ages",
      "longDesc": "Gentle rowboat through caves and karsts keeps young travelers engaged while parents enjoy scenery."
    },
    {
      "name": "Countryside cycling (child seat/trailer)",
      "coord": [
        20.4185,
        105.8475
      ],
      "desc": "Flat lanes and rice paddies; flexible pace; 2+",
      "longDesc": "Flat rice-paddy routes with flexible pace let kids pedal or ride while parents control the adventure."
    },
    {
      "name": "Hang Múa viewpoint (optional)",
      "coord": [
        20.2405,
        105.8755
      ],
      "desc": "Steep steps; great reward view for older kids; 8+",
      "longDesc": "Steep stairs challenge older kids with reward of dramatic karst panorama justifying the climb."
    },
    {
      "name": "Overnight cruise in Ha Long / Lan Ha Bay",
      "coord": [
        20.95359,
        107.04553
      ],
      "desc": "Boat-based adventure; swimming/kayaking for older kids; All ages (choose family ca...",
      "longDesc": "Boat accommodation, swimming, and kid-friendly kayaking create adventure without complex logistics."
    },
    {
      "name": "Kayaking in calm lagoons",
      "coord": [
        16.0,
        107.002
      ],
      "desc": "Great for adventurous kids; go guided and calm weather; 8+",
      "longDesc": "Guided paddling through protected waters lets adventurous kids explore without open-ocean hazards."
    },
    {
      "name": "Hoi An lantern-making workshop",
      "coord": [
        15.884,
        108.317
      ],
      "desc": "Hands-on craft + take-home souvenir; All ages",
      "longDesc": "Hands-on craft creates take-home souvenir connecting kids personally to town's signature tradition."
    },
    {
      "name": "Hoi An Ancient Town early evening stroll",
      "coord": [
        15.8821,
        108.3189
      ],
      "desc": "Lanterns and pedestrian-friendly lanes (go before bedtime crowds); All ages",
      "longDesc": "Lantern-lit pedestrian lanes and ice cream vendors create magical atmosphere before kids' bedtimes."
    },
    {
      "name": "Basket boat ride in coconut forest",
      "coord": [
        15.876144,
        108.373788
      ],
      "desc": "Fun, short, splashy ride; bring change of clothes; All ages (best 3+)",
      "longDesc": "Fun, short, splashy ride through mangrove palms delights kids, though bring change of clothes."
    },
    {
      "name": "Tra Que vegetable village (hands-on garden)",
      "coord": [
        15.90223,
        108.33884
      ],
      "desc": "Meet farmers; light activities; good with toddlers; All ages",
      "longDesc": "Meeting farmers and light garden activities engages toddlers and young kids with tactile learning."
    },
    {
      "name": "An Bang Beach day",
      "coord": [
        15.915667,
        108.336874
      ],
      "desc": "Easy sandy beach; shade + snacks; All ages",
      "longDesc": "Easy sandy beach with shade, snacks, and shallow water creates uncomplicated family swim day."
    },
    {
      "name": "Bà Nà Hills & Golden Bridge",
      "coord": [
        15.989,
        107.973
      ],
      "desc": "Cable car, cool air; iconic bridge photos; All ages",
      "longDesc": "Cable car, cool mountain air, and iconic bridge photos deliver family-friendly cool-off escape."
    },
    {
      "name": "Marble Mountains (short route)",
      "coord": [
        16.002972,
        108.263667
      ],
      "desc": "Stairs/caves; choose easier paths; 6+",
      "longDesc": "Caves and pagodas with stairs require careful kids but creative older children love exploration."
    },
    {
      "name": "Dragon Bridge weekend show",
      "coord": [
        16.0491,
        107.0863
      ],
      "desc": "Fun spectacle; arrive early for a spot; All ages",
      "longDesc": "Fun weekend spectacle where families arrive early for viewing spots and shared evening entertainment."
    },
    {
      "name": "Saigon Street Food Tour by Vespa (early family version)",
      "coord": [
        10.761,
        106.698
      ],
      "desc": "Older kids love the ride; younger kids: do a shorter private tour; 8+ (or parents ...",
      "longDesc": "Older kids love the ride novelty while younger ones do shorter private versions for manageable portions."
    },
    {
      "name": "Nguyễn Huệ walking street",
      "coord": [
        10.77372,
        106.704046
      ],
      "desc": "Evening promenade; lots of people-watching; All ages",
      "longDesc": "Evening promenade offers safe people-watching and street performers entertaining crowds peacefully."
    },
    {
      "name": "Saigon river sunset cruise (short)",
      "coord": [
        10.775381,
        106.704711
      ],
      "desc": "Easy sightseeing without lots of walking; All ages",
      "longDesc": "Easy water sightseeing without demanding walking suits families wanting evening relaxation."
    },
    {
      "name": "Reunification Palace (quick visit)",
      "coord": [
        10.7983,
        106.689
      ],
      "desc": "Big rooms + tanks/grounds can keep kids engaged briefly; 6+",
      "longDesc": "Big rooms and military equipment hold kids' interest briefly for manageable cultural education."
    },
    {
      "name": "Cái Răng floating market sunrise boat",
      "coord": [
        10.332721,
        106.035395
      ],
      "desc": "Breakfast boats; lively river scene; All ages (early start)",
      "longDesc": "Breakfast boats and lively river scenes captivate kids while parents photograph commerce in action."
    },
    {
      "name": "Fruit orchard tasting stop",
      "coord": [
        9.992132,
        105.737121
      ],
      "desc": "Low-effort snack stop; seasonal fruits; All ages",
      "longDesc": "Low-effort snack stop where seasonal tropical fruits become taste adventure and culinary education."
    },
    {
      "name": "Phu Quoc beach & resort pool day",
      "coord": [
        10.15176,
        103.9779
      ],
      "desc": "Simplest kid win: sand + pool + early dinners; All ages",
      "longDesc": "Simple winning formula of sand, pool, early dinners, and beach resort amenities satisfies families."
    },
    {
      "name": "Hon Thom sea cable car (Phu Quoc)",
      "coord": [
        10.175,
        103.8075
      ],
      "desc": "Big views; fun 'ride' for kids; All ages",
      "longDesc": "Big views and thrilling 'ride' sensation delight kids while parents enjoy Phu Quoc's island beauty."
    },
    {
      "name": "Amanoi family-friendly activities (crafts, sports)",
      "coord": [
        16.002,
        107.002
      ],
      "desc": "Resort-led workshops and gentle water sports; All ages",
      "longDesc": "Resort-led workshops and gentle water sports cater to different ages with organized programming."
    },
    {
      "name": "Four Seasons Nam Hai cultural workshops",
      "coord": [
        15.8821,
        108.3209
      ],
      "desc": "Lanterns, cooking academy, crafts—great on hot afternoons; All ages",
      "longDesc": "Lantern-making, cooking academy, and crafts provide afternoon activities during hottest heat hours."
    }
  ],
  "markets": [
    {
      "name": "Đồng Xuân Market",
      "coord": [
        21.038052,
        105.849426
      ],
      "desc": "Big indoor market for clothing, souvenirs, snacks; Market",
      "longDesc": "Hanoi's oldest indoor market sprawls across floors selling silks, souvenirs, and street snacks in authentic Vietnam chaos."
    },
    {
      "name": "Hanoi Old Quarter Weekend Night Market",
      "coord": [
        21.038378,
        105.848614
      ],
      "desc": "Streetside shopping + snacks; lively weekend atmosphere; Night Market",
      "longDesc": "Streetside shopping and sizzling snacks transform the Old Quarter into lively weekend marketplace."
    },
    {
      "name": "Quảng Bá Flower Market",
      "coord": [
        21.065,
        105.821
      ],
      "desc": "Late-night/early-morning flowers; great photos; Flower Market",
      "longDesc": "Late-night and early-morning flower stalls burst with color and fragrance, perfect for photographers capturing market light."
    },
    {
      "name": "Long Biên Market",
      "coord": [
        21.043068,
        105.857897
      ],
      "desc": "Wholesale produce/flowers; very local; Wholesale Market",
      "longDesc": "Wholesale produce and flower market reveals where Hanoi's restaurants source daily ingredients in authentic local setting."
    },
    {
      "name": "Bến Thành Market",
      "coord": [
        10.77253,
        106.698037
      ],
      "desc": "Iconic central market; souvenirs + quick bites; Market",
      "longDesc": "Ho Chi Minh City's iconic central market with clock tower offers souvenirs, clothing, and quick bite stalls."
    },
    {
      "name": "Bình Tây Market",
      "coord": [
        10.749296,
        106.650728
      ],
      "desc": "Chinatown’s main market; herbs, textiles, dry goods; Market",
      "longDesc": "Chinatown's main market specializes in herbs, textiles, and dry goods revealing Vietnamese-Chinese culinary traditions."
    },
    {
      "name": "An Đông Market",
      "coord": [
        10.758108,
        106.672182
      ],
      "desc": "Fashion & fabrics; multi-story indoor market; Market",
      "longDesc": "Multi-story fashion and fabric market caters to tailors and shoppers seeking authentic textiles and garments."
    },
    {
      "name": "Hồ Thị Kỷ Flower Market",
      "coord": [
        10.765767,
        106.677272
      ],
      "desc": "Colorful flower stalls + nearby street-food lanes; Flower Market",
      "longDesc": "Colorful flower stalls create vibrant morning scenes while nearby street-food lanes serve breakfast treats."
    },
    {
      "name": "Hội An Central Market",
      "coord": [
        15.87516,
        108.3294
      ],
      "desc": "Fresh produce + food stalls; riverfront; Market",
      "longDesc": "Fresh produce and food stalls reveal Hoi An's agricultural surroundings while offering riverfront browsing."
    },
    {
      "name": "Hội An Night Market (Nguyễn Hoàng)",
      "coord": [
        15.8785,
        108.316
      ],
      "desc": "Lanterns, handicrafts, street snacks; Night Market",
      "longDesc": "Lantern-lit stalls sell handicrafts and street snacks creating magical nighttime shopping atmosphere."
    },
    {
      "name": "Đà Nẵng Hàn Market",
      "coord": [
        16.136985,
        108.17639
      ],
      "desc": "Central market for local snacks + souvenirs; Market",
      "longDesc": "Central Da Nang market offers local snacks, souvenirs, and glimpses into daily Vietnamese commerce."
    },
    {
      "name": "Đà Nẵng Cồn Market",
      "coord": [
        16.02473,
        108.220285
      ],
      "desc": "Bustling local market with strong street-food scene; Market/Food Hall",
      "longDesc": "Bustling local market with strong street-food scene reveals where Da Nang residents actually shop and eat."
    },
    {
      "name": "Dương Đông Night Market",
      "coord": [
        10.1965,
        103.9815
      ],
      "desc": "Seafood grills + souvenir stalls; Night Market",
      "longDesc": "Seafood grills and souvenir stalls define Phu Quoc's beach-town browsing and casual evening entertainment."
    },
    {
      "name": "Cái Răng Floating Market",
      "coord": [
        10.003433,
        105.745088
      ],
      "desc": "Classic Mekong floating market at sunrise; Floating Market",
      "longDesc": "Classic Mekong floating market at sunrise showcases water-based commerce where boats become the marketplace."
    },
    {
      "name": "Cái Bè Market Area",
      "coord": [
        10.33333,
        106.03333
      ],
      "desc": "River commerce + local crafts stops; Market/Boat Stops",
      "longDesc": "River commerce and local craft stops along waterways reveal Mekong culture through market activity."
    },
    {
      "name": "Sapa Love Market / Weekend Market (area)",
      "coord": [
        22.3402,
        103.8463
      ],
      "desc": "Highland crafts & textiles (seasonal/weekend); Market",
      "longDesc": "Highland markets selling textiles and crafts appear seasonally revealing indigenous artistry at source."
    },
    {
      "name": "Chợ Đêm Nha Trang (Night Market)",
      "coord": [
        12.242816,
        109.190379
      ],
      "desc": "Beach-town browsing + snacks; Night Market",
      "longDesc": "Beach-town night market offers browsing, souvenir hunting, and fresh snacks under lights."
    }
  ],
  "cityCenters": {
    "Hanoi": [
      21.0285,
      105.8542,
      0.05
    ],
    "Ha Long Bay": [
      20.96,
      107.04,
      0.08
    ],
    "Ninh Binh": [
      20.2341,
      105.438,
      0.04
    ],
    "Sapa": [
      22.3362,
      103.8436,
      0.05
    ],
    "Hue": [
      16.4619,
      107.5955,
      0.04
    ],
    "Da Nang": [
      16.0544,
      108.2022,
      0.04
    ],
    "Hoi An": [
      15.8761,
      108.3368,
      0.03
    ],
    "Nha Trang": [
      12.2588,
      109.1967,
      0.04
    ],
    "Phu Quoc": [
      10.1875,
      104.0008,
      0.08
    ],
    "Ho Chi Minh City": [
      10.7769,
      106.6995,
      0.06
    ],
    "Can Tho": [
      10.0364,
      105.7875,
      0.04
    ]
  },
  "itineraryData": {
    "a": {
      "name": "Greatest Hits (7 days)",
      "color": "#2563EB",
      "days": [
        {
          "day": 1,
          "title": "Hanoi Arrival & Old Quarter Exploration",
          "items": [
            {
              "type": "hotel",
              "name": "Capella Hanoi",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "breakfast",
              "name": "Local pho stall near Hoan Kiem Lake",
              "coord": [
                21.0285,
                105.8545
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hoan Kiem Lake & surrounding temples",
              "coord": [
                21.0285,
                105.8545
              ]
            },
            {
              "type": "lunch",
              "name": "Bun Cha Ta (traditional bun cha)",
              "coord": [
                21.035,
                105.86
              ]
            },
            {
              "type": "dinner",
              "name": "Hibana by Koki",
              "coord": [
                21.0305,
                105.8582
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Hanoi Culture & Museums",
          "items": [
            {
              "type": "breakfast",
              "name": "Coffee at Hanoi Old Quarter",
              "coord": [
                21.0301,
                105.8529
              ]
            },
            {
              "type": "sightseeing",
              "name": "Vietnam Museum of Ethnology",
              "coord": [
                21.040077,
                105.79884
              ]
            },
            {
              "type": "lunch",
              "name": "Tầm Vị (classic Vietnamese)",
              "coord": [
                21.01397,
                105.32996
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hanoi French Quarter walk",
              "coord": [
                21.027,
                105.845
              ]
            },
            {
              "type": "dinner",
              "name": "Street food crawl in Old Quarter",
              "coord": [
                21.0315,
                105.8555
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Ha Long Bay Cruise",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Ha Long Bay",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "hotel",
              "name": "InterContinental Halong Bay Resort",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ha Long Bay Cruise & Sung Sot Cave",
              "coord": [
                20.85,
                107.15
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner on cruise boat",
              "coord": [
                20.9,
                107.05
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Ha Long Bay Morning & Fly to Hoi An",
          "items": [
            {
              "type": "breakfast",
              "name": "Sunrise on Ha Long Bay",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Kayaking & swimming",
              "coord": [
                20.88,
                107.08
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch on boat",
              "coord": [
                20.9,
                107.05
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Da Nang",
              "coord": [
                16.0544,
                108.2022
              ]
            },
            {
              "type": "hotel",
              "name": "Four Seasons Resort The Nam Hai",
              "coord": [
                15.876,
                108.315
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Hoi An Ancient Town & Beaches",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.876,
                108.315
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hoi An Ancient Town walk",
              "coord": [
                15.8761,
                108.3368
              ]
            },
            {
              "type": "lunch",
              "name": "Cafe Faifo (local Hoi An cuisine)",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lantern-making workshop",
              "coord": [
                15.878,
                108.337
              ]
            },
            {
              "type": "dinner",
              "name": "Gia restaurant (1* Michelin)",
              "coord": [
                10.01071,
                105.083262
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Beach Day & Drive to Ho Chi Minh City",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.876,
                108.315
              ]
            },
            {
              "type": "sightseeing",
              "name": "An Bang Beach swimming & sunset",
              "coord": [
                15.915667,
                108.336874
              ]
            },
            {
              "type": "lunch",
              "name": "Beachside lunch",
              "coord": [
                15.916,
                108.3365
              ]
            },
            {
              "type": "sightseeing",
              "name": "Fly to Ho Chi Minh City",
              "coord": [
                10.7769,
                106.6995
              ]
            },
            {
              "type": "hotel",
              "name": "The Reverie Saigon",
              "coord": [
                10.773873,
                106.704865
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Ho Chi Minh City & Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                10.773873,
                106.704865
              ]
            },
            {
              "type": "sightseeing",
              "name": "War Remnants Museum",
              "coord": [
                10.7738,
                106.692
              ]
            },
            {
              "type": "lunch",
              "name": "Ănăn Saigon (1* Michelin)",
              "coord": [
                10.771803,
                106.702975
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ben Thanh Market",
              "coord": [
                10.7723,
                106.6989
              ]
            },
            {
              "type": "dinner",
              "name": "Saigon river sunset cruise",
              "coord": [
                10.775381,
                106.704711
              ]
            }
          ]
        }
      ]
    },
    "b": {
      "name": "Hidden Gems (7 days)",
      "color": "#059669",
      "days": [
        {
          "day": 1,
          "title": "Hanoi Old Quarter Deep Dive",
          "items": [
            {
              "type": "hotel",
              "name": "Sofitel Legend Metropole Hanoi",
              "coord": [
                21.025488,
                105.855978
              ]
            },
            {
              "type": "breakfast",
              "name": "Local egg coffee in Old Quarter",
              "coord": [
                21.0301,
                105.8529
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hidden alleyway exploration",
              "coord": [
                21.033,
                105.855
              ]
            },
            {
              "type": "lunch",
              "name": "Bun Cha Traditional",
              "coord": [
                21.035,
                105.86
              ]
            },
            {
              "type": "sightseeing",
              "name": "Night market at Dong Xuan",
              "coord": [
                21.039,
                105.858
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Ninh Binh Karst Landscape",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.025488,
                105.855978
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Ninh Binh",
              "coord": [
                20.2341,
                105.438
              ]
            },
            {
              "type": "hotel",
              "name": "Jiva Hoa Lu Retreat",
              "coord": [
                20.241,
                105.438
              ]
            },
            {
              "type": "lunch",
              "name": "Local village restaurant",
              "coord": [
                20.235,
                105.44
              ]
            },
            {
              "type": "sightseeing",
              "name": "Trang An Grotto & kayaking",
              "coord": [
                20.22,
                105.42
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Sapa Mountains & Rice Terraces",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                20.241,
                105.438
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Sapa",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "hotel",
              "name": "Boutique hotel in Sapa (TBD)",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "sightseeing",
              "name": "Morning mist & rice terraces",
              "coord": [
                22.32,
                103.83
              ]
            },
            {
              "type": "dinner",
              "name": "Local Hmong cuisine",
              "coord": [
                22.3362,
                103.8436
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Sapa Trekking & Villages",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cat Cat Village trek",
              "coord": [
                22.33,
                103.85
              ]
            },
            {
              "type": "lunch",
              "name": "Picnic lunch on trek",
              "coord": [
                22.325,
                103.845
              ]
            },
            {
              "type": "sightseeing",
              "name": "Silver waterfall visit",
              "coord": [
                22.41,
                103.82
              ]
            },
            {
              "type": "dinner",
              "name": "Sapa town restaurant",
              "coord": [
                22.3362,
                103.8436
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Hue Imperial City",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Hue",
              "coord": [
                16.4619,
                107.5955
              ]
            },
            {
              "type": "hotel",
              "name": "Azerai La Residence, Hue",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "lunch",
              "name": "Hue royal cuisine",
              "coord": [
                16.46,
                107.59
              ]
            },
            {
              "type": "sightseeing",
              "name": "Forbidden Purple City",
              "coord": [
                16.4689,
                107.5923
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Hue Perfume River & Tombs",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "sightseeing",
              "name": "Perfume River cruise",
              "coord": [
                16.46,
                107.595
              ]
            },
            {
              "type": "sightseeing",
              "name": "Emperors tombs (Minh Mang)",
              "coord": [
                16.42,
                107.61
              ]
            },
            {
              "type": "lunch",
              "name": "Riverside lunch",
              "coord": [
                16.46,
                107.595
              ]
            },
            {
              "type": "sightseeing",
              "name": "Thien Mu Pagoda",
              "coord": [
                16.48,
                107.59
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Hue to Ho Chi Minh City",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "sightseeing",
              "name": "Fly to Ho Chi Minh City",
              "coord": [
                10.7769,
                106.6995
              ]
            },
            {
              "type": "hotel",
              "name": "Park Hyatt Saigon",
              "coord": [
                10.777534,
                106.703416
              ]
            },
            {
              "type": "lunch",
              "name": "Casual lunch in District 1",
              "coord": [
                10.775,
                106.7
              ]
            },
            {
              "type": "dinner",
              "name": "Rooftop bar experience",
              "coord": [
                10.7769,
                106.6995
              ]
            }
          ]
        }
      ]
    },
    "c": {
      "name": "Family Comfort (10 days)",
      "color": "#D97706",
      "days": [
        {
          "day": 1,
          "title": "Hanoi Arrival",
          "items": [
            {
              "type": "hotel",
              "name": "Lotte Hotel Hanoi",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "lunch",
              "name": "Pho restaurant near hotel",
              "coord": [
                21.032,
                105.813
              ]
            },
            {
              "type": "nap",
              "name": "Rest at hotel",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Gentle Old Quarter walk",
              "coord": [
                21.0301,
                105.8529
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Hanoi Kid Activities",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Thăng Long Water Puppet Show",
              "coord": [
                21.040077,
                105.79884
              ]
            },
            {
              "type": "lunch",
              "name": "Family-friendly restaurant",
              "coord": [
                21.035,
                105.85
              ]
            },
            {
              "type": "nap",
              "name": "Afternoon rest",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hoan Kiem Lake & ice cream",
              "coord": [
                21.0285,
                105.8545
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Day trip to Trang An",
          "items": [
            {
              "type": "breakfast",
              "name": "Early hotel breakfast",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Trang An (2 hrs)",
              "coord": [
                20.2341,
                105.438
              ]
            },
            {
              "type": "lunch",
              "name": "Local restaurant in Ninh Binh",
              "coord": [
                20.235,
                105.44
              ]
            },
            {
              "type": "sightseeing",
              "name": "Trang An kayaking (family-paced)",
              "coord": [
                20.22,
                105.42
              ]
            },
            {
              "type": "optional",
              "name": "Return to Hanoi",
              "coord": [
                21.032168,
                105.812493
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Relax day in Hanoi",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Kids zone at Vietnam Museum of Ethnology",
              "coord": [
                21.040077,
                105.79884
              ]
            },
            {
              "type": "lunch",
              "name": "Relaxed lunch",
              "coord": [
                21.035,
                105.85
              ]
            },
            {
              "type": "nap",
              "name": "Afternoon nap",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "optional",
              "name": "Pool time or stroll",
              "coord": [
                21.032168,
                105.812493
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Flight to Ha Long Bay",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast & checkout",
              "coord": [
                21.032168,
                105.812493
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Ha Long",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "hotel",
              "name": "InterContinental Halong Bay Resort",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "lunch",
              "name": "Hotel lunch",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "nap",
              "name": "Rest before evening",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "dinner",
              "name": "Dinner at hotel",
              "coord": [
                20.96,
                107.04
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Ha Long Bay Family Cruise",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cruise & cave exploration",
              "coord": [
                20.85,
                107.15
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch on boat",
              "coord": [
                20.9,
                107.05
              ]
            },
            {
              "type": "nap",
              "name": "Quiet time on boat",
              "coord": [
                20.9,
                107.05
              ]
            },
            {
              "type": "sightseeing",
              "name": "Swimming & sunset",
              "coord": [
                20.88,
                107.08
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Ha Long Bay Morning & Travel to Hoi An",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Easy morning activity",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "lunch",
              "name": "Hotel lunch",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Da Nang/Hoi An",
              "coord": [
                15.8761,
                108.3368
              ]
            },
            {
              "type": "hotel",
              "name": "Anantara Hoi An Resort",
              "coord": [
                15.87706,
                108.33699
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Hoi An Ancient Town Kids Day",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.87706,
                108.33699
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lantern-making workshop (kids)",
              "coord": [
                15.878,
                108.337
              ]
            },
            {
              "type": "lunch",
              "name": "Local Hoi An cuisine",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "nap",
              "name": "Afternoon rest",
              "coord": [
                15.87706,
                108.33699
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ancient town night stroll & lights",
              "coord": [
                15.8761,
                108.3368
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Beach day in Hoi An",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.87706,
                108.33699
              ]
            },
            {
              "type": "sightseeing",
              "name": "An Bang Beach swimming",
              "coord": [
                15.915667,
                108.336874
              ]
            },
            {
              "type": "lunch",
              "name": "Beachside lunch",
              "coord": [
                15.916,
                108.3365
              ]
            },
            {
              "type": "nap",
              "name": "Quiet beach time",
              "coord": [
                15.916,
                108.3365
              ]
            },
            {
              "type": "optional",
              "name": "Sunset walk on beach",
              "coord": [
                15.915667,
                108.336874
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Hoi An & Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.87706,
                108.33699
              ]
            },
            {
              "type": "optional",
              "name": "Last-minute stroll or shopping",
              "coord": [
                15.8761,
                108.3368
              ]
            },
            {
              "type": "lunch",
              "name": "Farewell lunch",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "sightseeing",
              "name": "Depart for airport",
              "coord": [
                15.8761,
                108.3368
              ]
            }
          ]
        }
      ]
    },
    "d": {
      "name": "Foodie Deep-Dive (10 days)",
      "color": "#DC2626",
      "days": [
        {
          "day": 1,
          "title": "Hanoi Street Food Immersion",
          "items": [
            {
              "type": "hotel",
              "name": "Capella Hanoi",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "breakfast",
              "name": "Egg coffee & banh mi crawl",
              "coord": [
                21.0301,
                105.8529
              ]
            },
            {
              "type": "lunch",
              "name": "Bun Cha Ta",
              "coord": [
                21.035,
                105.86
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hanoi street food walking tour",
              "coord": [
                21.0315,
                105.8555
              ]
            },
            {
              "type": "dinner",
              "name": "Hibana by Koki (Michelin)",
              "coord": [
                21.0305,
                105.8582
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Hanoi High Cuisine",
          "items": [
            {
              "type": "breakfast",
              "name": "Local cafe breakfast",
              "coord": [
                21.0301,
                105.8529
              ]
            },
            {
              "type": "sightseeing",
              "name": "Market visit (Dong Xuan)",
              "coord": [
                21.039,
                105.858
              ]
            },
            {
              "type": "lunch",
              "name": "Tầm Vị (Michelin)",
              "coord": [
                21.01397,
                105.32996
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cooking class in home setting",
              "coord": [
                21.0301,
                105.8529
              ]
            },
            {
              "type": "dinner",
              "name": "Refined Hanoi dinner",
              "coord": [
                21.03,
                105.858
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Ha Long Bay Gourmet",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Ha Long Bay",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "hotel",
              "name": "InterContinental Halong Bay Resort",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "lunch",
              "name": "Fresh seafood lunch",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "dinner",
              "name": "Premium seafood dinner",
              "coord": [
                20.96,
                107.04
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Ha Long Bay & Fishing Village",
          "items": [
            {
              "type": "breakfast",
              "name": "Cruise breakfast",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ha Long Bay cruise & kayak",
              "coord": [
                20.85,
                107.15
              ]
            },
            {
              "type": "lunch",
              "name": "Local fishing village meal",
              "coord": [
                20.9,
                107.05
              ]
            },
            {
              "type": "sightseeing",
              "name": "Floating market exploration",
              "coord": [
                20.92,
                107.02
              ]
            },
            {
              "type": "dinner",
              "name": "Fresh catch dinner",
              "coord": [
                20.96,
                107.04
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Hue Imperial Court Cuisine",
          "items": [
            {
              "type": "breakfast",
              "name": "Early breakfast & depart",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Hue",
              "coord": [
                16.4619,
                107.5955
              ]
            },
            {
              "type": "hotel",
              "name": "Azerai La Residence, Hue",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "lunch",
              "name": "Imperial Hue cuisine tasting",
              "coord": [
                16.46,
                107.59
              ]
            },
            {
              "type": "dinner",
              "name": "Royal banquet-style meal",
              "coord": [
                16.4591,
                107.580153
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Hue Food Culture Deep Dive",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "sightseeing",
              "name": "Local cooking class",
              "coord": [
                16.46,
                107.59
              ]
            },
            {
              "type": "lunch",
              "name": "Market-to-table meal",
              "coord": [
                16.462,
                107.592
              ]
            },
            {
              "type": "sightseeing",
              "name": "Food market exploration",
              "coord": [
                16.465,
                107.588
              ]
            },
            {
              "type": "dinner",
              "name": "Chefs special menu",
              "coord": [
                16.4591,
                107.580153
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Hoi An Culinary Arts",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Hoi An",
              "coord": [
                15.8761,
                108.3368
              ]
            },
            {
              "type": "hotel",
              "name": "Four Seasons Resort The Nam Hai",
              "coord": [
                15.876,
                108.315
              ]
            },
            {
              "type": "lunch",
              "name": "Local Hoi An specialty lunch",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hoi An culinary walking tour",
              "coord": [
                15.8761,
                108.3368
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Hoi An Market & Cooking",
          "items": [
            {
              "type": "breakfast",
              "name": "Early market visit & breakfast",
              "coord": [
                15.8765,
                108.3375
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cooking class with local chef",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "lunch",
              "name": "Cook & eat your meal",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "sightseeing",
              "name": "Town walk & coffee",
              "coord": [
                15.8761,
                108.3368
              ]
            },
            {
              "type": "dinner",
              "name": "Gia (Michelin restaurant)",
              "coord": [
                10.01071,
                105.083262
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Ho Chi Minh City Dining Experience",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.876,
                108.315
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Ho Chi Minh City",
              "coord": [
                10.7769,
                106.6995
              ]
            },
            {
              "type": "hotel",
              "name": "The Reverie Saigon",
              "coord": [
                10.773873,
                106.704865
              ]
            },
            {
              "type": "lunch",
              "name": "Ănăn Saigon (Michelin)",
              "coord": [
                10.771803,
                106.702975
              ]
            },
            {
              "type": "dinner",
              "name": "Multi-course tasting menu",
              "coord": [
                10.773873,
                106.704865
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "HCMC Final Food Experiences",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                10.773873,
                106.704865
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ben Thanh Market food tour",
              "coord": [
                10.7723,
                106.6989
              ]
            },
            {
              "type": "lunch",
              "name": "Street food crawl in District 1",
              "coord": [
                10.775,
                106.7
              ]
            },
            {
              "type": "optional",
              "name": "Cafe & dessert before departure",
              "coord": [
                10.7769,
                106.6995
              ]
            },
            {
              "type": "dinner",
              "name": "Farewell dinner at rooftop",
              "coord": [
                10.773873,
                106.704865
              ]
            }
          ]
        }
      ]
    },
    "e": {
      "name": "Grand Tour (14 days)",
      "color": "#7C3AED",
      "days": [
        {
          "day": 1,
          "title": "Hanoi Arrival & Exploration",
          "items": [
            {
              "type": "hotel",
              "name": "Capella Hanoi",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "breakfast",
              "name": "Local breakfast",
              "coord": [
                21.0301,
                105.8529
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hoan Kiem Lake & Old Quarter",
              "coord": [
                21.0285,
                105.8545
              ]
            },
            {
              "type": "lunch",
              "name": "Traditional pho",
              "coord": [
                21.032,
                105.855
              ]
            },
            {
              "type": "dinner",
              "name": "Hibana by Koki (Michelin)",
              "coord": [
                21.0305,
                105.8582
              ]
            }
          ]
        },
        {
          "day": 2,
          "title": "Hanoi Culture & History",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "sightseeing",
              "name": "Vietnam Museum of Ethnology",
              "coord": [
                21.040077,
                105.79884
              ]
            },
            {
              "type": "lunch",
              "name": "Tầm Vị (Michelin)",
              "coord": [
                21.01397,
                105.32996
              ]
            },
            {
              "type": "sightseeing",
              "name": "French Quarter architecture walk",
              "coord": [
                21.027,
                105.845
              ]
            },
            {
              "type": "dinner",
              "name": "Street food experience",
              "coord": [
                21.0315,
                105.8555
              ]
            }
          ]
        },
        {
          "day": 3,
          "title": "Sapa Mountain & Rice Terraces",
          "items": [
            {
              "type": "breakfast",
              "name": "Early departure",
              "coord": [
                21.025715,
                105.85681
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Sapa",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "hotel",
              "name": "Mountain retreat (TBD)",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "lunch",
              "name": "Local Sapa cuisine",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "sightseeing",
              "name": "Rice terrace sunset",
              "coord": [
                22.32,
                103.83
              ]
            }
          ]
        },
        {
          "day": 4,
          "title": "Sapa Trekking & Villages",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "sightseeing",
              "name": "Cat Cat Village trek",
              "coord": [
                22.33,
                103.85
              ]
            },
            {
              "type": "lunch",
              "name": "Picnic lunch",
              "coord": [
                22.325,
                103.845
              ]
            },
            {
              "type": "sightseeing",
              "name": "Silver Waterfall",
              "coord": [
                22.41,
                103.82
              ]
            },
            {
              "type": "dinner",
              "name": "Mountain town dinner",
              "coord": [
                22.3362,
                103.8436
              ]
            }
          ]
        },
        {
          "day": 5,
          "title": "Ninh Binh Karst Landscape",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                22.3362,
                103.8436
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight back to Hanoi",
              "coord": [
                21.0285,
                105.8545
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Ninh Binh",
              "coord": [
                20.2341,
                105.438
              ]
            },
            {
              "type": "hotel",
              "name": "Jiva Hoa Lu Retreat",
              "coord": [
                20.241,
                105.438
              ]
            },
            {
              "type": "lunch",
              "name": "Local restaurant",
              "coord": [
                20.235,
                105.44
              ]
            },
            {
              "type": "sightseeing",
              "name": "Trang An kayaking sunset",
              "coord": [
                20.22,
                105.42
              ]
            }
          ]
        },
        {
          "day": 6,
          "title": "Ninh Binh Exploration & Ha Long",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                20.241,
                105.438
              ]
            },
            {
              "type": "sightseeing",
              "name": "Bai Dinh Pagoda",
              "coord": [
                20.265,
                105.41
              ]
            },
            {
              "type": "lunch",
              "name": "Local lunch",
              "coord": [
                20.235,
                105.44
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Ha Long Bay",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "hotel",
              "name": "InterContinental Halong Bay Resort",
              "coord": [
                20.96,
                107.04
              ]
            }
          ]
        },
        {
          "day": 7,
          "title": "Ha Long Bay Cruise & Caves",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Ha Long Bay cruise",
              "coord": [
                20.85,
                107.15
              ]
            },
            {
              "type": "lunch",
              "name": "Seafood lunch on boat",
              "coord": [
                20.9,
                107.05
              ]
            },
            {
              "type": "sightseeing",
              "name": "Sung Sot Cave & swimming",
              "coord": [
                20.88,
                107.08
              ]
            },
            {
              "type": "dinner",
              "name": "Floating village dinner",
              "coord": [
                20.96,
                107.04
              ]
            }
          ]
        },
        {
          "day": 8,
          "title": "Ha Long to Hoi An",
          "items": [
            {
              "type": "breakfast",
              "name": "Early breakfast",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Morning bay activity",
              "coord": [
                20.88,
                107.08
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch before departure",
              "coord": [
                20.96,
                107.04
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Da Nang",
              "coord": [
                16.0544,
                108.2022
              ]
            },
            {
              "type": "hotel",
              "name": "Four Seasons Resort The Nam Hai",
              "coord": [
                15.876,
                108.315
              ]
            }
          ]
        },
        {
          "day": 9,
          "title": "Hoi An Ancient Town & Beaches",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.876,
                108.315
              ]
            },
            {
              "type": "sightseeing",
              "name": "Hoi An Old Town walking tour",
              "coord": [
                15.8761,
                108.3368
              ]
            },
            {
              "type": "lunch",
              "name": "Local Hoi An cuisine",
              "coord": [
                15.875,
                108.336
              ]
            },
            {
              "type": "sightseeing",
              "name": "Lantern-making workshop",
              "coord": [
                15.878,
                108.337
              ]
            },
            {
              "type": "dinner",
              "name": "Riverside dinner",
              "coord": [
                15.875,
                108.336
              ]
            }
          ]
        },
        {
          "day": 10,
          "title": "Hue Imperial City",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                15.876,
                108.315
              ]
            },
            {
              "type": "sightseeing",
              "name": "Drive to Hue (scenic route)",
              "coord": [
                16.4619,
                107.5955
              ]
            },
            {
              "type": "hotel",
              "name": "Azerai La Residence, Hue",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "lunch",
              "name": "Imperial Hue cuisine",
              "coord": [
                16.46,
                107.59
              ]
            },
            {
              "type": "sightseeing",
              "name": "Forbidden City exploration",
              "coord": [
                16.4689,
                107.5923
              ]
            }
          ]
        },
        {
          "day": 11,
          "title": "Hue Culture & Traditions",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "sightseeing",
              "name": "Perfume River cruise",
              "coord": [
                16.46,
                107.595
              ]
            },
            {
              "type": "lunch",
              "name": "Lunch cruise",
              "coord": [
                16.46,
                107.595
              ]
            },
            {
              "type": "sightseeing",
              "name": "Minh Mang Tomb visit",
              "coord": [
                16.42,
                107.61
              ]
            },
            {
              "type": "dinner",
              "name": "Traditional Hue dinner",
              "coord": [
                16.4591,
                107.580153
              ]
            }
          ]
        },
        {
          "day": 12,
          "title": "Nha Trang Beaches & Islands",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                16.4591,
                107.580153
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Nha Trang",
              "coord": [
                12.2588,
                109.1967
              ]
            },
            {
              "type": "hotel",
              "name": "Mia Resort Nha Trang",
              "coord": [
                12.234877,
                109.194144
              ]
            },
            {
              "type": "lunch",
              "name": "Beach lunch",
              "coord": [
                12.258,
                109.195
              ]
            },
            {
              "type": "sightseeing",
              "name": "Nha Trang beach & island tour",
              "coord": [
                12.24,
                109.18
              ]
            }
          ]
        },
        {
          "day": 13,
          "title": "Phu Quoc Island Paradise",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                12.234877,
                109.194144
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Phu Quoc",
              "coord": [
                10.1875,
                104.0008
              ]
            },
            {
              "type": "hotel",
              "name": "JW Marriott Phu Quoc Emerald Bay Resort & Spa",
              "coord": [
                10.033482,
                104.02817
              ]
            },
            {
              "type": "lunch",
              "name": "Beach lunch",
              "coord": [
                10.035,
                104.028
              ]
            },
            {
              "type": "sightseeing",
              "name": "Island exploration & sunset",
              "coord": [
                10.1875,
                104.0008
              ]
            }
          ]
        },
        {
          "day": 14,
          "title": "Ho Chi Minh City & Departure",
          "items": [
            {
              "type": "breakfast",
              "name": "Hotel breakfast",
              "coord": [
                10.033482,
                104.02817
              ]
            },
            {
              "type": "sightseeing",
              "name": "Flight to Ho Chi Minh City",
              "coord": [
                10.7769,
                106.6995
              ]
            },
            {
              "type": "hotel",
              "name": "The Reverie Saigon",
              "coord": [
                10.773873,
                106.704865
              ]
            },
            {
              "type": "lunch",
              "name": "Final lunch in Saigon",
              "coord": [
                10.771803,
                106.702975
              ]
            },
            {
              "type": "optional",
              "name": "Last-minute shopping or sightseeing",
              "coord": [
                10.7769,
                106.6995
              ]
            },
            {
              "type": "dinner",
              "name": "Farewell dinner",
              "coord": [
                10.773873,
                106.704865
              ]
            }
          ]
        }
      ]
    }
  }
}